[
  {
    "title": "RESTful API Geliştirme (.NET Core)",
    "description": ".NET Core teknolojisiyle kurumsal uygulama için RESTful API geliştirme. Güvenlik, ölçeklenebilirlik ve performans odaklı bir mimari.\n\nVeritabanı katmanı: Entity Framework Core ile veri işlemleri. PostgreSQL veritabanı ve migration sistemi. Repository pattern ve Unit of Work pattern implementasyonu.\n\nGüvenlik: JWT authentication, refresh token mekanizması, role-based authorization. Swagger dokümantasyonu. Rate limiting.\n\nHata yönetimi: Merkezi error handling middleware. Input validation. CORS yapılandırması.\n\nPerformans: API versioning. Redis ile caching stratejisi. Unit ve integration testler.",
    "budget": 45000,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Node.js Microservices Mimarisi",
    "description": "Yüksek trafikli uygulama için Node.js tabanlı microservices mimarisi. Ölçeklenebilir ve dayanıklı bir sistem kurulumu.\n\nMimari bileşenler:\n- API Gateway (Kong veya custom) - istek yönlendirme\n- Service discovery (Consul/Eureka) - servis keşfi\n- Load balancing - trafik dağıtımı\n- Message queue (RabbitMQ/Kafka) - asenkron iletişim\n- Event-driven architecture - gevşek bağlantı\n\nGüvenlik ve yönetim: Merkezi authentication service. Database per service yaklaşımı. Logging ve monitoring (ELK stack, Prometheus). Docker containerization.\n\nDokümantasyon: OpenAPI/Swagger. Circuit breaker pattern. Distributed tracing.",
    "budget": 85000,
    "deadline": "2025-04-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Python Django REST API",
    "description": "Django REST Framework ile modern web uygulaması için RESTful API. Standartlara uygun, dokümante edilmiş bir çözüm.\n\nKimlik doğrulama: JWT token tabanlı authentication. Kullanıcı kayıt, giriş, şifre sıfırlama, e-posta doğrulama.\n\nCRUD işlemleri: Tüm kaynaklar için create, read, update, delete. Dosya yükleme desteği.\n\nVeri yönetimi: Pagination, filtering, searching, sorting. Swagger/OpenAPI dokümantasyonu (drf-spectacular veya drf-yasg). Permission classes.\n\nAltyapı: PostgreSQL veritabanı. Serializers ile veri doğrulama. Unit ve integration testler. CORS yapılandırması.",
    "budget": 40000,
    "deadline": "2025-03-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "GraphQL API (Node.js)",
    "description": "Esnek sorgulama ve verimli veri çekme imkanı sunan GraphQL API. Apollo Server veya GraphQL Yoga ile Node.js geliştirme.\n\nTemel yapı: Schema definition ile type system. Resolvers ile business logic. Authentication ve authorization (field-level, object-level). DataLoader ile N+1 query optimizasyonu.\n\nGerçek zamanlı özellikler: Subscriptions. Dosya yükleme (graphql-upload).\n\nTest ve hata yönetimi: GraphQL Playground veya GraphiQL. Anlamlı hata mesajları.\n\nAltyapı: MongoDB veya PostgreSQL. Caching stratejisi. Rate limiting. API dokümantasyonu.",
    "budget": 50000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Payment Gateway Entegrasyonu",
    "description": "E-ticaret platformu için güvenli ödeme işleme sistemi. iyzico ve PayTR entegrasyonları.\n\nÖdeme yöntemleri: Kredi kartı, banka kartı, havale/EFT. 3D Secure doğrulama. İade işlemleri (tam ve kısmi). Webhook handling.\n\nGüvenlik: Fraud detection, IP kontrolü, rate limiting, şüpheli işlem tespiti. Kapsamlı logging.\n\nGeliştirme: Node.js veya PHP backend. Sandbox test ortamı. Production deployment. Dokümantasyon.",
    "budget": 35000,
    "deadline": "2025-03-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Real-time Chat Backend",
    "description": "Binlerce eşzamanlı kullanıcıyı destekleyen WebSocket tabanlı gerçek zamanlı chat backend'i. Socket.io veya SignalR teknolojileri.\n\nBağlantı yönetimi: Connection management, room management. Mesaj geçmişi ve pagination. Dosya ve görsel paylaşımı.\n\nKullanıcı durumu: Online/offline presence. Typing indicators.\n\nÖlçeklenebilirlik: Node.js veya .NET Core. Redis pub/sub ile horizontal scaling. Message queue ile güvenilir mesajlaşma.\n\nGüvenlik: Authentication. Rate limiting. İçerik moderasyonu.",
    "budget": 55000,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Email Service API",
    "description": "Güvenilir ve ölçeklenebilir e-posta gönderim servisi. SMTP entegrasyonu ve SendGrid, Mailgun veya AWS SES kullanımı.\n\nŞablon yönetimi: Dinamik e-posta şablonları. Queue system (Bull, BullMQ) ile asenkron gönderim. Retry mechanism.\n\nYönetim: Bounce handling. Unsubscribe management. Analytics: açılma ve tıklama oranları. API endpoints.\n\nAltyapı: Node.js veya Python. Rate limiting. Logging. Error handling.",
    "budget": 30000,
    "deadline": "2025-02-28T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "File Storage Service",
    "description": "Güvenli ve ölçeklenebilir dosya yönetim servisi. AWS S3 veya Azure Blob Storage entegrasyonu.\n\nDosya işlemleri: Upload API, multipart upload (büyük dosyalar). Görsel işleme: optimize, resize, crop, watermark. CDN entegrasyonu (CloudFront, Azure CDN).\n\nAPI: Yükleme, indirme, silme, listeleme. Güvenlik: dosya tipi kontrolü, boyut limiti, virus scanning. Access control. Presigned URLs.\n\nGeliştirme: Node.js veya Python. Logging. Error handling. Dokümantasyon.",
    "budget": 40000,
    "deadline": "2025-03-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Background Job Processing",
    "description": "Uzun süren işleri asenkron olarak işleyen arka plan iş yönetim sistemi. Bull/BullMQ veya Hangfire kullanımı.\n\nİş yönetimi: Job creation, worker processes. Retry mechanism (exponential backoff). Job priority. Scheduling (cron jobs). Job status tracking.\n\nİzleme: Kuyruk durumu, iş durumu, hata oranları. Dashboard.\n\nAltyapı: Node.js veya .NET Core. Redis queue storage. Error handling. Logging.",
    "budget": 45000,
    "deadline": "2025-03-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "API Rate Limiting ve Caching",
    "description": "Mevcut API'ye rate limiting ve caching özellikleri ekleme. API abuse önleme ve performans artırma.\n\nRate limiting: Redis tabanlı. Token bucket veya sliding window algoritması. Per-user, per-IP, per-endpoint limitler.\n\nCaching: Cache invalidation stratejisi. TTL yönetimi. Cache warming.\n\nYapılandırma: Endpoint bazlı limit kuralları. Response headers ile limit bilgisi.\n\nİzleme: Rate limit ihlalleri, cache hit/miss oranları. Dashboard. Redis cluster. Error handling. Dokümantasyon.",
    "budget": 25000,
    "deadline": "2025-02-22T00:00:00.000Z",
    "status": "open"
  }
]
