[
  {
    "title": "DeFi Protokolü ve Akıllı Kontrat Geliştirme",
    "description": "<p>Merkeziyetsiz finans (DeFi) girişimimiz için, Ethereum ağında çalışacak ve kullanıcıların tokenlarını kilitleyerek (staking) yıllık getiri (APY) kazanabileceği güvenli bir akıllı kontrat mimarisi istiyoruz. Piyasada çok fazla hack olayı yaşandığı için güvenlik bizim kırmızı çizgimizdir.</p><p><strong>Projenin teknik gereksinimleri şunlardır:</strong></p><ul><li><strong>Staking Mantığı:</strong> Kullanıcılar ERC-20 tokenlarını yatırabilmeli, istedikleri zaman çekebilmeli (unstake) ve hak ettikleri ödülleri (reward) talep edebilmelidir.</li><li><strong>Güvenlik Önlemleri:</strong> 'Reentrancy' saldırılarına karşı OpenZeppelin'in ReentrancyGuard modülü kullanılmalı ve tüm matematiksel işlemler için güvenli kütüphaneler tercih edilmelidir.</li><li><strong>Gas Optimizasyonu:</strong> Kontratın işlem maliyetlerini (gas fee) düşürmek için değişken paketleme (variable packing) ve gereksiz döngülerden kaçınma teknikleri uygulanmalıdır.</li><li><strong>Yönetim Paneli:</strong> Sadece 'Owner' yetkisine sahip cüzdanın faiz oranlarını ve havuz limitlerini değiştirebileceği, ancak kullanıcı fonlarına asla dokunamayacağı bir yetki yapısı kurulmalıdır.</li><li><strong>Test Süreçleri:</strong> Hardhat ortamında, tüm fonksiyonlar için %95 üzeri 'code coverage' sağlayacak unit testler yazılmalı ve raporlanmalıdır.</li></ul><p>Teslimatın, Rinkeby veya Sepolia test ağında deploy edilmiş ve doğrulanmış (verified) kontrat adresleri ile yapılmasını bekliyoruz.</p>",
    "budget": 9500,
    "deadline": "2025-05-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "NFT Marketplace ve Minting Platformu",
    "description": "<p>Dijital sanatçılar topluluğumuz için, OpenSea veya Rarible bağımlılığı olmadan kendi eserlerimizi sergileyip satabileceğimiz butik bir NFT pazar yeri (Marketplace) kurmak istiyoruz.</p><p><strong>İstenen özellikler ve akış:</strong></p><ul><li><strong>Kontrat Standartları:</strong> Koleksiyonlar için ERC-721A (gaz tasarruflu) ve çoklu edisyonlar için ERC-1155 standartlarına uygun, metadata'ları IPFS üzerinde tutan kontratlar yazılmalıdır.</li><li><strong>Satış Mekanizmaları:</strong> Platformda hem 'Sabit Fiyat' ile anında satış, hem de süre bitimli 'İngiliz Usulü Açık Artırma' (English Auction) özellikleri bulunmalıdır.</li><li><strong>Telif Hakları (Royalty):</strong> EIP-2981 standardı uygulanarak, eserlerin ikincil piyasadaki her satışından sanatçıya otomatik %5-%10 arası telif ödenmesi garanti altına alınmalıdır.</li><li><strong>Cüzdan Entegrasyonu:</strong> Frontend tarafında (React/Next.js) MetaMask, WalletConnect ve RainbowKit entegrasyonları yapılarak pürüzsüz bir bağlantı deneyimi sunulmalıdır.</li><li><strong>İndeksleme:</strong> Blockchain üzerindeki NFT verilerini (sahibi kim, son fiyatı ne) hızlıca çekmek için The Graph protokolü (subgraph) kullanılmalıdır.</li></ul><p>Proje, hem akıllı kontratların yazılmasını hem de bu kontratlarla konuşacak basit bir web arayüzünün (dApp) geliştirilmesini kapsamaktadır.</p>",
    "budget": 9800,
    "deadline": "2025-05-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Blockchain Cüzdan Uygulaması ve Güvenlik",
    "description": "<p>Mobil uygulamamızın içerisine gömmek (embed) üzere, kullanıcıların kripto varlıklarını yönetebileceği 'Non-Custodial' (kullanıcı kontrollü) bir cüzdan modülü geliştirtmek istiyoruz. Güvenlik ve kullanıcı deneyimi bu modülün en kritik iki bileşenidir.</p><p><strong>Geliştirilecek modülün detayları:</strong></p><ul><li><strong>Anahtar Yönetimi:</strong> Kullanıcının 'Private Key' veya 'Seed Phrase' bilgisi sunucularımızda ASLA tutulmamalı; cihazın güvenli donanımında (Secure Enclave / Keystore) şifreli olarak saklanmalıdır.</li><li><strong>Çoklu Ağ Desteği:</strong> Cüzdan, varsayılan olarak Ethereum, BSC (Binance Smart Chain) ve Polygon ağlarını desteklemeli, kullanıcı ağlar arası geçiş yapabilmelidir.</li><li><strong>İşlem İmzalama:</strong> Bir transfer işlemi yapılacağı zaman, kullanıcının biyometrik verisi (FaceID/TouchID) veya PIN kodu istenerek işlem cihaz üzerinde imzalanmalı ve ağa (RPC) gönderilmelidir.</li><li><strong>Token Tanıma:</strong> Kullanıcının cüzdanındaki ERC-20 token bakiyelerini otomatik tarayıp gösterecek ve fiyatlarını CoinGecko API'sinden çekecek bir yapı kurulmalıdır.</li><li><strong>Yedekleme:</strong> Cüzdan oluşturulurken kullanıcıya 12 kelimelik kurtarma ifadesini güvenli bir şekilde gösteren ve doğruluğunu test eden bir onboarding akışı tasarlanmalıdır.</li></ul><p>Teslim edilecek kodun React Native veya Flutter projesine entegre edilebilir bir kütüphane veya modül şeklinde paketlenmesi gerekmektedir.</p>",
    "budget": 8200,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Tokenomics ve Token Dağıtım Sistemi",
    "description": "<p>Yakında lansmanını yapacağımız oyun projemiz için, yatırımcıların ve ekibin güvenini kazanacak, ekonomik modeli sağlam bir ERC-20 token ve dağıtım altyapısı kurmamız gerekiyor.</p><p><strong>Smart Contract özellikleri:</strong></p><ul><li><strong>Vesting (Hakediş) Kontratı:</strong> Ekip, danışmanlar ve özel yatırımcılar için tokenları belirli bir süre kilitleyen ve 'Cliff' süresi dolduktan sonra parça parça (lineer) serbest bırakan bir vesting kontratı yazılmalıdır.</li><li><strong>Deflasyonist Mekanizma:</strong> Her transfer işleminde tokenların %1'inin otomatik olarak yakıldığı (Burn) veya likidite havuzuna eklendiği bir vergi (Tax) mekanizması isteğe bağlı olarak açılıp kapatılabilmelidir.</li><li><strong>Airdrop Aracı:</strong> Binlerce cüzdana toplu token gönderimi yaparken gas ücretini minimize etmek için 'Merkle Tree' tabanlı bir airdrop talep (claim) sayfası ve kontratı hazırlanmalıdır.</li><li><strong>Anti-Whale:</strong> Tek bir cüzdanın toplam arzın belirli bir yüzdesinden fazlasını tutmasını veya tek seferde satmasını engelleyen kısıtlamalar eklenebilmelidir.</li><li><strong>DAO Hazırlığı:</strong> Token kontratı, gelecekteki oylamalarda kullanılabilecek şekilde 'ERC-20 Votes' uzantılarını içermeli ve delegasyon özelliğine sahip olmalıdır.</li></ul><p>Token ekonomisi (Tokenomics) dokümanımızdaki oranlara birebir sadık kalınarak kodlama yapılmalı ve Remix üzerinde test edilmelidir.</p>",
    "budget": 5500,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Blockchain Oyun ve Play-to-Earn Mekanizması",
    "description": "<p>Unity ile geliştirdiğimiz kart oyunumuzun backend'ini Web3 dünyasına bağlamak ve oyuncuların kazandığı eşyaları gerçek NFT'lere dönüştürmek istiyoruz. Oyun içi ekonominin blockchain üzerinde şeffaf bir şekilde dönmesi gerekmektedir.</p><p><strong>Web3 entegrasyon kapsamı:</strong></p><ul><li><strong>NFT Karakterler:</strong> Oyuncuların sahip olduğu kahraman kartları ERC-721 formatında basılmalı (Mint), kartın seviyesi ve gücü metadata olarak zincir üzerinde veya IPFS'te güncellenebilmelidir.</li><li><strong>Ödül Sistemi:</strong> Oyuncular günlük görevleri tamamladığında, oyunun native tokenını (ERC-20) talep edebilecekleri (Claim) güvenli bir imza mekanizması kurulmalıdır (Server-side signing).</li><li><strong>Pazar Yeri Entegrasyonu:</strong> Oyunun içinden çıkmadan, oyuncuların kartlarını diğer oyunculara satabileceği basit bir takas kontratı yazılmalıdır.</li><li><strong>Staking:</strong> Oyuncuların nadir kartlarını belirli bir süre kilitleyerek pasif gelir veya güçlendirme (Buff) kazanabileceği bir staking modülü eklenmelidir.</li><li><strong>SDK Entegrasyonu:</strong> Unity oyun motoru ile blockchain arasında köprü kurmak için Moralis veya ChainSafe SDK'ları kullanılarak cüzdan bağlama ve işlem gönderme fonksiyonları yazılmalıdır.</li></ul><p>Oyunun akıcılığını bozmamak adına, işlemlerin hızlı ve ucuz olduğu Polygon veya Immutable X ağı tercih edilecektir.</p>",
    "budget": 9900,
    "deadline": "2025-05-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Supply Chain İzlenebilirlik ve Blockchain Entegrasyonu",
    "description": "<p>Lüks tüketim ürünleri satan firmamız için, ürünlerin üretimden son kullanıcıya kadar olan yolculuğunu değiştirilemez bir şekilde kaydedecek blockchain tabanlı bir takip sistemi (Track & Trace) projesi başlatıyoruz.</p><p><strong>Sistemin işleyişi ve gereksinimler:</strong></p><ul><li><strong>Dijital Pasaport:</strong> Her ürün için üretim anında benzersiz bir NFT (Digital Twin) oluşturulmalı ve bu NFT'nin metadata'sına üretim tarihi, yeri ve materyal bilgileri işlenmelidir.</li><li><strong>QR Kod Entegrasyonu:</strong> Fiziksel ürün üzerindeki QR kod taratıldığında, blockchain üzerindeki işlem geçmişini (History) sorgulayan ve ürünün orijinalliğini doğrulayan bir web arayüzü sunulmalıdır.</li><li><strong>Yetki Yönetimi:</strong> Sadece yetkili üreticilerin ve lojistik firmalarının sisteme yeni kayıt (Check-in) ekleyebileceği, son kullanıcının ise sadece okuma yapabileceği bir yapı kurulmalıdır.</li><li><strong>Veri Gizliliği:</strong> Ticari sırlar içeren hassas veriler (fiyat, maliyet vb.) blockchain'e açık şekilde yazılmamalı, sadece hash'leri kaydedilmeli veya özel izinli (permissioned) bir ağ düşünülmelidir.</li><li><strong>Akıllı Kontratlar:</strong> Ürün el değiştirdiğinde (Ownership Transfer), dijital sahipliğin de otomatik olarak yeni sahibinin cüzdanına aktarılmasını sağlayan fonksiyonlar yazılmalıdır.</li></ul><p>Bu proje prestijimiz için çok önemlidir; sahte ürünlerin önüne geçecek %100 güvenilir bir altyapı bekliyoruz.</p>",
    "budget": 8800,
    "deadline": "2025-05-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "DAO Yönetim Platformu ve Governance Sistemi",
    "description": "<p>Yeni kurulan yatırım topluluğumuzun kararlarını merkeziyetsiz bir şekilde alabilmesi için, tam teşekküllü bir DAO (Decentralized Autonomous Organization) altyapısı kurmak istiyoruz. Topluluk üyeleri, ellerindeki token miktarı kadar söz sahibi olmalıdır.</p><p><strong>DAO altyapısının bileşenleri:</strong></p><ul><li><strong>Governance Token:</strong> Oy hakkını temsil eden, 'Checkpointing' özelliğine sahip (oylama sırasında transferi engellemeyen ama snapshot alan) bir ERC-20 token oluşturulmalıdır.</li><li><strong>Teklif (Proposal) Sistemi:</strong> Üyelerin belirli bir eşiği geçtikten sonra zincir üzerinde (On-chain) teklif oluşturabileceği ve bu tekliflerin belirli bir süre oylamaya açık kalacağı kontratlar yazılmalıdır.</li><li><strong>Hazine (Treasury) Yönetimi:</strong> Oylama sonucu 'Kabul' edilen tekliflerin, DAO hazinesindeki fonları (ETH veya Stablecoin) otomatik olarak belirtilen adrese transfer edebilmesi için 'Governor' kontratı yetkilendirilmelidir.</li><li><strong>Oylama Stratejileri:</strong> Basit çoğunluk (Simple Majority) veya yeter sayı (Quorum) gibi kurallar parametrik olarak ayarlanabilmelidir.</li><li><strong>Arayüz Entegrasyonu:</strong> Tally veya Snapshot.org gibi platformlarla uyumlu çalışacak standartlarda (ERC-20Votes, GovernorBravo) kodlama yapılmalıdır.</li></ul><p>Sistemin güvenliği için 'Timelock' mekanizması eklenmeli, kabul edilen kararların uygulanmadan önce belirli bir süre beklemesi sağlanmalıdır.</p>",
    "budget": 7500,
    "deadline": "2025-05-08T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Cross-Chain Bridge ve Token Transfer Sistemi",
    "description": "<p>Kullanıcılarımızın tokenlarını Ethereum ana ağından (Layer 1) daha ucuz işlem ücreti sunan Arbitrum veya Optimism ağlarına (Layer 2) taşıyabilmeleri için güvenli bir köprü (Bridge) yazılımına ihtiyacımız var.</p><p><strong>Köprü mimarisinin detayları:</strong></p><ul><li><strong>Lock & Mint Mekanizması:</strong> Kaynak zincirde varlıkların kilitlendiği (Lock), hedef zincirde ise eşdeğer tokenın basıldığı (Mint) standart köprü mantığı uygulanmalıdır.</li><li><strong>Relayer Servisi:</strong> Zincirler arası mesajları dinleyen ve transfer emirlerini hedef zincire taşıyan, Node.js veya Go ile yazılmış güvenli bir 'Relayer' backend servisi kurulmalıdır.</li><li><strong>Güvenlik Odaklılık:</strong> Köprüler hacklenmeye çok müsaittir; bu yüzden çekim işlemleri için çoklu imza (Multi-Sig) onayı veya 'Validator' node'larının onayı gerekmelidir.</li><li><strong>Likidite Havuzları:</strong> Eğer 'Burn & Mint' yerine havuz tabanlı bir köprü yapılacaksa, her iki zincirde likidite sağlayıcıları (LP) ödüllendiren bir yapı kurgulanmalıdır.</li><li><strong>Ücret Yönetimi:</strong> Kullanıcılardan işlem sırasında gas masraflarını karşılayacak kadar komisyon kesilmeli ve Relayer cüzdanına aktarılmalıdır.</li></ul><p>Proje yüksek risk içerdiği için, daha önce köprü mimarisi üzerine çalışmış deneyimli geliştiriciler tercih edilecektir.</p>",
    "budget": 9600,
    "deadline": "2025-05-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Blockchain Tabanlı Kimlik Doğrulama Sistemi",
    "description": "<p>Eğitim sertifikaları ve mesleki yeterlilik belgelerinin sahteciliğini önlemek amacıyla, 'Verifiable Credentials' (Doğrulanabilir Kimlik) standartlarına uygun bir blockchain kayıt sistemi tasarlıyoruz.</p><p><strong>Proje kapsamı:</strong></p><ul><li><strong>SBT (Soulbound Tokens):</strong> Sertifikaların kişiye özel olması ve başkasına devredilememesi için, transfer özelliği kapatılmış (Non-Transferable) ERC-721 veya ERC-1155 tokenları kullanılmalıdır.</li><li><strong>İhraççı (Issuer) Paneli:</strong> Sadece yetkili kurumların (üniversiteler, kurs merkezleri) sisteme erişip sertifika basabileceği (Mint) bir yönetim arayüzü ve akıllı kontrat yetkilendirmesi yapılmalıdır.</li><li><strong>Doğrulama (Verifier):</strong> İşverenlerin, adayın sunduğu sertifikanın geçerliliğini ve iptal edilip edilmediğini (Revocation) tek tıkla kontrol edebileceği bir web sayfası hazırlanmalıdır.</li><li><strong>Gizlilik:</strong> Kişisel veriler (TCKN, Ad Soyad) açık şekilde zincire yazılmamalı, bu verilerin hash'i alınarak bütünlük kontrolü sağlanmalıdır (Zero-Knowledge Proofs tercih sebebidir).</li><li><strong>Kalıcılık:</strong> Sertifika görselleri ve PDF dosyaları IPFS veya Arweave gibi merkeziyetsiz depolama ağlarında saklanarak verinin kaybolmaması garanti edilmelidir.</li></ul><p>Sistemin Polygon ağı üzerinde çalışması planlanmaktadır, gaz ücretlerinin kurum tarafından karşılandığı (Gasless transaction/Meta-transaction) bir yapı kurgulanmalıdır.</p>",
    "budget": 6800,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Yield Farming ve Liquidity Mining Protokolü",
    "description": "<p>Kullanıcıları platformumuza likidite sağlamaya teşvik etmek için, Uniswap veya PancakeSwap LP (Liquidity Provider) tokenlarını stake edenlere kendi tokenımızı dağıtacağımız bir 'Yield Farming' kontratı yazdırmak istiyoruz.</p><p><strong>Teknik gereksinimler:</strong></p><ul><li><strong>MasterChef Mantığı:</strong> SushiSwap'ın MasterChef kontratına benzer; saniye başına veya blok başına ödül hesaplayan, birden fazla havuzu (Pool) destekleyen, kendini kanıtlamış bir algoritma kullanılmalıdır.</li><li><strong>Dinamik APY:</strong> Havuzlara ayrılan ödül katsayılarının (Allocation Points) admin tarafından değiştirilebildiği, böylece dönemsel kampanyalar yapabileceğimiz esnek bir yapı olmalıdır.</li><li><strong>Hasat (Harvest) ve Kilit:</strong> Kazanılan ödüllerin anında çekilebilmesi yerine, belirli bir kısmının (örn: %70) vesting sürecine sokulduğu ve zamanla açıldığı bir mekanizma eklenmelidir.</li><li><strong>Geri Alım (Buyback):</strong> Protokol gelirlerinin belirli bir kısmıyla piyasadan token geri alıp yakan veya hazineye aktaran fonksiyonlar entegre edilmelidir.</li><li><strong>Frontend Uyumu:</strong> Kullanıcının 'Approve', 'Stake', 'Unstake' ve 'Claim' işlemlerini kolayca yapabileceği React bileşenleri için gerekli ABI ve entegrasyon dokümanları hazırlanmalıdır.</li></ul><p>Kontratların deploy edilmeden önce Slither ve MythX gibi araçlarla güvenlik taramasından geçirilmesi zorunludur.</p>",
    "budget": 8900,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Blockchain Tabanlı Oylama ve Seçim Sistemi",
    "description": "<p>Apartman yönetimlerinden dernek seçimlerine kadar kullanılabilecek, sonuçların manipüle edilemediği, şeffaf ve basit bir oylama (e-voting) dApp'i geliştirmek istiyoruz.</p><p><strong>Uygulama özellikleri:</strong></p><ul><li><strong>Seçmen Kaydı:</strong> Seçimi düzenleyen yöneticinin (Admin), oy kullanacak cüzdan adreslerini bir 'Whitelist'e ekleyerek yetkilendirdiği kapalı devre bir sistem olmalıdır.</li><li><strong>Oylama Süreci:</strong> Oylama başladığında kullanıcılar 'Evet', 'Hayır' veya aday isimlerine oylarını göndermeli; mükerrer oy kullanımı (Double Voting) akıllı kontrat seviyesinde engellenmelidir.</li><li><strong>Sonuçların Şeffaflığı:</strong> Oylama süresi bittiğinde, sonuçlar herkes tarafından zincir üzerinde görülebilmeli ve sayım işlemi otomatik yapılmalıdır.</li><li><strong>Gizlilik Seçeneği:</strong> İsteğe bağlı olarak, kimin kime oy verdiğinin gizlendiği (Commit-Reveal şeması) bir oylama modu da sisteme dahil edilmelidir.</li><li><strong>Kullanıcı Arayüzü:</strong> Kripto bilgisi olmayan kullanıcıların da rahatça oy kullanabilmesi için çok sade, mobil uyumlu bir arayüz tasarlanmalıdır.</li></ul><p>Bu proje Ethereum test ağlarında geliştirilecek olup, karmaşık finansal fonksiyonlar içermediği için temiz ve optimize bir Solidity kodu bekliyoruz.</p>",
    "budget": 4500,
    "deadline": "2025-05-03T00:00:00.000Z",
    "status": "open"
  }
]