[
  {
    "title": "Machine Learning Model Geliştirme",
    "description": "E-ticaret platformu için müşteri davranışı tahmin modeli. Satın alma olasılığını tahmin ederek pazarlama kampanyalarını optimize edecek. Python, Scikit-learn veya TensorFlow.\n\nVeri hazırlama: Preprocessing ile ham verilerin temizlenmesi ve hazırlanması. Feature engineering.\n\nModel geliştirme: Farklı algoritmalar test edilecek (Random Forest, XGBoost, Neural Networks). Model evaluation: accuracy, precision, recall, F1-score. Cross-validation.\n\nDeployment: Production ortamına deploy. API endpoint. Model monitoring.\n\nDokümantasyon: Model açıklaması, kullanım kılavuzu. Model versioning.",
    "budget": 65000,
    "deadline": "2025-04-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Veri Analizi ve Raporlama Dashboard",
    "description": "Perakende sektörü için iş kararlarını destekleyecek veri analizi ve raporlama dashboard'u. Python/Pandas analiz, Power BI veya Tableau görselleştirme.\n\nVeri işleme: Data cleaning, data transformation.\n\nGörselleştirme: Grafikler, tablolar, heatmaps. Interactive reports: filtreleme, drill-down. Scheduled reports.\n\nİçgörüler: Otomatik içgörü üretimi. Trend analysis.\n\nVeri pipeline: Otomatik veri çekme. ETL processes.",
    "budget": 50000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Predictive Analytics Sistemi",
    "description": "Üretim şirketi için talep tahmini, stok optimizasyonu ve bakım planlaması odaklı tahmine dayalı analiz sistemi.\n\nZaman serisi: Geçmiş veriler analizi. Forecasting models (ARIMA, Prophet, LSTM).\n\nDeployment: Production ortamına alım. API entegrasyonu. Gerçek zamanlı tahminler. Confidence intervals.\n\nModel yönetimi: Düzenli retraining. Performance monitoring.\n\nTeknoloji: Python, ML libraries (scikit-learn, statsmodels, Prophet). Dashboard. Alerting system.",
    "budget": 70000,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Natural Language Processing (NLP) Projesi",
    "description": "Müşteri hizmetleri için NLP tabanlı chatbot ve sentiment analysis. Müşteri mesajlarını anlayıp uygun yanıtlar üretecek sistem.\n\nNLP özellikleri: Text classification. Sentiment analysis. Named entity recognition. Conversational AI.\n\nTeknoloji: NLTK, spaCy veya transformers (BERT, GPT). Labeled dataset. API integration. Gerçek zamanlı işleme.\n\nDeğerlendirme: Accuracy, F1-score metrikleri. Continuous learning. Multilingual support.",
    "budget": 75000,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Computer Vision Uygulaması",
    "description": "Güvenlik ve kalite kontrolü için görüntü analizi ve anomali tespiti. OpenCV, TensorFlow veya PyTorch.\n\nGörüntü işleme: Object detection. Image classification. OCR. Quality inspection.\n\nModel geliştirme: Deep learning models. Labeled dataset. Data augmentation. Model optimization.\n\nDeployment: Gerçek zamanlı işleme. API endpoint.",
    "budget": 80000,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Data Pipeline ve ETL",
    "description": "Çoklu veri kaynaklarından günlük milyonlarca kaydı işleyebilen ETL pipeline. Python ve SQL.\n\nETL süreci: Data extraction (databases, APIs, files). Data transformation. Data loading. Error handling.\n\nOtomasyon: Scheduling (Airflow, Prefect). Monitoring.\n\nOptimizasyon: Incremental loading. Data quality checks. Performance optimization.\n\nDokümantasyon ve alerting.",
    "budget": 55000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Recommendation System",
    "description": "E-ticaret platformu için kişiselleştirilmiş ürün önerileri. Collaborative filtering, content-based filtering, hybrid approach.\n\nAlgoritma: Matrix factorization. Python, ML libraries (scikit-learn, Surprise). User-item interaction data.\n\nDeployment: Gerçek zamanlı öneriler. API endpoint.\n\nDeğerlendirme: Precision, recall, NDCG metrikleri. A/B testing. Cold start problem çözümü.",
    "budget": 70000,
    "deadline": "2025-04-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Data Warehouse Tasarımı",
    "description": "Kurumsal şirket için farklı kaynaklardan gelen verileri birleştiren data warehouse. Star/snowflake schema.\n\nVeri modeli: Fact tables, dimension tables. ETL processes. Optimal veri yapısı.\n\nRaporlama: Business intelligence raporları. OLAP cubes.\n\nAltyapı: SQL Server veya PostgreSQL. Index optimization.\n\nYönetim: Data quality management. Dokümantasyon. Maintenance plan.",
    "budget": 60000,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Time Series Forecasting",
    "description": "Finansal hizmetler şirketi için finansal göstergeleri tahmin eden zaman serisi modeli. ARIMA, Prophet veya LSTM.\n\nAnaliz: Time series decomposition (trend, seasonality). Data preprocessing. Feature engineering.\n\nDeğerlendirme: MAPE, RMSE metrikleri. Cross-validation.\n\nDeployment: Production ortamı. Gerçek zamanlı tahmin. Python. Visualization. Confidence intervals. Model retraining.",
    "budget": 65000,
    "deadline": "2025-04-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Data Visualization ve Dashboard",
    "description": "İş zekası ekibi için karmaşık verileri anlaşılır şekilde sunan interaktif görselleştirme dashboard'u. Python (Plotly/Dash) veya JavaScript (D3.js).\n\nGörselleştirme: Interactive visualizations. Gerçek zamanlı veri güncellemeleri (WebSocket/polling). Custom charts.\n\nAnaliz: Filtreleme, drill-down. Export features.\n\nPerformans: Büyük veri setleri için optimizasyon. User authentication.",
    "budget": 45000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  }
]
