[
  {
    "title": "CI/CD Pipeline Kurulumu",
    "description": "Yazılım geliştirme sürecini otomatikleştirmek için CI/CD pipeline kurulması gerekiyor. Pipeline, kod değişikliklerini otomatik olarak test edip deploy etmeli.\n\nGitHub Actions veya GitLab CI kullanılacak. Automated testing ile unit testler, integration testler otomatik çalıştırılacak. Test coverage raporları oluşturulacak.\n\nBuild process ile uygulama otomatik build edilecek. Docker containerization ile uygulamalar containerize edilecek. Image registry'ye (Docker Hub, AWS ECR) push yapılacak.\n\nDeployment automation ile staging ve production ortamlarına otomatik deploy yapılacak. Blue-green deployment veya rolling deployment stratejisi uygulanacak.\n\nStaging ve production environments ayrı olacak. Environment variables yönetimi yapılacak. Secrets management (AWS Secrets Manager, HashiCorp Vault) ile güvenli bilgi yönetimi yapılacak.\n\nNotification system ile build/deploy durumu bildirimleri gönderilecek. Monitoring ile pipeline performansı takip edilecek.",
    "budget": 40000,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Docker ve Kubernetes Deployment",
    "description": "Mevcut uygulamayı containerize edip Kubernetes cluster'a deploy edilmesi gerekiyor. Sistem, yüksek kullanılabilirlik ve ölçeklenebilirlik sağlamalı.\n\nDocker containerization ile uygulama containerize edilecek. Multi-stage builds ile optimize edilmiş image'ler oluşturulacak. Dockerfile best practices uygulanacak.\n\nKubernetes cluster kurulumu yapılacak (EKS, GKE, AKS veya self-hosted). Deployment, Service, Ingress resource'ları oluşturulacak.\n\nHelm charts ile deployment yönetimi yapılacak. Service mesh (Istio, Linkerd) ile microservices communication yönetilecek.\n\nMonitoring (Prometheus, Grafana) ile cluster ve application metrics toplanacak. Logging (ELK stack) ile log aggregation yapılacak.\n\nScaling configuration ile horizontal pod autoscaling yapılacak. Health checks ve liveness/readiness probes yapılandırılacak. Backup ve disaster recovery planı oluşturulacak.",
    "budget": 55000,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "AWS Infrastructure Setup",
    "description": "AWS cloud üzerinde production-ready infrastructure kurulması gerekiyor. Infrastructure, yüksek kullanılabilirlik, güvenlik ve ölçeklenebilirlik sağlamalı.\n\nEC2 instances ile compute resources oluşturulacak. Auto Scaling Groups ile otomatik ölçeklendirme yapılacak. Load Balancer (ALB/NLB) ile trafik dağıtılacak.\n\nRDS (PostgreSQL/MySQL) ile managed database kurulacak. Multi-AZ deployment ile yüksek kullanılabilirlik sağlanacak. Automated backups yapılandırılacak.\n\nS3 ile object storage kurulacak. CloudFront CDN ile global content delivery yapılacak. Route 53 ile DNS yönetimi yapılacak.\n\nSecurity Groups ve Network ACLs ile network security yapılandırılacak. IAM roles ve policies ile access control yapılacak.\n\nCloudWatch ile monitoring ve alerting yapılacak. CloudTrail ile audit logging yapılacak. Cost optimization ile maliyet optimizasyonu yapılacak.",
    "budget": 50000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Azure DevOps Migration",
    "description": "Mevcut projenin Azure DevOps platformuna taşınması gerekiyor. Migration, minimum downtime ile yapılmalı ve tüm süreçler korunmalı.\n\nRepo migration ile source code Azure Repos'a taşınacak. Git history korunacak. Branch strategy ve tag'ler korunacak.\n\nPipeline setup ile CI/CD pipelines Azure Pipelines'a taşınacak. Build ve release definitions oluşturulacak. Artifact management ile build artifacts yönetilecek.\n\nTest automation ile test süreçleri otomatikleştirilecek. Test results ve coverage raporları görüntülenecek.\n\nDeployment strategies ile deployment süreçleri yapılandırılacak. Environment management ile staging, production ortamları yönetilecek.\n\nWork items migration ile issue tracking Azure Boards'a taşınacak. Wiki migration ile dokümantasyon taşınacak. Integration testing ile migration doğrulanacak.",
    "budget": 45000,
    "deadline": "2025-03-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Monitoring ve Logging Sistemi",
    "description": "Uygulama ve infrastructure için kapsamlı monitoring ve logging sistemi kurulması gerekiyor. Sistem, proaktif sorun tespiti ve hızlı troubleshooting sağlamalı.\n\nPrometheus ile metrics collection yapılacak. Custom metrics ile application-specific metrics toplanacak. Service discovery ile otomatik target discovery yapılacak.\n\nGrafana ile visualization dashboards oluşturulacak. Custom dashboards ile application ve infrastructure metrics görüntülenecek. Alerting rules ile threshold-based alerting yapılacak.\n\nELK stack (Elasticsearch, Logstash, Kibana) ile log aggregation yapılacak. Centralized logging ile tüm loglar merkezi toplanacak. Log parsing ile structured logging yapılacak.\n\nAlerting system ile kritik durumlar için bildirimler gönderilecek (email, Slack, PagerDuty). Dashboard creation ile operasyonel dashboards oluşturulacak.\n\nIntegration ile monitoring ve logging sistemleri entegre edilecek. Retention policies ile log ve metric retention yönetilecek. Performance optimization ile sistem performansı optimize edilecek.",
    "budget": 48000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Serverless Architecture (AWS Lambda)",
    "description": "Mevcut uygulamayı serverless architecture'ya dönüştürülmesi gerekiyor. Sistem, maliyet optimizasyonu ve otomatik ölçeklendirme sağlamalı.\n\nAWS Lambda functions ile serverless compute yapılacak. Function design ile optimal function structure oluşturulacak. Cold start optimization ile performans iyileştirilecek.\n\nAPI Gateway ile RESTful API oluşturulacak. Request/response transformation yapılacak. Rate limiting ve throttling yapılandırılacak.\n\nDynamoDB ile serverless database kullanılacak. Table design ile optimal data model oluşturulacak. Global secondary indexes ile query optimization yapılacak.\n\nS3 ile object storage kullanılacak. Event-driven architecture ile Lambda functions trigger edilecek. Step Functions ile workflow orchestration yapılacak.\n\nCost optimization ile maliyet optimizasyonu yapılacak. Monitoring (CloudWatch) ile function performance takip edilecek. Error handling ve retry mechanisms yapılandırılacak.",
    "budget": 60000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Database Backup ve Disaster Recovery",
    "description": "Kritik veritabanları için otomatik backup ve disaster recovery sistemi kurulması gerekiyor. Sistem, veri kaybını önlemeli ve hızlı recovery sağlamalı.\n\nScheduled backups ile otomatik yedekleme yapılacak. Full backups ve incremental backups stratejisi uygulanacak. Backup retention policies ile yedek saklama süreleri yönetilecek.\n\nDisaster recovery plan ile recovery procedures dokümante edilecek. RTO (Recovery Time Objective) ve RPO (Recovery Point Objective) hedefleri belirlenecek.\n\nBackup testing ile düzenli restore testleri yapılacak. Backup verification ile yedeklerin bütünlüğü doğrulanacak.\n\nRestore procedures ile hızlı veri geri yükleme yapılabilmeli. Point-in-time recovery ile belirli bir zamana geri dönüş yapılabilmeli.\n\nPostgreSQL veya MySQL kullanılacak. Cloud storage (S3, Azure Blob) ile yedekler saklanacak. Monitoring ile backup durumu takip edilecek. Alerting ile backup hataları bildirilecek.",
    "budget": 35000,
    "deadline": "2025-03-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Infrastructure as Code (Terraform)",
    "description": "Cloud infrastructure'ı Infrastructure as Code yaklaşımı ile yönetilmesi gerekiyor. Sistem, version control, repeatability ve collaboration sağlamalı.\n\nTerraform ile infrastructure provisioning yapılacak. AWS/Azure resources (EC2, RDS, S3, VPC vb.) Terraform ile oluşturulacak.\n\nModules ile reusable infrastructure components oluşturulacak. Module structure ile best practices uygulanacak.\n\nState management ile Terraform state yönetilecek. Remote state (S3, Azure Storage) ile state paylaşımı yapılacak. State locking ile concurrent access önlenecek.\n\nBest practices ile naming conventions, resource tagging, security groups yapılandırılacak. Documentation ile infrastructure dokümante edilecek.\n\nCI/CD integration ile infrastructure changes otomatik apply edilecek. Plan review ile değişiklikler onaylanacak. Cost estimation ile maliyet tahmini yapılacak.",
    "budget": 52000,
    "deadline": "2025-04-01T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Load Balancing ve Auto Scaling",
    "description": "Yüksek trafikli uygulama için load balancing ve auto scaling yapılandırması yapılması gerekiyor. Sistem, trafik artışlarını otomatik karşılamalı.\n\nLoad balancer kurulumu yapılacak (AWS ALB, NLB, Azure Load Balancer). Health checks ile sağlıklı instance'lar tespit edilecek. SSL/TLS termination ile güvenli bağlantı sağlanacak.\n\nAuto Scaling Groups ile otomatik ölçeklendirme yapılacak. Scaling policies ile CPU, memory, request count bazlı scaling yapılacak.\n\nMonitoring ile load balancer ve instance metrics toplanacak. Alerting ile scaling events bildirilecek.\n\nOptimization ile cost ve performance dengesi sağlanacak. Predictive scaling ile trafik tahminine göre önceden scaling yapılabilir.\n\nHigh availability ile multi-AZ deployment yapılacak. Session affinity ile sticky sessions yapılandırılacak. Health check optimization ile optimal health check intervals belirlenecek.",
    "budget": 45000,
    "deadline": "2025-03-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Security Hardening ve Compliance",
    "description": "Production sunucuları için security hardening ve compliance yapılandırması yapılması gerekiyor. Sistem, güvenlik standartlarına uygun olmalı.\n\nFirewall configuration ile network security yapılandırılacak. UFW, iptables veya cloud security groups kullanılacak. Port restrictions ile gereksiz portlar kapatılacak.\n\nSSL/TLS setup ile güvenli bağlantı sağlanacak. Let's Encrypt veya commercial certificates kullanılacak. Certificate auto-renewal yapılandırılacak.\n\nSecurity scanning ile vulnerability assessment yapılacak. OWASP Top 10 kontrolleri yapılacak. Penetration testing ile güvenlik testleri yapılabilir.\n\nVulnerability assessment ile düzenli güvenlik taramaları yapılacak. Patch management ile güvenlik güncellemeleri yönetilecek.\n\nCompliance documentation ile GDPR, KVKK, PCI-DSS uyumluluk dokümantasyonu hazırlanacak. Audit logging ile tüm işlemler kaydedilecek. Access control ile least privilege principle uygulanacak.",
    "budget": 40000,
    "deadline": "2025-03-12T00:00:00.000Z",
    "status": "open"
  }
]
