[
  {
    "title": "Kubernetes Container Orchestration Altyapısı",
    "description": "Mikroservis mimarisini destekleyen ölçeklenebilir Kubernetes cluster kurulumu ve yönetimi yapıyoruz. Cluster yapılandırması, yüksek kullanılabilirlik için multi-node setup içeriyor. Service mesh implementasyonu, servisler arası iletişimin güvenli ve yönetilebilir olmasını sağlıyor. Auto-scaling, yük artışlarına otomatik yanıt verme mekanizması içeriyor. Load balancing, trafiğin pod'lar arasında dengeli dağıtılmasını destekliyor. Secret management, hassas bilgilerin güvenli saklanması ve yönetilmesini sağlıyor. Monitoring ve logging, Prometheus ve Grafana entegrasyonu ile sistem metriklerinin izlenmesine izin veriyor. CI/CD pipeline, container image'lerinin otomatik build ve deployment süreçlerini içeriyor. Backup ve disaster recovery, cluster durumunun düzenli yedeklenmesi ve kurtarma planları sunuyor. Network policies, pod'lar arası ağ trafiğinin kontrol edilmesini destekliyor. Resource management, CPU ve memory kaynaklarının verimli kullanılmasını sağlıyor.",
    "budget": 105000,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "CI/CD Pipeline ve Otomasyon Sistemi",
    "description": "Yazılım geliştirme süreçlerini otomatikleştiren kapsamlı bir CI/CD pipeline kuruyoruz. Source control entegrasyonu, Git repository'lerinden otomatik trigger mekanizması içeriyor. Build automation, kod derleme ve test süreçlerinin otomatik çalıştırılmasını sağlıyor. Test automation, unit, integration ve e2e testlerin pipeline içinde çalıştırılmasını destekliyor. Code quality checks, static code analysis ve linting araçlarının entegrasyonunu içeriyor. Artifact management, build çıktılarının versiyonlanması ve saklanmasına izin veriyor. Deployment automation, staging ve production ortamlarına otomatik deployment sunuyor. Rollback mekanizması, başarısız deployment'ların hızlı geri alınmasını destekliyor. Notification system, build ve deployment durumlarının ekip üyelerine iletilmesini sağlıyor. Environment management, farklı ortamların yapılandırma ve yönetimini içeriyor. Security scanning, güvenlik açıklarının tespit edilmesi ve raporlanmasını destekliyor.",
    "budget": 88000,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Bulut Altyapı ve Infrastructure as Code",
    "description": "AWS, Azure veya GCP üzerinde Terraform veya CloudFormation ile altyapı kodlaması yapıyoruz. VPC yapılandırması, güvenli ağ mimarisi ve subnet organizasyonu içeriyor. Compute resources, EC2, Lambda veya container servislerinin otomatik provisioning'ini sağlıyor. Storage yönetimi, S3, EBS veya benzeri depolama çözümlerinin yapılandırılmasını destekliyor. Database setup, RDS veya managed database servislerinin kurulumu ve yapılandırmasını içeriyor. Load balancer, application ve network load balancer'ların yapılandırılmasına izin veriyor. Auto-scaling groups, trafik artışlarına otomatik yanıt verme mekanizması sunuyor. Security groups, firewall kuralları ve network access control yapılandırması içeriyor. Monitoring setup, CloudWatch veya benzeri monitoring araçlarının entegrasyonunu sağlıyor. Backup strategy, düzenli yedekleme ve snapshot yönetimi içeriyor. Cost optimization, kaynak kullanımının optimize edilmesi ve maliyet takibi sunuyor.",
    "budget": 95000,
    "deadline": "2025-04-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Monitoring ve Observability Platformu",
    "description": "Uygulama ve altyapı performansının kapsamlı izlenmesi için monitoring çözümü kuruyoruz. Metrics collection, sistem ve uygulama metriklerinin toplanması ve saklanmasını sağlıyor. Log aggregation, merkezi log toplama ve analiz sistemi içeriyor. Distributed tracing, mikroservis çağrılarının izlenmesi ve analiz edilmesini destekliyor. Alerting system, kritik durumlar için otomatik uyarı mekanizması sunuyor. Dashboard creation, özelleştirilebilir görselleştirme ve metrik sunumu içeriyor. APM integration, application performance monitoring araçlarının entegrasyonunu sağlıyor. Infrastructure monitoring, sunucu, network ve database performansının izlenmesine izin veriyor. User experience monitoring, gerçek kullanıcı deneyiminin ölçülmesi ve analiz edilmesini destekliyor. Capacity planning, kaynak kullanım trendlerinin analizi ve planlama araçları içeriyor. Reporting, düzenli performans raporları ve trend analizleri sunuyor.",
    "budget": 78000,
    "deadline": "2025-04-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Güvenlik ve Compliance Otomasyonu",
    "description": "Güvenlik politikalarının otomatik uygulanması ve compliance gereksinimlerinin karşılanması için sistem kuruyoruz. Vulnerability scanning, otomatik güvenlik açığı taraması ve raporlama içeriyor. Security policy enforcement, güvenlik kurallarının otomatik uygulanmasını sağlıyor. Access control, IAM yapılandırması ve yetkilendirme yönetimini destekliyor. Encryption management, veri şifreleme ve key management sistemleri içeriyor. Compliance checking, GDPR, HIPAA veya PCI-DSS gibi standartlara uyum kontrolü sunuyor. Security audit logging, güvenlik olaylarının kaydedilmesi ve analiz edilmesine izin veriyor. Incident response, güvenlik olaylarına otomatik yanıt mekanizması sunuyor. Penetration testing, düzenli güvenlik testlerinin otomatikleştirilmesini destekliyor. Security training, güvenlik farkındalığı ve eğitim materyalleri içeriyor. Risk assessment, güvenlik risklerinin değerlendirilmesi ve raporlanmasını sağlıyor.",
    "budget": 92000,
    "deadline": "2025-04-28T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Container Registry ve Image Yönetimi",
    "description": "Docker container image'lerinin güvenli saklanması ve yönetilmesi için registry çözümü kuruyoruz. Private registry setup, kurumsal container image'lerinin güvenli saklanmasını sağlıyor. Image scanning, güvenlik açıklarının tespit edilmesi ve raporlanmasını destekliyor. Version management, image versiyonlarının yönetilmesi ve tag stratejilerinin uygulanmasını içeriyor. Access control, registry erişiminin kontrol edilmesi ve yetkilendirme yönetimini sağlıyor. Image replication, farklı bölgelerde image'lerin replike edilmesine izin veriyor. Build integration, CI/CD pipeline'larından otomatik image push işlemlerini destekliyor. Retention policies, eski image'lerin otomatik temizlenmesi ve depolama optimizasyonu içeriyor. Vulnerability management, güvenlik açıklarının takip edilmesi ve düzeltilmesini sağlıyor. Performance optimization, image pull hızlarının optimize edilmesi ve CDN entegrasyonu sunuyor. Documentation, image kullanım kılavuzları ve best practice dokümantasyonu içeriyor.",
    "budget": 65000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Database Yönetim ve Backup Stratejisi",
    "description": "Veritabanı operasyonlarının otomatikleştirilmesi ve güvenilir yedekleme çözümü kuruyoruz. Database provisioning, otomatik veritabanı oluşturma ve yapılandırma içeriyor. Backup automation, düzenli yedekleme ve snapshot yönetimi sunuyor. Point-in-time recovery, belirli bir zaman noktasına geri dönüş özelliği sağlıyor. Replication setup, master-slave veya multi-master replikasyon yapılandırması içeriyor. Performance monitoring, veritabanı performans metriklerinin izlenmesi ve optimizasyon önerileri sunuyor. Query optimization, yavaş sorguların tespit edilmesi ve optimize edilmesini destekliyor. Capacity planning, veritabanı büyüme trendlerinin analizi ve planlama araçları içeriyor. Security hardening, veritabanı güvenlik yapılandırması ve erişim kontrolü sağlıyor. Disaster recovery, felaket senaryoları için kurtarma planları ve test süreçleri içeriyor. Documentation, veritabanı şemaları ve operasyonel prosedürlerin dokümante edilmesini destekliyor.",
    "budget": 85000,
    "deadline": "2025-04-22T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Serverless Architecture ve Function Deployment",
    "description": "Serverless computing mimarisinin kurulması ve function deployment süreçlerinin otomatikleştirilmesi yapıyoruz. Function deployment, Lambda, Azure Functions veya Cloud Functions için otomatik deployment pipeline içeriyor. API Gateway yapılandırması, serverless function'ların HTTP endpoint'lerine bağlanmasını sağlıyor. Event triggers, çeşitli event kaynaklarından function tetikleme mekanizması sunuyor. Cold start optimization, function başlatma sürelerinin minimize edilmesini destekliyor. Monitoring ve logging, serverless function'ların performans ve hata izlemesini içeriyor. Cost optimization, function kullanımının optimize edilmesi ve maliyet takibi sağlıyor. Security configuration, IAM roles ve güvenlik ayarlarının yapılandırılmasına izin veriyor. Version management, function versiyonlarının yönetilmesi ve canary deployment stratejileri içeriyor. Error handling, hata yönetimi ve retry mekanizmalarının yapılandırılmasını destekliyor. Testing strategy, serverless function'ların test edilmesi ve local development ortamı sunuyor.",
    "budget": 72000,
    "deadline": "2025-04-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Network Güvenliği ve Firewall Yönetimi",
    "description": "Ağ güvenliği ve firewall kurallarının merkezi yönetimi için sistem kuruyoruz. Firewall configuration, güvenlik duvarı kurallarının yapılandırılması ve yönetilmesini sağlıyor. Network segmentation, ağ trafiğinin izole edilmesi ve güvenli bölgelerin oluşturulmasını destekliyor. Intrusion detection, şüpheli ağ aktivitelerinin tespit edilmesi ve uyarı verilmesini içeriyor. VPN setup, güvenli uzaktan erişim çözümlerinin yapılandırılmasına izin veriyor. DDoS protection, dağıtık hizmet reddi saldırılarına karşı koruma mekanizması sunuyor. Traffic analysis, ağ trafiğinin analiz edilmesi ve raporlanmasını destekliyor. Access control lists, detaylı erişim kontrol kurallarının yönetilmesini sağlıyor. Network monitoring, ağ performansının izlenmesi ve sorun tespiti içeriyor. Compliance, ağ güvenliği standartlarına uyum kontrolü ve raporlama sağlıyor.",
    "budget": 68000,
    "deadline": "2025-04-08T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Configuration Management ve Infrastructure Automation",
    "description": "Sunucu yapılandırmalarının otomatik yönetimi ve tutarlılığın sağlanması için Ansible, Puppet veya Chef kuruyoruz. Configuration templates, standart sunucu yapılandırma şablonlarının oluşturulmasını sağlıyor. Automated provisioning, yeni sunucuların otomatik yapılandırılmasını destekliyor. Configuration drift detection, yapılandırma değişikliklerinin tespit edilmesi ve raporlanmasını içeriyor. Role-based configuration, farklı sunucu rollerine göre özelleştirilmiş yapılandırmalar sunuyor. Secret management, hassas bilgilerin güvenli yönetilmesi ve dağıtılmasına izin veriyor. Compliance enforcement, güvenlik ve uyumluluk politikalarının otomatik uygulanmasını sağlıyor. Inventory management, sunucu envanterinin yönetilmesi ve güncel tutulmasını destekliyor. Reporting, yapılandırma durumunun raporlanması ve audit trail içeriyor. Integration, monitoring ve logging sistemleri ile entegrasyon sunuyor.",
    "budget": 75000,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  }
]
