[
  {
    "title": "CI/CD Pipeline Kurulumu",
    "description": "Yazılım geliştirme sürecini otomatikleştiren CI/CD pipeline. Kod değişikliklerini otomatik test edip deploy eden sistem. GitHub Actions veya GitLab CI.\n\nTest otomasyonu: Unit ve integration testler. Test coverage raporları.\n\nBuild ve containerization: Otomatik build süreci. Docker containerization. Image registry'ye push (Docker Hub, AWS ECR).\n\nDeployment: Staging ve production ortamlarına otomatik deploy. Blue-green veya rolling deployment stratejisi.\n\nYönetim: Environment variables. Secrets management (AWS Secrets Manager, HashiCorp Vault). Bildirim sistemi. Pipeline performans izleme.",
    "budget": 40000,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Docker ve Kubernetes Deployment",
    "description": "Uygulamayı containerize edip Kubernetes cluster'a deploy etme. Yüksek kullanılabilirlik ve ölçeklenebilirlik.\n\nContainerization: Multi-stage builds, optimize edilmiş image'ler. Dockerfile best practices.\n\nKubernetes: Cluster kurulumu (EKS, GKE, AKS veya self-hosted). Deployment, Service, Ingress resource'ları. Helm charts. Service mesh (Istio, Linkerd).\n\nİzleme: Prometheus, Grafana (metrikler). ELK stack (log aggregation).\n\nÖlçeklendirme: Horizontal pod autoscaling. Health checks, liveness/readiness probes. Backup ve disaster recovery planı.",
    "budget": 55000,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "AWS Infrastructure Setup",
    "description": "AWS cloud üzerinde production-ready infrastructure. Yüksek kullanılabilirlik, güvenlik ve ölçeklenebilirlik.\n\nCompute: EC2 instances. Auto Scaling Groups. Load Balancer (ALB/NLB).\n\nVeritabanı: RDS (PostgreSQL/MySQL). Multi-AZ deployment. Otomatik yedeklemeler.\n\nDepolama ve dağıtım: S3 object storage. CloudFront CDN. Route 53 DNS.\n\nGüvenlik: Security Groups, Network ACLs. IAM roles ve policies.\n\nİzleme: CloudWatch (monitoring, alerting). CloudTrail (audit logging). Maliyet optimizasyonu.",
    "budget": 50000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Azure DevOps Migration",
    "description": "Mevcut projenin Azure DevOps platformuna taşınması. Minimum downtime, tüm süreçlerin korunması.\n\nKaynak kod: Azure Repos'a taşıma. Git history, branch strategy, tag'ler korunacak.\n\nPipeline: Azure Pipelines'a taşıma. Build ve release definitions. Artifact management.\n\nTest: Test otomasyonu. Test results ve coverage raporları.\n\nDeployment: Deployment stratejileri. Environment management (staging, production).\n\nYönetim: Work items (Azure Boards). Wiki migration. Integration testing.",
    "budget": 45000,
    "deadline": "2025-03-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Monitoring ve Logging Sistemi",
    "description": "Uygulama ve infrastructure için kapsamlı monitoring ve logging. Proaktif sorun tespiti ve hızlı troubleshooting.\n\nMetrikler: Prometheus (toplama). Custom metrics. Service discovery.\n\nGörselleştirme: Grafana dashboards. Custom dashboards. Threshold-based alerting.\n\nLogging: ELK stack (Elasticsearch, Logstash, Kibana). Merkezi logging. Structured logging.\n\nBildirimler: Kritik durumlar için (e-posta, Slack, PagerDuty). Operasyonel dashboards.\n\nEntegrasyon: Monitoring ve logging entegrasyonu. Retention policies. Performans optimizasyonu.",
    "budget": 48000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Serverless Architecture (AWS Lambda)",
    "description": "Mevcut uygulamayı serverless architecture'ya dönüştürme. Maliyet optimizasyonu ve otomatik ölçeklendirme.\n\nLambda: Serverless compute. Optimal function structure. Cold start optimizasyonu.\n\nAPI: API Gateway (RESTful API). Request/response transformation. Rate limiting, throttling.\n\nVeritabanı: DynamoDB. Optimal data model. Global secondary indexes.\n\nDepolama: S3. Event-driven architecture. Step Functions (workflow orchestration).\n\nOptimizasyon: Maliyet optimizasyonu. CloudWatch monitoring. Error handling, retry mechanisms.",
    "budget": 60000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Database Backup ve Disaster Recovery",
    "description": "Kritik veritabanları için otomatik backup ve disaster recovery. Veri kaybını önleme ve hızlı recovery.\n\nYedekleme: Otomatik scheduled backups. Full ve incremental backups. Retention policies.\n\nRecovery planı: Recovery procedures dokümantasyonu. RTO ve RPO hedefleri.\n\nTest: Düzenli restore testleri. Yedek bütünlüğü doğrulama.\n\nGeri yükleme: Hızlı restore procedures. Point-in-time recovery.\n\nAltyapı: PostgreSQL veya MySQL. Cloud storage (S3, Azure Blob). Monitoring. Alerting.",
    "budget": 35000,
    "deadline": "2025-03-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Infrastructure as Code (Terraform)",
    "description": "Cloud infrastructure'ı Infrastructure as Code yaklaşımıyla yönetme. Version control, repeatability ve collaboration.\n\nProvisioning: Terraform ile AWS/Azure resources (EC2, RDS, S3, VPC).\n\nModüller: Reusable infrastructure components. Best practices.\n\nState yönetimi: Remote state (S3, Azure Storage). State locking.\n\nBest practices: Naming conventions, resource tagging, security groups. Dokümantasyon.\n\nCI/CD: Infrastructure changes otomatik apply. Plan review. Maliyet tahmini.",
    "budget": 52000,
    "deadline": "2025-04-01T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Load Balancing ve Auto Scaling",
    "description": "Yüksek trafikli uygulama için load balancing ve auto scaling. Trafik artışlarını otomatik karşılama.\n\nLoad balancer: AWS ALB, NLB, Azure Load Balancer. Health checks. SSL/TLS termination.\n\nAuto scaling: Auto Scaling Groups. CPU, memory, request count bazlı scaling.\n\nİzleme: Load balancer ve instance metrikleri. Scaling events bildirimleri.\n\nOptimizasyon: Maliyet ve performans dengesi. Predictive scaling.\n\nYüksek kullanılabilirlik: Multi-AZ deployment. Session affinity. Health check optimizasyonu.",
    "budget": 45000,
    "deadline": "2025-03-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Security Hardening ve Compliance",
    "description": "Production sunucuları için security hardening ve compliance. Güvenlik standartlarına uyum.\n\nAğ güvenliği: Firewall yapılandırması (UFW, iptables, cloud security groups). Port kısıtlamaları.\n\nSSL/TLS: Güvenli bağlantı. Let's Encrypt veya commercial certificates. Otomatik yenileme.\n\nGüvenlik taraması: Vulnerability assessment. OWASP Top 10 kontrolleri. Penetration testing.\n\nYönetim: Düzenli güvenlik taramaları. Patch management.\n\nUyumluluk: GDPR, KVKK, PCI-DSS dokümantasyonu. Audit logging. Access control (least privilege).",
    "budget": 40000,
    "deadline": "2025-03-12T00:00:00.000Z",
    "status": "open"
  }
]
