[
  {
    "title": "İnteraktif Veri Görselleştirme Dashboard",
    "description": "<p>Finans departmanımızın karmaşık veri setlerini (hisse senedi, kur, işlem hacmi) tek bir ekrandan takip edebilmesi için, React veya Vue.js tabanlı, yüksek performanslı bir dashboard geliştirmek istiyoruz. D3.js veya Recharts kütüphanelerinin gücünü kullanarak veriyi konuşturmanızı bekliyoruz.</p><p><strong>Teknik gereksinimler:</strong></p><ul><li><strong>Grafik Çeşitliliği:</strong> Mum çubukları (Candlestick), Isı haritaları (Heatmap) ve çok katmanlı Çizgi grafikler çizilmeli; kullanıcı grafik üzerinde zoom-in/zoom-out yapabilmelidir.</li><li><strong>Canlı Veri Akışı:</strong> Backend'den WebSocket üzerinden gelen anlık veriler, sayfayı yenilemeden grafiğe işlenmeli (Real-time rendering) ve performans kaybı (jank) yaşanmamalıdır.</li><li><strong>Filtreleme Mekanizması:</strong> Tarih aralığı, kategori veya tutar bazlı gelişmiş filtreleme bileşenleri yapılmalı, filtre sonuçları URL parametrelerine (Query Params) yansıtılmalıdır.</li><li><strong>Dışa Aktarım:</strong> Yöneticiler ekrandaki grafiği tek tuşla yüksek çözünürlüklü PNG veya vektörel PDF olarak indirebilmelidir.</li><li><strong>Tema Desteği:</strong> Uzun süreli kullanımlarda göz yorgunluğunu önlemek için sistemin varsayılanı 'Dark Mode' olmalı, istendiğinde Light Mode'a geçilebilmelidir.</li></ul><p>Büyük veri setlerinde (10.000+ satır) tarayıcıyı dondurmamak için 'Virtualization' tekniklerinin kullanılması şarttır.</p>",
    "budget": 8500,
    "deadline": "2025-04-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Modern E-Ticaret Alışveriş Deneyimi",
    "description": "<p>Mevcut e-ticaret sitemizin ön yüzünü (Storefront), dönüşüm oranlarını artırmak amacıyla Next.js kullanarak 'Headless' bir mimaride yeniden inşa ediyoruz. SEO uyumluluğu ve sayfa yüklenme hızı (Lighthouse skoru 90+) en büyük önceliğimizdir.</p><p><strong>Yapılacak geliştirmeler:</strong></p><ul><li><strong>Gelişmiş Filtreleme:</strong> Sol menüde marka, beden, renk ve fiyat aralığına göre anlık (AJAX) filtreleme yapan, sayfa yenilenmeden ürünleri getiren bir yapı kurulmalıdır.</li><li><strong>Ürün Detay Sayfası:</strong> Kullanıcı varyasyon (renk/beden) seçtiğinde URL değişmeli, stok durumu dinamik güncellenmeli ve galeri görselleri lazy-load ile yüklenmelidir.</li><li><strong>Sepet Yönetimi:</strong> 'Sepete Ekle' butonuna basıldığında sayfa donmadan sağ taraftan açılan (Drawer) bir mini sepet görünmeli ve 'Optimistic UI' yaklaşımı uygulanmalıdır.</li><li><strong>Checkout Akışı:</strong> Adres seçimi, kargo ve ödeme adımları tek sayfada (Single Page) veya 'Accordion' yapısında, form validasyonları (React Hook Form) ile hatasız ilerlemelidir.</li><li><strong>Mobil Öncelikli:</strong> Tasarım 'Mobile First' yaklaşımıyla kodlanmalı, mobildeki dokunmatik deneyim (Touch gestures) kusursuz olmalıdır.</li></ul><p>Proje sonunda bileşenlerin Storybook üzerinde dokümante edilerek teslim edilmesi beklenmektedir.</p>",
    "budget": 7800,
    "deadline": "2025-04-22T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Yönetim Paneli ve Admin Arayüzü",
    "description": "<p>Operasyon ekibimizin siparişleri, iadeleri ve kullanıcıları yönetebileceği; Ant Design veya Material UI gibi hazır bir UI kiti üzerine kurulu, işlevsel bir Backoffice paneli istiyoruz.</p><p><strong>Panel özellikleri:</strong></p><ul><li><strong>Veri Tabloları:</strong> Sunucu taraflı (Server-side) sayfalama, sıralama ve arama özelliklerine sahip, binlerce satırlık veriyi hızlıca gösterebilen tablolar oluşturulmalıdır.</li><li><strong>Form Yönetimi:</strong> Ürün ekleme gibi karmaşık işlemlerde, 'Wizard' (adım adım) yapısı kullanılmalı, dosya yükleme alanları sürükle-bırak destekli olmalıdır.</li><li><strong>Toplu İşlemler:</strong> Tablo üzerinden çoklu seçim yapılarak 'Toplu Sil', 'Durum Değiştir' veya 'Excel'e Aktar' gibi aksiyonlar alınabilmelidir.</li><li><strong>Rol Bazlı Görünüm:</strong> Giriş yapan kullanıcının yetkisine (Admin, Editör, Destek) göre sol menüdeki linkler ve sayfa içindeki butonlar dinamik olarak gizlenip açılmalıdır.</li><li><strong>Bildirim Merkezi:</strong> Sistemden gelen önemli uyarılar sağ üst köşedeki zil ikonunda birikmeli ve 'Toast' mesajları ile ekranda anlık gösterilmelidir.</li></ul><p>Kod yapısının modüler olması ve React Context API veya Redux ile global state yönetiminin temiz yapılması önemlidir.</p>",
    "budget": 6500,
    "deadline": "2025-04-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sosyal Medya Entegrasyonlu İçerik Platformu",
    "description": "<p>Kullanıcıların blog yazıları yazıp paylaşabildiği, Medium benzeri temiz ve odaklanmış bir okuma/yazma deneyimi sunan web arayüzü projesidir.</p><p><strong>Frontend detayları:</strong></p><ul><li><strong>Zengin Metin Editörü:</strong> Kullanıcıların yazı yazarken görsel ekleyebileceği, metni biçimlendirebileceği (Bold, Italic, H1) TipTap veya Slate.js tabanlı gelişmiş bir editör entegre edilmelidir.</li><li><strong>Sonsuz Kaydırma:</strong> Ana sayfadaki içerik akışı (Feed), kullanıcı aşağı indikçe yeni içerikleri yükleyen 'Infinite Scroll' mantığıyla çalışmalıdır.</li><li><strong>Etkileşimler:</strong> Beğeni ve yorum işlemleri anlık olmalı; kullanıcı butona bastığı anda backend yanıtı beklenmeden sayı artmalı (Optimistic Update), hata olursa geri alınmalıdır.</li><li><strong>Profil Sayfaları:</strong> Kullanıcının yazdığı yazılar, takipçi sayıları ve biyografisinin şık bir şekilde sergilendiği, Tab'lı yapıya sahip profil ekranları tasarlanmalıdır.</li><li><strong>Arama ve Keşfet:</strong> Hashtag veya kelime bazlı aramalarda sonuçlar anlık listelenmeli, popüler içerikler için özel slider bileşenleri kullanılmalıdır.</li></ul><p>SEO için Next.js'in SSR (Server Side Rendering) özellikleri etkin kullanılmalı, meta etiketleri dinamik yönetilmelidir.</p>",
    "budget": 9200,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Eğitim Platformu Öğrenci Arayüzü",
    "description": "<p>Online kurs platformumuzda öğrencilerin ders izleyeceği, sınav olacağı ve sertifika alacağı ön yüz modüllerinin geliştirilmesini talep ediyoruz.</p><p><strong>Geliştirilecek modüller:</strong></p><ul><li><strong>Video Oynatıcı:</strong> Standart HTML5 player yerine; hız ayarı, kalite seçimi, altyazı desteği ve 'Kaldığın yerden devam et' özelliği olan özelleştirilmiş bir player (Video.js vb.) yapılmalıdır.</li><li><strong>Ders Ağacı:</strong> Sol tarafta kursun bölümlerini ve tamamlanma durumlarını (tik işareti) gösteren, akordiyon yapısında bir müfredat menüsü olmalıdır.</li><li><strong>Quiz Arayüzü:</strong> Video aralarında veya sonunda çıkan çoktan seçmeli sorular için interaktif, süreli ve anında geri bildirim veren bir sınav ekranı kodlanmalıdır.</li><li><strong>Not Alma:</strong> Öğrenci videoyu izlerken sağ taraftaki panele o anki saniyeye (timestamp) bağlı notlar alabilmeli ve bu notlara tıklayınca video o saniyeye gitmelidir.</li><li><strong>Sertifika Görüntüleme:</strong> Kurs bitiminde dinamik olarak oluşturulan sertifika, ekranda HTML olarak render edilmeli ve 'jsPDF' kütüphanesi ile PDF olarak indirilebilmelidir.</li></ul><p>Öğrencinin ilerleme durumu yerel depolamada (LocalStorage) tutularak, internet kopukluklarında veri kaybı önlenmelidir.</p>",
    "budget": 7500,
    "deadline": "2025-04-28T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Gerçek Zamanlı İletişim Arayüzü",
    "description": "<p>Müşteri destek ekiplerimiz için, WhatsApp Web benzeri, kullanımı kolay ve hızlı bir mesajlaşma (Chat) arayüzü tasarlıyoruz. Tasarımın Tailwind CSS ile yapılması tercih sebebimizdir.</p><p><strong>Beklenen özellikler:</strong></p><ul><li><strong>Sohbet Listesi:</strong> Sol tarafta son konuşmaların listelendiği, okunmamış mesaj sayısının (Badge) ve kullanıcının online durumunun (Avatar dot) göründüğü bir liste olmalıdır.</li><li><strong>Mesaj Alanı:</strong> Mesaj balonları gönderen/alan ayrımıyla yerleşmeli, gönderildi/okundu tikleri (Double Check) mesajın durumuna göre renk değiştirmelidir.</li><li><strong>Dosya Paylaşımı:</strong> Kullanıcı sohbet penceresine resim veya PDF sürükleyip bıraktığında (Drag & Drop), yükleme barı ile birlikte dosya gönderimi başlamalıdır.</li><li><strong>Emoji ve GIF:</strong> Mesaj yazma alanına entegre bir emoji seçici ve Giphy entegrasyonu ile GIF arama özelliği eklenmelidir.</li><li><strong>Yazıyor İndikatörü:</strong> Karşı taraf yazarken 'Ahmet yazıyor...' ibaresi sohbetin altında animasyonlu (üç nokta) olarak belirmelidir.</li></ul><p>Mesaj geçmişi çok uzun olabileceği için, DOM eleman sayısını düşük tutmak adına 'Virtualized List' (React Window) kullanılmalıdır.</p>",
    "budget": 6800,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Proje Yönetim ve İşbirliği Arayüzü",
    "description": "<p>Ekiplerin görevlerini takip edebileceği, Trello ve Asana karışımı, sürükle-bırak etkileşimlerinin yoğun olduğu bir proje yönetim arayüzü geliştiriyoruz.</p><p><strong>Kritik bileşenler:</strong></p><ul><li><strong>Kanban Board:</strong> Görev kartlarının (Task Cards) sütunlar arasında pürüzsüzce taşınabildiği, 'dnd-kit' veya 'react-beautiful-dnd' kullanılarak yapılmış bir pano olmalıdır.</li><li><strong>Görev Detay Modalı:</strong> Bir karta tıklandığında açılan modalda; açıklama, atanan kişiler, etiketler ve yorumlar bölümü bulunmalı, yapılan değişiklikler anında karta yansımalıdır.</li><li><strong>Gantt Şeması:</strong> Projenin zaman çizelgesini gösteren, görev sürelerinin uzatılıp kısaltılabildiği interaktif bir Gantt görünümü (SVG veya Canvas tabanlı) eklenmelidir.</li><li><strong>Filtreleme Çubuğu:</strong> Görevleri kişiye, etikete veya son tarihe göre süzebilen, çoklu seçime izin veren gelişmiş bir filtreleme barı tasarlanmalıdır.</li><li><strong>Aktivite Akışı:</strong> Sağ panelde 'Ahmet kartı taşıdı', 'Mehmet yorum yaptı' gibi proje tarihçesini gösteren bir log akışı bulunmalıdır.</li></ul><p>Uygulama genelinde 'State Management' (Zustand veya Redux Toolkit) çok iyi kurgulanmalı, gereksiz render'lardan kaçınılmalıdır.</p>",
    "budget": 9500,
    "deadline": "2025-04-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Müşteri İlişkileri Yönetim Arayüzü",
    "description": "<p>Satış ekibimizin potansiyel müşterileri (Lead) takip edebileceği, veri yoğunluklu ancak göz yormayan bir CRM ön yüzü yaptırmak istiyoruz.</p><p><strong>Arayüz ihtiyaçları:</strong></p><ul><li><strong>Müşteri Kartı:</strong> Müşterinin iletişim bilgilerinin, şirket detaylarının ve statüsünün düzenli bir grid yapısında gösterildiği ana profil sayfasıdır.</li><li><strong>Pipeline Görünümü:</strong> Satış fırsatlarının (Deal) hangi aşamada olduğunu (Teklif, Görüşme, Kapandı) gösteren, toplam tutarların sütun başlarında hesaplandığı bir görünüm olmalıdır.</li><li><strong>Takvim Entegrasyonu:</strong> 'FullCalendar' vb. kullanılarak; toplantıların, aramaların ve görevlerin ay/hafta/gün bazında görüntülendiği bir ajanda modülü eklenmelidir.</li><li><strong>Hızlı Arama:</strong> Header'da bulunan arama çubuğu, yazmaya başlandığı anda (Debounce) müşteri, fırsat ve görevler arasında global arama yapıp sonuçları dropdown'da göstermelidir.</li><li><strong>Notlar ve E-posta:</strong> Müşteri detayında zengin metin editörü ile not alınabilmeli ve ön tanımlı şablonlarla hızlı e-posta taslağı oluşturulabilmelidir.</li></ul><p>Tasarım responsive olmalı, saha satış ekibi tabletlerinden de sistemi rahatça kullanabilmelidir.</p>",
    "budget": 7200,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Landing Page ve Dönüşüm Optimizasyonu",
    "description": "<p>Yeni SaaS ürünümüzün lansmanı için, ziyaretçiyi etkileyip 'Demo İste' butonuna tıklatmaya odaklanmış, görsel açıdan zengin bir Landing Page'e ihtiyacımız var.</p><p><strong>Tasarım ve kodlama detayları:</strong></p><ul><li><strong>Hero Bölümü:</strong> Açılışta ürünün değer önerisini anlatan büyük bir başlık, yanında Lottie animasyonu veya yüksek kaliteli bir ürün görseli ve dikkat çekici bir CTA butonu olmalıdır.</li><li><strong>Animasyonlar:</strong> Sayfa aşağı kaydırıldıkça (Scroll) özelliklerin sağdan/soldan belirip (Fade-in/Slide-up) geldiği, Framer Motion veya AOS ile yapılmış yumuşak geçişler eklenmelidir.</li><li><strong>Özellik Gridleri:</strong> Ürünün özelliklerini ikonlar ve kısa metinlerle anlatan, mobilde alt alta, masaüstünde 3'lü veya 4'lü sütunlara dönüşen responsive gridler kurulmalıdır.</li><li><strong>Referanslar (Testimonials):</strong> Müşteri yorumlarının otomatik kaydığı, dokunmatik uyumlu bir 'Carousel' (Swiper.js) bileşeni yerleştirilmelidir.</li><li><strong>Lead Formu:</strong> Sayfa sonunda veya modal içinde açılan, validasyon kuralları olan ve gönderim sırasında yükleniyor durumunu gösteren şık bir iletişim formu olmalıdır.</li></ul><p>Sayfanın Google PageSpeed Insights skoru mobil ve masaüstü için yeşil bölgede (90+) olacak şekilde optimize edilmelidir.</p>",
    "budget": 3500,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  }
]