[
  {
    "title": "Kurumsal İş Süreçleri Yönetim Platformu",
    "description": "<p>Fabrikamızdaki üretim, satın alma ve lojistik departmanlarının Excel dosyalarıyla boğuşmasını bitirecek, Node.js ve React kullanılarak geliştirilecek merkezi bir ERP/BPM yazılımı istiyoruz.</p><p><strong>Sistemin ana modülleri:</strong></p><ul><li><strong>Dinamik Form Altyapısı:</strong> Yöneticilerin kod yazmadan (No-Code benzeri) yeni talep formları oluşturabileceği ve bu formları sürükle-bırak ile tasarlayabileceği bir yapı kurulmalıdır.</li><li><strong>Onay Mekanizması:</strong> Oluşturulan taleplerin departman müdürüne, ardından finans ekibine düştüğü, çok aşamalı ve koşullu (Tutar > 5000 ise GM onayı gerekir gibi) bir iş akış motoru yazılmalıdır.</li><li><strong>Doküman Yönetimi:</strong> Yüklenen fatura ve irsaliyelerin S3 üzerinde şifreli saklandığı, OCR ile üzerindeki verilerin (Tarih, Tutar) otomatik okunup forma işlendiği bir özellik eklenmelidir.</li><li><strong>Bildirim Merkezi:</strong> Bekleyen işler için kullanıcılara hem e-posta hem de sistem içi Socket.io tabanlı anlık bildirimler gitmelidir.</li><li><strong>Raporlama:</strong> Süreçlerin ne kadar sürdüğünü, hangi departmanda tıkandığını gösteren grafiksel dashboard'lar hazırlanmalıdır.</li></ul><p>Backend tarafında NestJS, Frontend tarafında ise Next.js kullanılması ve veritabanı olarak PostgreSQL tercih edilmesi gerekmektedir.</p>",
    "budget": 9500,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Çok Kiracılı SaaS İş Platformu",
    "description": "<p>KOBİ'lere yönelik geliştirdiğimiz muhasebe ve stok takibi SaaS projemiz için, tek bir kod tabanında binlerce şirketi izole şekilde barındırabilecek 'Multi-Tenant' bir mimari kurmamız gerekiyor.</p><p><strong>Mimari gereksinimler:</strong></p><ul><li><strong>Veri İzolasyonu:</strong> Her müşteri (Tenant) için mantıksal ayrım (Row-Level Security) veya şema bazlı ayrım (Schema-based) yapılarak verilerin birbirine karışması %100 engellenmelidir.</li><li><strong>Subdomain Yönetimi:</strong> Müşteriler kayıt olduğunda 'firma.bizimapp.com' şeklinde otomatik subdomain oluşturulmalı ve Wildcard SSL sertifikası ile korunmalıdır.</li><li><strong>Abonelik Sistemi:</strong> Stripe entegrasyonu yapılarak; Deneme, Standart ve Pro paketleri tanımlanmalı, ödemesi geçenin erişimi otomatik kısıtlanmalıdır.</li><li><strong>Özelleştirme:</strong> Firmalar kendi logolarını yükleyebilmeli, fatura şablonlarını ve renk temalarını sisteme göre (White-labeling) ayarlayabilmelidir.</li><li><strong>Admin Paneli:</strong> Süper adminlerin tüm kiracıları görebileceği, paketlerini değiştirebileceği ve 'Login as User' (Taklit etme) özelliği ile destek verebileceği bir panel yazılmalıdır.</li></ul><p>Sistem yük altında (High Concurrency) çalışacağı için Redis önbellekleme ve BullMQ ile kuyruk yapısı kurgulanmalıdır.</p>",
    "budget": 9800,
    "deadline": "2025-05-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Online Pazar Yeri ve E-Ticaret Platformu",
    "description": "<p>Niş bir sektörde (El yapımı organik ürünler) faaliyet gösterecek, Trendyol modelinde çok satıcılı (Multi-Vendor) bir pazar yeri platformu inşa etmek istiyoruz.</p><p><strong>Platformun iki yüzü:</strong></p><ul><li><strong>Satıcı Paneli (Vendor Dashboard):</strong> Satıcıların ürün yükleyebileceği, stoklarını güncelleyebileceği ve siparişlerini kargo entegrasyonu (Yurtiçi/Aras API) ile yönetebileceği detaylı bir panel.</li><li><strong>Müşteri Arayüzü (Storefront):</strong> Hızlı çalışan, mobil uyumlu, gelişmiş arama ve filtreleme (Elasticsearch) özelliklerine sahip modern bir alışveriş arayüzü.</li><li><strong>Komisyon Altyapısı:</strong> Satılan her üründen kategori bazlı komisyon kesilerek bakiyenin hesaplandığı ve hak edişlerin (Payout) yönetildiği bir cüzdan sistemi.</li><li><strong>Sepet Mantığı:</strong> Farklı satıcılardan alınan ürünlerin tek sepette toplanması ancak arka planda siparişlerin satıcı bazlı bölünmesi (Order Splitting) mantığı.</li><li><strong>Mesajlaşma:</strong> Alıcı ve satıcının sipariş hakkında konuşabileceği, küfür/hakaret filtresi olan dahili bir chat modülü.</li></ul><p>Projede MERN (MongoDB, Express, React, Node) stack veya T3 Stack (Trpc, Tailwind, TypeScript) kullanılması tercihimizdir.</p>",
    "budget": 9200,
    "deadline": "2025-05-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "İnsan Kaynakları ve Bordro Yönetim Sistemi",
    "description": "<p>Personel sayısı 500'ü aşan firmamız için; izinler, bordrolar, zimmetler ve performans değerlendirmelerinin tek çatı altında toplandığı güvenli bir İK yazılımı talep ediyoruz.</p><p><strong>Fonksiyonel detaylar:</strong></p><ul><li><strong>Özlük Dosyası:</strong> Çalışanların tüm belgelerinin (Diploma, Sözleşme, Sağlık Raporu) dijitalleştirildiği ve KVKK uyumlu yetki setleriyle korunduğu bir arşiv sistemi.</li><li><strong>İzin Yönetimi:</strong> Çalışanın web veya mobilden izin talep ettiği, yöneticisinin onayladığı ve kalan izin hakkının otomatik düştüğü bir akış.</li><li><strong>Bordro Görüntüleme:</strong> Her ay yüklenen PDF bordroların, çalışan tarafından şifreli bir şekilde görüntülenebildiği ve indirilebildiği güvenli alan.</li><li><strong>Zimmet Takibi:</strong> Bilgisayar, telefon, araç gibi şirket demirbaşlarının kime ne zaman verildiğinin ve iade tarihlerinin takip edildiği modül.</li><li><strong>Organizasyon Şeması:</strong> Veritabanındaki hiyerarşiye göre dinamik olarak çizilen ve zoom yapılabilen interaktif bir organizasyon ağacı.</li></ul><p>Verilerin güvenliği en üst seviyede olmalı, veritabanı (SQL Server veya Postgres) şifreli tutulmalı ve düzenli yedeklenmelidir.</p>",
    "budget": 8500,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Müşteri Destek ve Ticket Yönetim Sistemi",
    "description": "<p>Müşterilerimizden gelen e-postaları, telefon aramalarını ve web formlarını tek bir havuzda toplayıp (Omnichannel), destek ekibimizin sırayla yanıtlayacağı bir Ticket sistemi (Zendesk klonu) yazdırmak istiyoruz.</p><p><strong>Sistem özellikleri:</strong></p><ul><li><strong>E-posta Ayrıştırma (Parsing):</strong> destek@firma.com adresine gelen mailleri otomatik okuyup Ticket'a dönüştüren, konu başlığından öncelik belirleyen bir servis.</li><li><strong>SLA Yönetimi:</strong> Müşteri tipine (VIP, Standart) göre yanıt verme süresini sayan (Countdown), süre aşımında yöneticiye eskalasyon yapan zamanlayıcılar.</li><li><strong>Hazır Yanıtlar (Canned Responses):</strong> Sık sorulan sorular için şablon metinlerin tanımlandığı ve '/' komutuyla hızlıca eklenebildiği editör yapısı.</li><li><strong>İç İletişim:</strong> Bir bilet üzerinde çalışırken, müşterinin görmediği 'İç Notlar' alarak ekip arkadaşlarını etiketleme (@mention) özelliği.</li><li><strong>Bilgi Bankası (KB):</strong> Ticket çözüldüğünde, çözümün tek tıkla herkese açık bir makaleye dönüştürülebileceği SEO uyumlu bir yardım merkezi.</li></ul><p>Frontend'de Vue.js veya React, Backend'de ise Python (Django/FastAPI) veya Node.js kullanılması uygundur.</p>",
    "budget": 7500,
    "deadline": "2025-04-28T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "İçerik Yönetim ve Yayınlama Platformu",
    "description": "<p>Haber ajansımız için, WordPress'in hantallığından kurtulup, tamamen ihtiyaçlarımıza özel (Bespoke), headless mimaride çalışan ultra hızlı bir CMS (Content Management System) istiyoruz.</p><p><strong>CMS yetenekleri:</strong></p><ul><li><strong>Blok Editör:</strong> Notion benzeri; metin, resim, tweet, video veya reklam alanlarını bloklar halinde ekleyip sürükleyebileceğimiz modern bir yazı editörü.</li><li><strong>Medya Kütüphanesi:</strong> Yüklenen görselleri otomatik webp formatına çeviren, boyutlandıran ve CDN (Cloudflare Images) üzerine dağıtan bir varlık yöneticisi.</li><li><strong>Rol Yönetimi:</strong> Muhabir yazıyı yazar, Editör düzenler, Yazı İşleri Müdürü onaylar ve yayına alır şeklinde kurgulanan detaylı bir yetki matrisi.</li><li><strong>Revizyon Takibi:</strong> Bir yazının eski versiyonlarının saklandığı, kimin neyi değiştirdiğini (Diff Viewer) görebileceğimiz bir geçmiş kaydı.</li><li><strong>API Çıkışı:</strong> İçeriklerin Mobil Uygulama ve Web sitesi tarafından tüketilmesi için GraphQL veya REST tabanlı, yüksek performanslı API endpointleri.</li></ul><p>Sistemin veritabanı şeması, milyonlarca içeriği ve yüksek trafiği kaldırabilecek şekilde (Indexing, Sharding) optimize edilmelidir.</p>",
    "budget": 8200,
    "deadline": "2025-05-08T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Proje ve Kaynak Yönetim Platformu",
    "description": "<p>Yazılım ve tasarım ajansımızda projelerin karlılığını, çalışanların doluluk oranlarını ve teslim tarihlerini takip edebileceğimiz, Jira ve Harvest karışımı hibrit bir araç geliştirmek istiyoruz.</p><p><strong>Platform bileşenleri:</strong></p><ul><li><strong>Kaynak Planlama:</strong> Hangi çalışanın hangi projede, haftada kaç saat rezerve edildiğini gösteren ve çakışmaları (Overbooking) uyaran bir takvim görünümü.</li><li><strong>Zaman Takibi (Timesheet):</strong> Çalışanların görev bazlı sürelerini 'Başlat/Durdur' butonuyla veya manuel girerek kaydettiği, sonunda faturalandırılabilir saati hesaplayan modül.</li><li><strong>Proje Bütçesi:</strong> Projeye ayrılan adam/saat bütçesi ile harcanan eforu karşılaştıran, bütçe %80'e gelince uyarı veren maliyet analiz ekranları.</li><li><strong>Görev Yönetimi:</strong> Liste, Kanban ve Gantt görünümlerini destekleyen, alt görev (Sub-task) ve dosya paylaşımı özellikleri olan iş takip sistemi.</li><li><strong>Müşteri Portalı:</strong> Müşterilerin projelerinin ilerlemesini salt okunur (Read-only) görebilecekleri ve onay verebilecekleri kısıtlı bir arayüz.</li></ul><p>Arayüzde sürükle-bırak etkileşimleri yoğun olacağı için React DnD veya benzeri kütüphanelerle akıcı bir deneyim sağlanmalıdır.</p>",
    "budget": 8000,
    "deadline": "2025-05-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Emlak Yönetim ve Kiralama Platformu",
    "description": "<p>Yüzlerce konut ve iş yerini yöneten gayrimenkul firmamız için; kira takibi, sözleşme yönetimi ve kiracı iletişimini dijitalleştirecek bir 'Property Management System' (PMS) arayışındayız.</p><p><strong>Gereksinimler:</strong></p><ul><li><strong>Sözleşme Oluşturucu:</strong> Kiracı ve mülk bilgileri girildiğinde, sistemdeki şablonu kullanarak otomatik PDF kira sözleşmesi üreten ve e-imza entegrasyonuna hazır modül.</li><li><strong>Finansal Takip:</strong> Kiraların yatıp yatmadığını banka entegrasyonu (Open Banking API) ile kontrol eden, gecikenlere otomatik SMS ve E-posta hatırlatması atan robot.</li><li><strong>Bakım Talepleri:</strong> Kiracının 'Musluk bozuldu' gibi taleplerini fotoğraf çekip iletebileceği, yöneticinin de ustaya iş atayabileceği bir iş emri sistemi.</li><li><strong>Gider Paylaşımı:</strong> Apartman aidatı, yakıt vb. ortak giderleri mülklerin metrekaresine veya arsa payına göre otomatik dağıtan hesaplama motoru.</li><li><strong>Kiracı Uygulaması (PWA):</strong> Kiracıların ekstrelerini görebileceği, kredi kartıyla kira ödeyebileceği mobil uyumlu web arayüzü.</li></ul><p>Veritabanı yapısı, bir mülkün geçmişteki tüm kiracılarını ve tadilatlarını tarihçeli olarak saklayabilmelidir.</p>",
    "budget": 7800,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Eğitim Kurumu Yönetim Sistemi",
    "description": "<p>Özel okullar ve kolejler için; öğrenci kaydından karne basımına, veli bilgilendirmeden öğretmen ders programına kadar tüm süreçleri kapsayan entegre bir SIS (Student Information System) yazılımı istiyoruz.</p><p><strong>Modüler yapı:</strong></p><ul><li><strong>Ders Programı Algoritması:</strong> Öğretmenlerin müsaitlik durumuna, sınıfların kapasitesine ve ders saatlerine göre çakışmasız haftalık programı otomatik dağıtan akıllı bir algoritma.</li><li><strong>Ölçme Değerlendirme:</strong> Sınav sonuçlarını Excel'den içeri alan, konu analizli karneler üreten ve öğrencinin gelişimini grafiklerle gösteren analiz modülü.</li><li><strong>Yoklama Sistemi:</strong> Öğretmenin tabletten sınıftaki öğrencileri 'Var/Yok' diye işaretlediği, gelmeyenin velisine anında SMS giden mobil uyumlu ekranlar.</li><li><strong>Muhasebe Entegrasyonu:</strong> Öğrenci taksitlerinin takibi, gecikme faizi hesabı ve e-Fatura entegratörleri (Logo, Mikro vb.) ile veri alışverişi.</li><li><strong>Veli İletişimi:</strong> Okul duyurularının, yemek listesinin ve ödevlerin paylaşıldığı, veli ve öğretmenin mesajlaşabildiği güvenli bir portal.</li></ul><p>Proje kapsamı geniş olduğu için veritabanı normalizasyonuna ve Frontend tarafında kodun parçalanmasına (Code Splitting) dikkat edilmelidir.</p>",
    "budget": 8800,
    "deadline": "2025-05-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Restoran Zinciri Yönetim Platformu",
    "description": "<p>20 şubeli bir fast-food zinciriyiz. Şubelerdeki POS sistemlerinden gelen satış verilerini merkeze toplayan, stok ve maliyet analizi yapmamızı sağlayan bulut tabanlı bir arka ofis (Backoffice) yazılımı istiyoruz.</p><p><strong>Beklenen özellikler:</strong></p><ul><li><strong>Merkezi Menü Yönetimi:</strong> Tek bir panelden bir ürünün fiyatını değiştirince, tüm şubelerdeki dijital menülerde ve kasalarda (API ile) anında güncellenmesini sağlayan yapı.</li><li><strong>Reçete ve Maliyet:</strong> 'Hamburger' satıldığında stoktan 1 ekmek, 100gr et, 10gr marul düşen ve anlık maliyeti hesaplayan detaylı reçete motoru.</li><li><strong>Satın Alma Tahmini:</strong> Geçmiş satış verilerine bakarak 'Haftaya şu şubeye 50kg patates lazım' diye öneride bulunan yapay zeka destekli tahminleme.</li><li><strong>Franchise Yönetimi:</strong> Franchise şubelerin cirolarını, royalty bedellerini ve cari hesaplarını takip eden finansal modül.</li><li><strong>Dashboard:</strong> Şube bazlı ciroları, en çok satan ürünleri ve iptal/iade oranlarını canlı (Real-time) gösteren yönetim ekranları.</li></ul><p>Yüksek veri hacmi nedeniyle veritabanı optimizasyonu ve raporlama performansına (Materialized Views, Caching) önem verilmelidir.</p>",
    "budget": 9000,
    "deadline": "2025-05-12T00:00:00.000Z",
    "status": "open"
  }
]