[
  {
    "title": "Full Stack E-ticaret Platformu",
    "description": "Günlük binlerce siparişi karşılayabilecek kapasitede e-ticaret platformu. React frontend ve Node.js (Express) backend. MongoDB veya PostgreSQL veritabanı.\n\nKullanıcı yönetimi: Kayıt, giriş, profil yönetimi. JWT authentication. E-posta doğrulama ve şifre sıfırlama.\n\nÜrün yönetimi: Ürün ekleme/düzenleme, kategorilendirme. Varyant desteği (beden, renk). Otomatik stok takibi.\n\nSatış süreci: Kullanıcı dostu sepet ve checkout. iyzico ödeme entegrasyonu. Sipariş takibi.\n\nYönetim: Admin paneli, satış istatistikleri raporlama. Mobil uyumluluk. Performans optimizasyonu.",
    "budget": 120000,
    "deadline": "2025-05-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "SaaS Platform Geliştirme",
    "description": "B2B SaaS platformu için multi-tenant architecture ile birden fazla müşteriye hizmet verebilen full stack çözüm. MERN stack (MongoDB, Express, React, Node.js).\n\nÇoklu müşteri yönetimi: Her müşteri için izole veri yönetimi. Abonelik yönetimi: free, basic, premium planlar. Otomatik faturalandırma.\n\nÖdeme: Kredi kartı işleme (Stripe veya benzer). Webhook handling.\n\nKullanıcı deneyimi: User dashboard, admin panel. Third-party API entegrasyonları.\n\nGüvenlik ve uyumluluk: Data isolation, GDPR/KVKK uyumluluğu. Monitoring ve logging.",
    "budget": 140000,
    "deadline": "2025-05-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "CRM Sistemi",
    "description": "Satış ekibinin müşteri ilişkilerini yönetmesini kolaylaştıran müşteri ilişkileri yönetim sistemi. React frontend, Node.js backend, PostgreSQL.\n\nMüşteri yönetimi: Müşteri bilgileri, iletişim geçmişi, notlar. Görev yönetimi.\n\nE-posta entegrasyonu: E-posta entegrasyonu, açılma/tıklama takibi.\n\nAnalitik: Satış metrikleri, müşteri analizi dashboard'u. Pipeline yönetimi.\n\nGüvenlik: Müşteri verilerinin korunması. Role-based access control. Audit logging.",
    "budget": 95000,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Proje Yönetim Platformu",
    "description": "Projelerin planlanması, takibi ve tamamlanmasını kolaylaştıran takım çalışması platformu. React, Node.js, WebSocket (gerçek zamanlı), MongoDB/PostgreSQL.\n\nGörev yönetimi: Görev oluşturma ve atama. Kanban board, drag-and-drop.\n\nİzleme: Çalışma saatleri takibi. Dosya paylaşımı. Takım içi chat.\n\nBildirimler: Görev güncellemeleri, deadline hatırlatmaları. Proje ilerlemesi ve zaman kullanımı raporlama.\n\nEntegrasyon: Slack, Jira entegrasyonları.",
    "budget": 110000,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sosyal Ağ Platformu",
    "description": "Niche topluluk için içerik paylaşımı ve etkileşim odaklı sosyal ağ platformu. Modern tech stack, WebSocket (gerçek zamanlı), ölçeklenebilir mimari.\n\nKullanıcı özellikleri: Profiller, paylaşımlar, beğeniler. Feed sayfası. Beğeni ve yorum sistemi. Takip sistemi. Özel mesajlaşma.\n\nYönetim: Bildirimler. Admin paneli ile içerik moderasyonu.\n\nPerformans: Optimizasyon. Güvenlik ve gizlilik.",
    "budget": 130000,
    "deadline": "2025-05-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Online Eğitim Platformu",
    "description": "Öğrencilerin dersleri takip etmesi ve eğitmenlerin içerik yönetmesi için e-learning platformu. Modern tech stack, optimize edilmiş video streaming, ölçeklenebilir mimari.\n\nKullanıcı panelleri: Öğrenci ve eğitmen panelleri ayrı. Video streaming altyapısı. Quiz sistemi. Sertifika sistemi.\n\nÖdeme: Kurs satın alma entegrasyonu. Admin paneli.\n\nEk özellikler: Oyunlaştırma. Öğrenci ilerlemesi analitiği. Mobil uygulama entegrasyonu düşünülebilir.",
    "budget": 125000,
    "deadline": "2025-05-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Restoran Yönetim Sistemi",
    "description": "Restoran operasyonlarını dijitalleştiren, verimliliği artıran yönetim sistemi. React, Node.js, WebSocket (gerçek zamanlı), PostgreSQL.\n\nOperasyonel özellikler: Masa rezervasyonu. Menü yönetimi. Gerçek zamanlı sipariş takibi.\n\nÖdeme ve raporlama: Nakit ve kredi kartı ödemeleri. Günlük, haftalık, aylık raporlar.\n\nMobil: Tablet kullanımı için mobil uyumluluk. Mutfak ekranı entegrasyonu düşünülebilir.\n\nEk modüller: Stok takibi. Personel yönetimi.",
    "budget": 85000,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "İnsan Kaynakları Yönetim Sistemi",
    "description": "Çalışan yönetimini dijitalleştiren, süreçleri otomatikleştiren HR platformu. Modern tech stack, KVKK/GDPR uyumluluğu.\n\nÇalışan yönetimi: Bilgiler, dokümanlar. İzin takibi: başvurular, onaylar.\n\nMaaş ve performans: Maaş hesaplamaları ve ödemeleri. Performans değerlendirme.\n\nRaporlama: HR metrikleri dashboard'u. Employee self-service portal.\n\nGüvenlik: Role-based access control, audit logging. Payroll sistemleri entegrasyonu.",
    "budget": 100000,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Emlak Yönetim Platformu",
    "description": "Emlakçıların ilan yönetmesi ve müşterilerin arama yapması için platform. Full stack geliştirme, ölçeklenebilir mimari, yüksek performanslı arama.\n\nİlan yönetimi: Ekleme, düzenleme, yayınlama. Gelişmiş arama ve filtreleme.\n\nHarita ve iletişim: Google Maps entegrasyonu (konum bazlı arama). Emlakçı-müşteri mesajlaşma.\n\nKullanıcı özellikleri: Favoriler. Admin paneli: ilan onaylama, kullanıcı yönetimi.\n\nOptimizasyon: SEO. Mobile-first yaklaşım. İlan performansı analitiği.",
    "budget": 90000,
    "deadline": "2025-04-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Etkinlik Yönetim ve Biletleme Sistemi",
    "description": "Etkinlik oluşturma, bilet satışı ve katılımcı yönetimi için entegre sistem. React, Node.js, WebSocket, ölçeklenebilir mimari.\n\nEtkinlik yönetimi: Etkinlik bilgileri (tarih, konum, kapasite). Online bilet satışı.\n\nÖdeme ve giriş: iyzico entegrasyonu. QR kod bilet doğrulama. Check-in sistemi.\n\nRaporlama: Satış istatistikleri, katılımcı analizi. Mobil uyumluluk.\n\nEntegrasyonlar: E-posta pazarlama. Sosyal medya entegrasyonu.",
    "budget": 80000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  }
]
