[
  {
    "title": "Sosyal Bağlantı ve Etkinlik Uygulaması",
    "description": "Yerel toplulukların bir araya gelmesini kolaylaştıran sosyal bir mobil platform inşa ediyoruz. Kullanıcılar, ilgi alanlarına göre gruplar oluşturabiliyor ve etkinlikler düzenleyebiliyor. Profil yönetimi, kullanıcıların kendilerini tanıtmasına ve ilgi alanlarını paylaşmasına izin veriyor. Etkinlik oluşturma özelliği, tarih, konum ve detay bilgilerinin girilmesini sağlıyor. Harita entegrasyonu, yakındaki etkinliklerin keşfedilmesine yardımcı oluyor. Bildirim sistemi, yeni etkinlikler ve grup güncellemeleri için kullanılıyor. Mesajlaşma özelliği, grup üyeleri arasında iletişim kurulmasını destekliyor. Fotoğraf paylaşımı, etkinlik anılarının kaydedilmesine olanak veriyor. Arama ve filtreleme, ilgi alanlarına göre içerik bulmayı kolaylaştırıyor. Güvenlik özellikleri, kullanıcı doğrulama ve içerik moderasyonu içeriyor. Cross-platform geliştirme, iOS ve Android için native performans sağlıyor.",
    "budget": 95000,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Kişisel Finans Yönetim Uygulaması",
    "description": "Bireysel finansal planlama ve bütçe takibi için kapsamlı bir mobil uygulama tasarlıyoruz. Gelir ve gider kayıtları, kategorilere göre organize ediliyor ve görselleştiriliyor. Bütçe planlama modülü, aylık ve yıllık hedeflerin belirlenmesine izin veriyor. Grafik ve istatistikler, finansal durumun anlaşılır şekilde analiz edilmesini sağlıyor. Fatura takibi, ödeme hatırlatmaları ile zamanında ödemelerin yapılmasına yardımcı oluyor. Yatırım portföyü takibi, varlık değerlerinin izlenmesine olanak veriyor. Hedef belirleme özelliği, tasarruf hedeflerinin takibini destekliyor. Raporlama araçları, detaylı finansal analizler sunuyor. Güvenlik, biyometrik kimlik doğrulama ve şifreleme ile veri koruması sağlıyor. Banka entegrasyonu, otomatik işlem senkronizasyonu için düşünülüyor. Offline mod, internet bağlantısı olmadan temel işlevlerin kullanılabilmesine izin veriyor.",
    "budget": 72000,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Seyahat Planlama ve Rehber Uygulaması",
    "description": "Seyahat tutkunları için rota planlama ve destinasyon keşfi sunan interaktif bir mobil çözüm geliştiriyoruz. Rota oluşturma aracı, çoklu destinasyon ekleme ve optimizasyon özellikleri içeriyor. Harita görünümü, interaktif harita üzerinde rota görselleştirmesi sunuyor. Destinasyon bilgileri, popüler yerler, restoranlar ve konaklama seçeneklerini içeriyor. Fotoğraf galerisi, kullanıcıların seyahat anılarını paylaşmasına izin veriyor. Offline harita desteği, internet bağlantısı olmadan navigasyon sağlıyor. Bütçe hesaplayıcı, seyahat maliyetlerinin tahmin edilmesine yardımcı oluyor. Hava durumu entegrasyonu, destinasyonlardaki güncel hava koşullarını gösteriyor. Sosyal özellikler, seyahat planlarının arkadaşlarla paylaşılmasını destekliyor. Bildirimler, seyahat hatırlatmaları ve önemli güncellemeler için kullanılıyor. Yerel dil desteği, farklı ülkelerde kullanımı kolaylaştırıyor.",
    "budget": 68000,
    "deadline": "2025-03-28T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sağlık ve Wellness Takip Uygulaması",
    "description": "Bireylerin sağlık hedeflerine ulaşmasına yardımcı olan kapsamlı bir wellness platformu oluşturuyoruz. Aktivite takibi, adım sayısı, mesafe ve kalori yakımını ölçüyor. Beslenme günlüğü, yemek kayıtları ve kalori takibi özellikleri içeriyor. Uyku analizi, uyku kalitesi ve süresinin izlenmesini sağlıyor. Su tüketimi takibi, günlük su içme hedeflerinin takibine izin veriyor. Meditasyon modülü, rehberli meditasyon seansları sunuyor. İlerleme grafikleri, sağlık metriklerinin zaman içindeki değişimini görselleştiriyor. Hedef belirleme, kullanıcıların kişisel hedeflerini tanımlamasına olanak veriyor. Bildirimler, hatırlatmalar ve motivasyon mesajları için kullanılıyor. Wearable cihaz entegrasyonu, fitness tracker verilerinin senkronizasyonunu destekliyor. Sosyal özellikler, arkadaşlarla rekabet ve başarı paylaşımı sunuyor. Kişiselleştirilmiş öneriler, kullanıcı verilerine göre özel tavsiyeler içeriyor.",
    "budget": 78000,
    "deadline": "2025-04-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Dil Öğrenme ve Pratik Uygulaması",
    "description": "Etkileşimli dil öğrenme deneyimi sunan modern bir eğitim uygulaması geliştiriyoruz. Ders modülleri, seviye bazlı içerik organizasyonu ile yapılandırılıyor. Kelime öğrenme, flashcard sistemi ve tekrar algoritması ile destekleniyor. Telaffuz pratiği, ses tanıma teknolojisi ile doğru telaffuz kontrolü sağlıyor. Gramer alıştırmaları, interaktif egzersizler ve anında geri bildirim içeriyor. Konuşma pratiği, AI destekli konuşma partneri ile diyalog simülasyonu sunuyor. İlerleme takibi, tamamlanan dersler ve başarı istatistiklerini görüntülüyor. Rozet sistemi, motivasyonu artırmak için başarı rozetleri sunuyor. Offline mod, indirilen içeriklerin internet olmadan kullanılabilmesine izin veriyor. Çoklu dil desteği, farklı dillerin öğrenilmesini destekliyor. Sosyal özellikler, öğrenciler arası rekabet ve paylaşım imkanı sunuyor. Günlük hedefler, düzenli öğrenme alışkanlığı oluşturmayı teşvik ediyor.",
    "budget": 88000,
    "deadline": "2025-05-01T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Yerel İşletme Keşif ve Rezervasyon Uygulaması",
    "description": "Yerel işletmelerin keşfedilmesini ve rezervasyon yapılmasını kolaylaştıran bir platform tasarlıyoruz. İşletme listeleme, kategorilere göre organize edilmiş yerel işletme veritabanı içeriyor. Arama ve filtreleme, konum, kategori ve değerlendirmelere göre sonuçları daraltıyor. Harita görünümü, yakındaki işletmelerin görselleştirilmesini sağlıyor. Rezervasyon sistemi, restoran, kuaför ve diğer hizmetler için online rezervasyon imkanı sunuyor. Değerlendirme ve yorum sistemi, kullanıcı deneyimlerinin paylaşılmasına izin veriyor. Özel teklifler, işletmelerin kampanya ve indirimlerini sunmasına olanak veriyor. Favoriler özelliği, ilgi duyulan işletmelerin kaydedilmesini sağlıyor. Bildirimler, rezervasyon hatırlatmaları ve özel teklifler için kullanılıyor. İşletme profilleri, detaylı bilgiler, fotoğraflar ve çalışma saatlerini içeriyor. Sosyal paylaşım, işletme önerilerinin arkadaşlarla paylaşılmasını destekliyor. Konum bazlı öneriler, kullanıcı konumuna göre kişiselleştirilmiş öneriler sunuyor.",
    "budget": 65000,
    "deadline": "2025-03-22T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Müzik Keşif ve Çalma Listesi Uygulaması",
    "description": "Müzik severler için kişiselleştirilmiş keşif ve dinleme deneyimi sunan bir mobil uygulama inşa ediyoruz. Müzik kütüphanesi, geniş bir şarkı koleksiyonuna erişim sağlıyor. Akıllı öneri sistemi, kullanıcı dinleme geçmişine göre yeni şarkılar öneriyor. Çalma listesi yönetimi, özel ve paylaşılan listeler oluşturulmasına izin veriyor. Offline indirme, favori şarkıların internet olmadan dinlenebilmesini sağlıyor. Radio özelliği, temaya göre sürekli müzik akışı sunuyor. Şarkı sözleri görüntüleme, dinlerken sözlerin takip edilmesine olanak veriyor. Sosyal özellikler, arkadaşlarla çalma listesi paylaşımı ve müzik keşfi destekliyor. Podcast desteği, ses içeriklerinin dinlenmesine izin veriyor. Arka plan çalma, uygulama kapalıyken müziğin devam etmesini sağlıyor. Eşitleme ayarları, ses kalitesi tercihlerinin yapılandırılmasına olanak veriyor. Widget desteği, ana ekrandan hızlı erişim sağlıyor.",
    "budget": 82000,
    "deadline": "2025-04-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Ebeveyn Kontrolü ve Çocuk Güvenliği Uygulaması",
    "description": "Ebeveynlerin çocuklarının dijital aktivitelerini yönetmesine yardımcı olan güvenlik odaklı bir platform oluşturuyoruz. Cihaz kullanım süresi takibi, günlük ve haftalık kullanım limitlerinin belirlenmesini sağlıyor. İçerik filtreleme, uygunsuz içeriklere erişimin engellenmesine izin veriyor. Uygulama kontrolü, izin verilen ve yasaklanan uygulamaların yönetimini destekliyor. Konum takibi, çocukların güvenliğini sağlamak için gerçek zamanlı konum paylaşımı sunuyor. Acil durum butonu, hızlı yardım çağrısı için kullanılabiliyor. Web sitesi engelleme, zararlı sitelere erişimin kısıtlanmasını sağlıyor. Mesajlaşma izleme, şüpheli içeriklerin tespit edilmesine yardımcı oluyor. Raporlama, detaylı aktivite raporlarının ebeveynlere sunulmasını sağlıyor. Uzaktan yönetim, ebeveyn panelinden tüm kontrollerin yapılabilmesine olanak veriyor. Güvenlik özellikleri, veri şifreleme ve güvenli iletişim protokolleri içeriyor.",
    "budget": 75000,
    "deadline": "2025-04-08T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Alışveriş Listesi ve Fiyat Karşılaştırma Uygulaması",
    "description": "Alışveriş verimliliğini artıran akıllı liste yönetimi ve fiyat karşılaştırma çözümü geliştiriyoruz. Alışveriş listesi oluşturma, kategorilere göre organize edilmiş ürün listeleri sunuyor. Barkod tarama, ürün bilgilerinin hızlıca eklenmesine izin veriyor. Fiyat karşılaştırma, farklı mağazalardaki fiyatların karşılaştırılmasını sağlıyor. İndirim bildirimleri, favori ürünlerdeki fiyat düşüşlerini kullanıcıya iletiyor. Mağaza konumları, yakındaki mağazaların harita üzerinde gösterilmesini destekliyor. Paylaşım özelliği, aile üyeleriyle liste paylaşımına olanak veriyor. Stok takibi, evdeki ürünlerin stok durumunun yönetilmesini sağlıyor. Harcama analizi, alışveriş harcamalarının kategorilere göre analiz edilmesine izin veriyor. Hatırlatıcılar, düzenli alışveriş listeleri için otomatik bildirimler sunuyor. Çoklu liste desteği, farklı mağazalar için ayrı listeler oluşturulmasını destekliyor. Offline mod, internet bağlantısı olmadan temel işlevlerin kullanılabilmesine izin veriyor.",
    "budget": 48000,
    "deadline": "2025-03-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Spor Takımı ve Antrenman Yönetim Uygulaması",
    "description": "Spor takımlarının organizasyonunu ve antrenman süreçlerini dijitalleştiren kapsamlı bir platform oluşturuyoruz. Takım yönetimi, oyuncu bilgileri ve takım organizasyonu özellikleri içeriyor. Antrenman planlama, antrenörlerin program oluşturmasına ve paylaşmasına izin veriyor. İstatistik takibi, oyuncu performans metriklerinin kaydedilmesini ve analiz edilmesini sağlıyor. Maç takvimi, yaklaşan maçların ve sonuçların yönetilmesini destekliyor. Mesajlaşma sistemi, takım üyeleri arasında iletişim kurulmasına olanak veriyor. Bildirimler, antrenman hatırlatmaları ve önemli duyurular için kullanılıyor. Fotoğraf ve video paylaşımı, maç ve antrenman anılarının kaydedilmesini sağlıyor. Raporlama, takım performans analizlerinin görselleştirilmesine izin veriyor. Oyuncu profilleri, bireysel istatistikler ve başarıların sergilenmesini destekliyor. Ebeveyn portalı, genç sporcuların ebeveynlerinin bilgilendirilmesine olanak veriyor. Sosyal özellikler, takım ruhunu güçlendirmek için etkileşim araçları sunuyor.",
    "budget": 62000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  }
]
