[
  {
    "title": "iOS ve Android E-ticaret Uygulaması",
    "description": "E-ticaret platformunun mobil deneyimini geliştirmek için iOS ve Android uygulamaları. Web sitesinin tüm fonksiyonlarını mobil platforma taşıyacak kapsamlı bir çözüm.\n\nCross-platform geliştirme: React Native veya Flutter teknolojileri değerlendirilecek. Ürün listeleme, detay sayfaları, arama ve filtreleme özellikleri. Kullanıcı dostu sepet yönetimi ve ödeme akışı.\n\nGüvenli ödeme: iyzico SDK entegrasyonu. Sipariş takip sistemiyle kullanıcılar sipariş durumunu izleyebilecek. Push bildirimleri: sipariş durumu, kampanyalar, yeni ürün duyuruları.\n\nHesap yönetimi: Profil düzenleme, adres yönetimi, sipariş geçmişi görüntüleme. Favoriler özelliğiyle ürün kaydetme.\n\nMevcut backend API ile entegrasyon. App Store ve Google Play Store'a yayınlama. Performans optimizasyonu ve crash-free deneyim.",
    "budget": 75000,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Fitness Takip Uygulaması",
    "description": "Spor ve fitness tutkunlarının hedeflerine ulaşmasına yardımcı olacak kapsamlı bir takip uygulaması. Kullanıcıların antrenman ve beslenme süreçlerini yönetebileceği entegre bir platform.\n\nEgzersiz modülü: Hazır programlar ve kişiselleştirilmiş program oluşturma. Her egzersiz için video rehber, açıklama ve set/tekrar bilgileri.\n\nİlerleme analizi: Kilo, vücut ölçüleri, fotoğraf kayıtları. Görsel grafiklerle ilerleme takibi. Beslenme günlüğü ve kalori hesaplama.\n\nİstatistikler: Toplam antrenman sayısı, yakılan kalori, hedef tamamlama yüzdesi. Sosyal özellikler: arkadaş ekleme, başarı paylaşımı.\n\nSağlık entegrasyonları: Apple Health ve Google Fit ile veri senkronizasyonu. Push bildirimleriyle antrenman hatırlatmaları. Offline mod desteği.",
    "budget": 65000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Yemek Sipariş Uygulaması",
    "description": "Yemek sipariş ekosistemi için iki ayrı uygulama: kullanıcı ve restoran uygulamaları. Restoranların menülerini sunması ve kullanıcıların sipariş vermesi için tasarlanacak.\n\nKullanıcı uygulaması özellikleri:\n- Kategori bazlı menü gösterimi ve arama\n- Akıcı sepet yönetimi ve checkout süreci\n- Güvenli ödeme entegrasyonu\n- Gerçek zamanlı sipariş takibi\n- Google Maps ile kurye konum takibi\n\nRestoran uygulaması özellikleri:\n- Sipariş yönetim paneli\n- Menü güncelleme araçları\n- Çalışma saatleri yapılandırması\n- Push bildirimleriyle yeni sipariş uyarıları\n\nDeğerlendirme: Rating ve yorum sistemi. Firebase backend altyapısı kullanılabilir.",
    "budget": 80000,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sosyal Medya Uygulaması",
    "description": "Fotoğraf ve video paylaşımına odaklanan sosyal medya platformu. Kullanıcıların içerik oluşturması ve etkileşim kurması için tasarlanacak.\n\nKimlik doğrulama: E-posta, telefon veya sosyal medya hesaplarıyla kayıt ve giriş. Feed sayfasında takip edilen kullanıcıların paylaşımları. Infinite scroll ile performanslı içerik yükleme.\n\nKullanıcı profilleri: Kişisel bilgiler, paylaşımlar, beğeniler. Beğeni ve yorum mekanizması. Takip sistemi.\n\nHikayeler: 24 saatlik geçici içerik paylaşımı. Push bildirimleri: beğeni, yorum, takip uyarıları.\n\nFirebase backend ile gerçek zamanlı veri senkronizasyonu. Görsel ve video optimizasyonu. Güvenlik ve içerik moderasyonu.",
    "budget": 95000,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Haber Okuma Uygulaması",
    "description": "Dijital haber platformunun mobil deneyimini oluşturmak için Flutter tabanlı uygulama. Kullanıcıların güncel haberleri kolayca okuyabilmesi hedefleniyor.\n\nİçerik organizasyonu: Kategori bazlı haber gösterimi, kullanıcıların ilgi alanlarına göre içerik filtreleme. Haber detay sayfalarında görsel, video ve galeri desteği.\n\nKişiselleştirme: Favoriler özelliğiyle haber kaydetme. Offline okuma modu - internet bağlantısı olmadan kaydedilen haberler.\n\nBildirimler: Önemli haberler için push bildirimleri. Arama fonksiyonu. Sosyal medya paylaşım entegrasyonu.\n\nKullanıcı deneyimi: Dark mode desteğiyle gece okuma. Performans optimizasyonu. RSS feed entegrasyonu.",
    "budget": 45000,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Müzik Çalar Uygulaması",
    "description": "Müzik dinleme deneyimini mobil platforma taşıyan uygulama. Kullanıcıların müzik koleksiyonlarını yönetmesi ve dinlemesi için native iOS (Swift) ve Android (Kotlin) geliştirme.\n\nÇalma listesi yönetimi: Oynatma listeleri oluşturma, düzenleme ve silme. Kütüphane içi şarkı arama.\n\nKişiselleştirme: Favoriler özelliği. Offline çalma - indirilen şarkılar internet olmadan dinlenebilir.\n\nArka plan çalma: Uygulama kapalıyken müzik devam eder. Bildirim kontrolü.\n\nKütüphane organizasyonu: Şarkılar, albümler, sanatçılar. Ses kalitesi optimizasyonu. Görsel açıdan zengin arayüz ve akıcı animasyonlar. Equalizer özelliği eklenebilir.",
    "budget": 55000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Taksi/Ulaşım Uygulaması",
    "description": "Ulaşım platformu için çift taraflı uygulama ekosistemi: yolcu ve sürücü uygulamaları. Yolcuların araç çağırması ve sürücülerin yolcu bulması için React Native veya Flutter kullanılacak.\n\nYolcu uygulaması:\n1. Konum seçimi ve araç tipi seçimi (ekonomi, konfor, lüks)\n2. Fiyat tahmini\n3. Google Maps entegrasyonu: rota çizimi ve sürücü takibi\n4. Ödeme: nakit veya kredi kartı\n5. Değerlendirme sistemi\n\nSürücü uygulaması:\n- Sipariş kabul/reddetme\n- Navigasyon\n- Kazanç takibi\n- Canlı konum paylaşımı\n\nGüvenlik: Kullanıcı doğrulama, acil durum butonu, şoför bilgileri. WebSocket ile gerçek zamanlı konum takibi. Push bildirimleri.",
    "budget": 110000,
    "deadline": "2025-05-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Not Alma Uygulaması",
    "description": "Kişisel verimliliği artırmak için not yönetim uygulaması. Kullanıcıların notlarını organize etmesi ve erişmesi için React Native veya Flutter ile geliştirilecek.\n\nNot yönetimi: Zengin metin editörü (kalın, italik, liste, bağlantı). Kategori ve etiket sistemiyle organizasyon. Hızlı arama.\n\nSenkronizasyon: Bulut üzerinde otomatik senkronizasyon. Offline mod: internet olmadan not oluşturma, sonra senkronizasyon.\n\nWidget desteği: Ana ekrandan hızlı erişim. Markdown desteği. Görsel ekleme: notlara fotoğraf ekleme.\n\nBasit ve kullanıcı dostu arayüz. Performans: hızlı yükleme ve kaydetme.",
    "budget": 30000,
    "deadline": "2025-02-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "QR Kod Okuyucu ve Oluşturucu",
    "description": "QR kod işlemleri için kapsamlı mobil uygulama. Hem okuma hem de oluşturma özelliklerine sahip. Native iOS (Swift) ve Android (Kotlin) geliştirme.\n\nQR kod okuma: Kamera kullanarak okuma. Desteklenen türler: URL, metin, WiFi bilgileri, vCard, e-posta, SMS, telefon numarası.\n\nQR kod oluşturma: Kullanıcıların kendi QR kodlarını oluşturması. Özelleştirme: renk, logo ekleme, boyut ayarlama.\n\nGeçmiş: Okunan ve oluşturulan QR kodların kaydı. Paylaşım özelliği.\n\nKamera izinleri ve kullanımı optimizasyonu. Hızlı ve doğru okuma. Modern arayüz. Toplu QR kod oluşturma özelliği eklenebilir.",
    "budget": 20000,
    "deadline": "2025-02-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Hava Durumu Uygulaması",
    "description": "Detaylı ve güvenilir hava durumu bilgisi sunan modern mobil uygulama. OpenWeatherMap veya WeatherAPI entegrasyonu.\n\nKonum yönetimi: GPS ile otomatik konum tespiti. Anlık hava durumu: sıcaklık, nem, rüzgar hızı, görünürlük. 7 günlük tahmin. Saatlik tahmin.\n\nWidget desteği: Ana ekrandan hızlı erişim. Bildirimler: hava durumu uyarıları (yağmur, kar, fırtına).\n\nÇoklu konum: Birden fazla şehir takibi. Harita görünümü: geniş alan hava durumu görselleştirmesi.\n\nModern ve görsel açıdan zengin tasarım. Animasyonlarla hava durumu görselleştirmesi.",
    "budget": 25000,
    "deadline": "2025-02-20T00:00:00.000Z",
    "status": "open"
  }
]
