[
  {
    "title": "Sosyal Bağlantı ve Etkinlik Uygulaması",
    "description": "<p>Şehrindeki insanları ortak ilgi alanlarına göre bir araya getiren, 'Meetup' benzeri ama daha yerel dinamiklere odaklanan bir sosyal mobil uygulama geliştirmek istiyoruz. Projenin Flutter veya React Native ile yazılarak hem iOS hem de Android marketlerine tek kod tabanından çıkılmasını hedefliyoruz.</p><p><strong>Uygulamanın temel özellikleri:</strong></p><ul><li><strong>Konum Bazlı Keşif:</strong> Kullanıcı uygulamayı açtığında, GPS verisini kullanarak etrafındaki 5-10 km çapındaki aktif etkinlikleri harita üzerinde pin'lenmiş şekilde görmelidir.</li><li><strong>Grup Sohbetleri:</strong> Bir etkinliğe katılan kullanıcılar, etkinlik saatine kadar kendi aralarında konuşabilecekleri geçici bir grup sohbetine (Socket.io veya Firebase) otomatik dahil edilmelidir.</li><li><strong>Profil ve İlgi Alanları:</strong> Kullanıcılar spor, sanat, teknoloji gibi etiketleri seçebilmeli ve algoritma bu ilgi alanlarına göre 'Sana Göre' akışını özelleştirmelidir.</li><li><strong>QR Biletleme:</strong> Etkinlik oluşturucusu, katılımcıların girişini kontrol etmek için uygulama içinden üretilen QR kodu tarayabilmelidir.</li><li><strong>Moderasyon:</strong> Kullanıcıların oluşturduğu içerikler ve görseller, yapay zeka destekli bir API veya manuel panel üzerinden onaylandıktan sonra yayınlanmalıdır.</li></ul><p>Uygulamanın arayüzü modern, akıcı animasyonlara sahip (60fps) ve 'Dark Mode' destekli olmalıdır.</p>",
    "budget": 8500,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Kişisel Finans Yönetim Uygulaması",
    "description": "<p>İnsanların ay sonunu getirmekte zorlandığı bu dönemde, harcamalarını kuruşu kuruşuna takip edebilecekleri, kullanıcı dostu bir 'Bütçe Planlayıcı' uygulaması yaptırmak istiyoruz.</p><p><strong>Teknik ve fonksiyonel gereksinimler:</strong></p><ul><li><strong>Hızlı Veri Girişi:</strong> Harcama ekleme ekranı çok pratik olmalı; tutar, kategori ve tarih seçimi maksimum 3 saniyede tamamlanabilmelidir.</li><li><strong>Görsel Raporlama:</strong> Ay sonunda 'Nereye ne kadar harcadım?' sorusunu cevaplayan, kütüphane bağımlılığı az, performanslı Pasta ve Çubuk grafikler çizdirilmelidir.</li><li><strong>Güvenlik:</strong> Finansal veriler hassas olduğu için, uygulama açılışında FaceID/TouchID veya parmak izi okuma zorunluluğu getirilmelidir.</li><li><strong>Veri Yedekleme:</strong> Kullanıcı telefonunu değiştirse bile verilerinin kaybolmaması için Google Drive veya iCloud üzerine otomatik yedekleme (Cloud Kit) entegrasyonu yapılmalıdır.</li><li><strong>Çevrimdışı Mod:</strong> İnternet olmasa bile uygulama tam fonksiyon çalışmalı, bağlantı geldiğinde verileri senkronize etmelidir (Local-first architecture).</li></ul><p>Excel'e veri dışa aktarma (Export CSV/XLS) özelliği de premium kullanıcılara sunulacak şekilde kurgulanmalıdır.</p>",
    "budget": 6500,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Seyahat Planlama ve Rehber Uygulaması",
    "description": "<p>Sırt çantalı gezginler için, gidecekleri rotayı adım adım planlayabilecekleri ve internetin çekmediği yerlerde bile kullanabilecekleri bir seyahat asistanı uygulaması tasarlıyoruz.</p><p><strong>Öne çıkan özellikler:</strong></p><ul><li><strong>Rota Optimizasyonu:</strong> Kullanıcı gezmek istediği 5 müzeyi seçtiğinde, Google Maps API kullanılarak en kısa ve verimli yürüyüş rotasını çizen bir algoritma kurulmalıdır.</li><li><strong>Offline Haritalar:</strong> Şehir verileri ve harita katmanları (Mapbox SDK tercih edilebilir) telefona indirilerek, roaming ücreti ödemeden navigasyon sağlanmalıdır.</li><li><strong>Bütçe Hesaplayıcı:</strong> Gidilecek ülkenin para birimi ile kullanıcının ana para birimi arasındaki kur farkını anlık çekerek (Forex API) tahmini gezi maliyetini hesaplamalıdır.</li><li><strong>Seyahat Günlüğü:</strong> Gezi sırasında çekilen fotoğraflar ve konum bilgileri birleştirilerek otomatik bir zaman tüneli (Timeline) oluşturulmalıdır.</li><li><strong>Sosyal Paylaşım:</strong> Hazırlanan rotalar, 'Bu rotayı arkadaşınla paylaş' butonuyla deep-link üzerinden diğer kullanıcılara gönderilebilmelidir.</li></ul><p>Uygulamanın pil tüketimini minimize edecek şekilde konum servislerinin optimize edilmesi kritik önem taşımaktadır.</p>",
    "budget": 5800,
    "deadline": "2025-03-28T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sağlık ve Wellness Takip Uygulaması",
    "description": "<p>Kullanıcıların sağlıklı yaşam hedeflerine ulaşmasına yardımcı olacak, Apple Health (HealthKit) ve Google Fit ile tam entegre çalışan kapsamlı bir wellness platformu geliştiriyoruz.</p><p><strong>Proje detayları:</strong></p><ul><li><strong>Veri Senkronizasyonu:</strong> Telefonun kendi sensörlerinden veya akıllı saatten gelen adım, nabız ve uyku verilerini arka planda okuyup kendi veritabanımıza işleyen servisler yazılmalıdır.</li><li><strong>Su Takibi ve Hatırlatıcı:</strong> Kullanıcının kilosuna göre günlük su ihtiyacını hesaplayan ve gün içinde akıllı bildirimlerle (Local Notifications) su içmeyi hatırlatan bir modül eklenmelidir.</li><li><strong>Meditasyon Oynatıcı:</strong> Sunucudan çekilen ses dosyalarını arka planda çalabilen, ekran kapalıyken bile durmayan bir medya oynatıcı (Audio Player) entegre edilmelidir.</li><li><strong>Gamification (Oyunlaştırma):</strong> Kullanıcı hedeflerine ulaştıkça (örneğin 10.000 adım attığında) ekranda konfetilerin patladığı ve rozet kazandığı motive edici animasyonlar tasarlanmalıdır.</li><li><strong>Kişisel Hedefler:</strong> Kullanıcı 'Kilo Vermek' veya 'Kas Yapmak' hedefini seçtiğinde, ona uygun günlük görev listesi dinamik olarak oluşturulmalıdır.</li></ul><p>Verilerin güvenliği ve KVKK uyumluluğu konusunda hassas davranılmalı, gereksiz izin taleplerinden kaçınılmalıdır.</p>",
    "budget": 7200,
    "deadline": "2025-04-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Dil Öğrenme ve Pratik Uygulaması",
    "description": "<p>Kelime ezberlemeyi sıkıcı olmaktan çıkarıp eğlenceli bir oyuna dönüştüren, Duolingo tarzı interaktif bir dil öğrenme uygulaması yaptırmak istiyoruz. İçerik yönetimini admin panelinden yapacağımız dinamik bir yapıya ihtiyacımız var.</p><p><strong>Uygulama modülleri:</strong></p><ul><li><strong>Flashcard Sistemi:</strong> Kelimenin bir yüzünde İngilizcesi, diğer yüzünde Türkçesi ve görseli olan, sağa-sola kaydırmalı (Tinder-like swipe) bir ezber modülü geliştirilmelidir.</li><li><strong>Telaffuz Kontrolü:</strong> Kullanıcının mikrofona okuduğu cümleyi 'Speech-to-Text' API'leri ile analiz edip, telaffuz doğruluğuna göre puan veren bir yapay zeka entegrasyonu yapılmalıdır.</li><li><strong>Spaced Repetition:</strong> Kullanıcının unuttuğu kelimeleri tespit edip, belirli algoritmalarla (SuperMemo vb.) tekrar karşısına çıkaran akıllı bir tekrar sistemi kurulmalıdır.</li><li><strong>Liderlik Tablosu:</strong> Haftalık kazanılan XP puanlarına göre arkadaş listesindeki sıralamayı gösteren rekabetçi bir leaderboard hazırlanmalıdır.</li><li><strong>Çevrimdışı İçerik:</strong> Ders paketleri (ses ve görseller) wi-fi bağlantısında indirilip, metroda veya uçakta internet yokken de çalışılabilmelidir.</li></ul><p>Ses dosyalarının boyutu yüksek olacağı için, CDN kullanımı ve dosya sıkıştırma teknikleri konusunda deneyimli olunması gerekmektedir.</p>",
    "budget": 8900,
    "deadline": "2025-05-01T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Yerel İşletme Keşif ve Rezervasyon Uygulaması",
    "description": "<p>Şehrin gizli kalmış lezzet duraklarını, butik kafelerini ve kuaförlerini listeleyen, aynı zamanda uygulama üzerinden rezervasyon alınmasını sağlayan bir pazar yeri uygulamasıdır.</p><p><strong>İstenen fonksiyonlar:</strong></p><ul><li><strong>Gelişmiş Filtreleme:</strong> Kullanıcılar 'Bahçesi var mı?', 'Wi-Fi var mı?', 'Evcil hayvan dostu mu?' gibi kriterlere göre işletmeleri süzebilmelidir.</li><li><strong>Rezervasyon Takvimi:</strong> İşletmenin müsait saatlerini gösteren ve kullanıcının seçim yapıp anında onay alabildiği bir rezervasyon akışı kodlanmalıdır.</li><li><strong>Yorum ve Puanlama:</strong> Sadece işletmeye gerçekten gitmiş (konum doğrulaması veya QR kod ile) kullanıcıların yorum yapabileceği sahte yorum karşıtı bir yapı kurulmalıdır.</li><li><strong>Push Bildirimleri:</strong> Kullanıcı favori mekanının yakınından geçerken, o mekana özel anlık indirim bildirimini (Geofencing) alabilmelidir.</li><li><strong>İşletme Profili:</strong> Mekan sahiplerinin kendi fotoğraflarını yükleyip menülerini güncelleyebilecekleri basit bir 'Business' modu da uygulamaya dahil edilmelidir.</li></ul><p>Harita üzerinde binlerce pin olacağı için 'Map Clustering' (kümeleme) performansının çok iyi optimize edilmesi gerekmektedir.</p>",
    "budget": 5500,
    "deadline": "2025-03-22T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Müzik Keşif ve Çalma Listesi Uygulaması",
    "description": "<p>Bağımsız (Indie) müzisyenlerin parçalarını yükleyebileceği, dinleyicilerin ise reklamsız ve özgürce müzik keşfedebileceği bir streaming uygulaması hayal ediyoruz. Spotify veya SoundCloud API'lerini kullanmak yerine kendi sunucumuzdan yayın yapacağız.</p><p><strong>Teknik zorluklar ve gereksinimler:</strong></p><ul><li><strong>Arka Plan Oynatma:</strong> Uygulama aşağı indirilse veya ekran kilitlense bile müziğin kesilmeden devam etmesi (Background Audio Service) ve kilit ekranı kontrollerinin çalışması şarttır.</li><li><strong>Önbellekleme (Caching):</strong> Çalınan şarkının bir sonraki sefer internet harcamaması için cihaza şifreli olarak önbelleklenmesi (LRU Cache mantığıyla) sağlanmalıdır.</li><li><strong>Playlist Yönetimi:</strong> Kullanıcıların kendi listelerini oluşturması, sürükle-bırak ile şarkı sırasını değiştirmesi ve listeyi arkadaşlarıyla paylaşması gerekmektedir.</li><li><strong>Akıllı Öneri:</strong> Dinlenen türlere göre 'Haftalık Keşif' listesi oluşturan basit bir öneri algoritması (backend destekli) entegre edilmelidir.</li><li><strong>Ses Kalitesi Ayarı:</strong> Bağlantı hızına göre (Wi-Fi vs Mobil Veri) ses kalitesini (128kbps / 320kbps) otomatik ayarlayan adaptif bir yapı düşünülmelidir.</li></ul><p>Müzik lisans hakları ve dosya güvenliği (DRM benzeri koruma) proje için kritik öneme sahiptir.</p>",
    "budget": 7800,
    "deadline": "2025-04-18T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Ebeveyn Kontrolü ve Çocuk Güvenliği Uygulaması",
    "description": "<p>Ebeveynlerin, çocuklarının dijital güvenliğini sağlaması ve ekran sürelerini yönetmesi için Android ve iOS platformlarında (izinlerin elverdiği ölçüde) çalışan bir güvenlik uygulaması geliştiriyoruz.</p><p><strong>Kritik özellikler:</strong></p><ul><li><strong>Ekran Süresi Takibi:</strong> Çocuğun hangi uygulamada ne kadar vakit geçirdiğini raporlayan ve günlük limit dolunca uyarı veren (veya Android'de uygulamayı bloklayan) bir servis yazılmalıdır.</li><li><strong>Konum Takibi (Geofence):</strong> Çocuk belirlenen güvenli alanın (Ev, Okul) dışına çıktığında ebeveynin telefonuna anında 'Güvenli alandan çıktı' bildirimi gitmelidir.</li><li><strong>SOS Butonu:</strong> Çocuğun tek tuşla ebeveyne acil durum sinyali ve o anki konumunu gönderebileceği, kilit ekranında bile çalışabilen bir widget eklenmelidir.</li><li><strong>İçerik Filtreleme:</strong> Zararlı web sitelerine girişi engellemek için yerel bir VPN profili veya DNS filtreleme yöntemi kullanılmalıdır.</li><li><strong>Uygulama Yönetimi:</strong> Ebeveynin kendi telefonundan, çocuğun telefonundaki oyunları uzaktan kilitleyebileceği (Remote Command) bir admin paneli olmalıdır.</li></ul><p>Bu proje, işletim sistemlerinin (özellikle iOS) kısıtlamalarını çok iyi bilen ve 'Device Admin' / 'Screen Time API' konularına hakim uzmanlar gerektirir.</p>",
    "budget": 9200,
    "deadline": "2025-04-08T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Alışveriş Listesi ve Fiyat Karşılaştırma Uygulaması",
    "description": "<p>Market alışverişine çıkarken kağıt kalem kullanma devrini bitiren, aile bireylerinin ortak yönetebileceği senkronize bir alışveriş listesi uygulamasıdır.</p><p><strong>Fonksiyonel detaylar:</strong></p><ul><li><strong>Gerçek Zamanlı Senkronizasyon:</strong> Evdeki kişi listeye 'Süt' eklediğinde, marketteki kişinin telefonunda anında belirmesi (Firebase Realtime DB veya Socket) gerekmektedir.</li><li><strong>Barkod Okuyucu:</strong> Ürünün barkodu kamerayla taratıldığında, sistemdeki veritabanından ürünün adını ve ortalama fiyatını getirip listeye eklemelidir.</li><li><strong>Fiyat Karşılaştırma:</strong> Kullanıcılar bir ürünün fiyatını girdiğinde, diğer marketlerdeki fiyatlarla (kullanıcı bazlı veri) karşılaştırma yapabilmelidir.</li><li><strong>Akıllı Kategorizasyon:</strong> 'Domates' yazıldığında otomatik olarak 'Manav' kategorisine, 'Deterjan' yazıldığında 'Temizlik' kategorisine atanmalıdır.</li><li><strong>Birim Hesaplama:</strong> Farklı gramajlardaki ürünlerin birim fiyatını (TL/kg) hesaplayarak hangisinin daha ekonomik olduğunu gösteren mini bir araç eklenmelidir.</li></ul><p>Basit, reklamsız ve çok hızlı çalışan, yaşlı kullanıcıların da rahatça kullanabileceği büyük fontlu bir arayüz hedeflenmektedir.</p>",
    "budget": 3800,
    "deadline": "2025-03-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Spor Takımı ve Antrenman Yönetim Uygulaması",
    "description": "<p>Amatör futbol, basketbol veya voleybol takımlarının antrenörleri için; kadro kurmayı, maç takvimini yönetmeyi ve oyuncu istatistiklerini tutmayı sağlayan dijital bir asistan uygulamasıdır.</p><p><strong>Uygulama kapsamı:</strong></p><ul><li><strong>Yoklama Sistemi:</strong> Antrenman saatinde antrenörün oyuncu listesini açıp 'Geldi', 'Gelmedi', 'Sakat' şeklinde hızlıca yoklama alabileceği bir ekran tasarlanmalıdır.</li><li><strong>Taktik Tahtası:</strong> Antrenörün ekrana çizim yaparak oyunculara taktik anlatabileceği, oyuncuların pozisyonlarını sürükle-bırak ile değiştirebileceği interaktif bir tahta (Canvas) olmalıdır.</li><li><strong>Aidat Takibi:</strong> Takım giderleri ve oyuncu aidatlarının kimden ne zaman alındığını takip eden, ödemeyenlere otomatik hatırlatma bildirimi atan basit bir finans modülü eklenmelidir.</li><li><strong>Maç İstatistikleri:</strong> Maç sırasında veya sonrasında 'Gol', 'Asist', 'Sarı Kart' gibi verilerin girilerek sezonluk oyuncu karnesinin oluşturulması sağlanmalıdır.</li><li><strong>İletişim:</strong> Maç saati değişikliği veya iptal durumlarında tüm takıma tek tıkla SMS veya Bildirim gönderme özelliği bulunmalıdır.</li></ul><p>Uygulama içi satın alma (In-App Purchase) ile premium özelliklerin (sınırsız oyuncu ekleme vb.) satışı kurgulanacaktır.</p>",
    "budget": 6000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  }
]