[
  {
    "title": "iOS ve Android E-ticaret Uygulaması",
    "description": "E-ticaret platformumuzun mobil deneyimini geliştirmek istiyoruz. Web sitemizin tüm fonksiyonlarını mobil platforma taşıyacak kapsamlı bir çözüm arıyoruz. Cross-platform geliştirme için React Native veya Flutter teknolojileri değerlendirilebilir. Ürün listeleme, detay sayfaları, arama ve filtreleme özellikleri olmalı. Kullanıcı dostu sepet yönetimi ve ödeme akışı tasarlanmalı. Güvenli ödeme için iyzico SDK entegrasyonu yapılmalı. Sipariş takip sistemiyle kullanıcılar sipariş durumunu izleyebilmeli. Push bildirimleri eklenmeli - sipariş durumu, kampanyalar, yeni ürün duyuruları için. Hesap yönetimi kısmında profil düzenleme, adres yönetimi, sipariş geçmişi görüntüleme olmalı. Favoriler özelliğiyle ürün kaydetme imkanı sunulmalı. Mevcut backend API ile entegrasyon yapılmalı. App Store ve Google Play Store'a yayınlama süreçleri tamamlanmalı. Performans optimizasyonu ve crash-free deneyim sağlanmalı.",
    "budget": 75000,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Fitness Takip Uygulaması",
    "description": "Spor ve fitness tutkunlarının hedeflerine ulaşmasına yardımcı olacak kapsamlı bir takip uygulaması geliştirmek istiyoruz. Kullanıcıların antrenman ve beslenme süreçlerini yönetebileceği entegre bir platform arıyoruz. Egzersiz modülünde hazır programlar ve kişiselleştirilmiş program oluşturma özellikleri olmalı. Her egzersiz için video rehber, açıklama ve set/tekrar bilgileri eklenmeli. İlerleme analizi kısmında kilo, vücut ölçüleri, fotoğraf kayıtları tutulabilmeli. Görsel grafiklerle ilerleme takibi yapılabilmeli. Beslenme günlüğü ve kalori hesaplama özellikleri olmalı. İstatistikler bölümünde toplam antrenman sayısı, yakılan kalori, hedef tamamlama yüzdesi gösterilmeli. Sosyal özellikler eklenmeli - arkadaş ekleme, başarı paylaşımı gibi. Apple Health ve Google Fit ile veri senkronizasyonu yapılabilmeli. Push bildirimleriyle antrenman hatırlatmaları gönderilmeli. Offline mod desteği de olmalı.",
    "budget": 65000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Yemek Sipariş Uygulaması",
    "description": "Yemek sipariş ekosistemimiz için iki ayrı uygulama geliştirmek istiyoruz: kullanıcı ve restoran uygulamaları. Restoranların menülerini sunması ve kullanıcıların sipariş vermesi için tasarlanacak. Kullanıcı uygulamasında kategori bazlı menü gösterimi ve arama özelliği olmalı. Akıcı sepet yönetimi ve checkout süreci tasarlanmalı. Güvenli ödeme entegrasyonu yapılmalı. Gerçek zamanlı sipariş takibi sağlanmalı. Google Maps ile kurye konum takibi yapılabilmeli. Restoran uygulamasında sipariş yönetim paneli olmalı. Menü güncelleme araçları eklenmeli. Çalışma saatleri yapılandırması yapılabilmeli. Push bildirimleriyle yeni sipariş uyarıları gönderilmeli. Değerlendirme sistemi olmalı - rating ve yorum özellikleri. Firebase backend altyapısı kullanılabilir.",
    "budget": 80000,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sosyal Medya Uygulaması",
    "description": "Fotoğraf ve video paylaşımına odaklanan sosyal medya platformu geliştirmek istiyoruz. Kullanıcıların içerik oluşturması ve etkileşim kurması için tasarlanacak. Kimlik doğrulama kısmında e-posta, telefon veya sosyal medya hesaplarıyla kayıt ve giriş yapılabilmeli. Feed sayfasında takip edilen kullanıcıların paylaşımları gösterilmeli. Infinite scroll ile performanslı içerik yükleme sağlanmalı. Kullanıcı profillerinde kişisel bilgiler, paylaşımlar, beğeniler görüntülenebilmeli. Beğeni ve yorum mekanizması kurulmalı. Takip sistemi eklenmeli. Hikayeler özelliği olmalı - 24 saatlik geçici içerik paylaşımı. Push bildirimleri eklenmeli - beğeni, yorum, takip uyarıları için. Firebase backend ile gerçek zamanlı veri senkronizasyonu yapılmalı. Görsel ve video optimizasyonu yapılmalı. Güvenlik ve içerik moderasyonu sağlanmalı.",
    "budget": 95000,
    "deadline": "2025-05-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Haber Okuma Uygulaması",
    "description": "Dijital haber platformumuzun mobil deneyimini oluşturmak için Flutter tabanlı uygulama geliştirmek istiyoruz. Kullanıcıların güncel haberleri kolayca okuyabilmesi hedefleniyor. İçerik organizasyonu kısmında kategori bazlı haber gösterimi, kullanıcıların ilgi alanlarına göre içerik filtreleme özellikleri olmalı. Haber detay sayfalarında görsel, video ve galeri desteği bulunmalı. Kişiselleştirme için favoriler özelliğiyle haber kaydetme imkanı sunulmalı. Offline okuma modu eklenmeli - internet bağlantısı olmadan kaydedilen haberler okunabilmeli. Önemli haberler için push bildirimleri gönderilmeli. Arama fonksiyonu olmalı. Sosyal medya paylaşım entegrasyonu yapılmalı. Kullanıcı deneyimi açısından dark mode desteğiyle gece okuma imkanı sunulmalı. Performans optimizasyonu yapılmalı. RSS feed entegrasyonu da eklenebilir.",
    "budget": 45000,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Müzik Çalar Uygulaması",
    "description": "Müzik dinleme deneyimini mobil platforma taşıyan uygulama geliştirmek istiyoruz. Kullanıcıların müzik koleksiyonlarını yönetmesi ve dinlemesi için native iOS (Swift) ve Android (Kotlin) geliştirme yapılacak. Çalma listesi yönetimi kısmında oynatma listeleri oluşturma, düzenleme ve silme özellikleri olmalı. Kütüphane içi şarkı arama yapılabilmeli. Kişiselleştirme için favoriler özelliği eklenmeli. Offline çalma özelliği olmalı - indirilen şarkılar internet olmadan dinlenebilmeli. Arka plan çalma desteği eklenmeli - uygulama kapalıyken müzik devam etmeli. Bildirim kontrolü yapılabilmeli. Kütüphane organizasyonu kısmında şarkılar, albümler, sanatçılar görüntülenebilmeli. Ses kalitesi optimizasyonu yapılmalı. Görsel açıdan zengin arayüz ve akıcı animasyonlar olmalı. Equalizer özelliği eklenebilir.",
    "budget": 55000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Taksi/Ulaşım Uygulaması",
    "description": "Ulaşım platformumuz için çift taraflı uygulama ekosistemi geliştirmek istiyoruz: yolcu ve sürücü uygulamaları. Yolcuların araç çağırması ve sürücülerin yolcu bulması için React Native veya Flutter kullanılacak. Yolcu uygulamasında konum seçimi ve araç tipi seçimi (ekonomi, konfor, lüks) yapılabilmeli. Fiyat tahmini gösterilmeli. Google Maps entegrasyonuyla rota çizimi ve sürücü takibi yapılabilmeli. Ödeme kısmında nakit veya kredi kartı seçenekleri olmalı. Değerlendirme sistemi eklenmeli. Sürücü uygulamasında sipariş kabul/reddetme özelliği olmalı. Navigasyon desteği eklenmeli. Kazanç takibi yapılabilmeli. Canlı konum paylaşımı sağlanmalı. Güvenlik açısından kullanıcı doğrulama, acil durum butonu, şoför bilgileri gösterilmeli. WebSocket ile gerçek zamanlı konum takibi yapılmalı. Push bildirimleri eklenmeli.",
    "budget": 110000,
    "deadline": "2025-05-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Not Alma Uygulaması",
    "description": "Kişisel verimliliği artırmak için not yönetim uygulaması geliştirmek istiyoruz. Kullanıcıların notlarını organize etmesi ve erişmesi için React Native veya Flutter ile çalışılacak. Not yönetimi kısmında zengin metin editörü olmalı - kalın, italik, liste, bağlantı gibi özellikler. Kategori ve etiket sistemiyle organizasyon yapılabilmeli. Hızlı arama özelliği eklenmeli. Senkronizasyon için bulut üzerinde otomatik senkronizasyon sağlanmalı. Offline mod desteği olmalı - internet olmadan not oluşturma, sonra senkronizasyon yapılabilmeli. Widget desteği eklenmeli - ana ekrandan hızlı erişim için. Markdown desteği olmalı. Görsel ekleme özelliği eklenmeli - notlara fotoğraf eklenebilmeli. Basit ve kullanıcı dostu arayüz tasarlanmalı. Performans açısından hızlı yükleme ve kaydetme sağlanmalı.",
    "budget": 30000,
    "deadline": "2025-02-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "QR Kod Okuyucu ve Oluşturucu",
    "description": "QR kod işlemleri için kapsamlı mobil uygulama geliştirmek istiyoruz. Hem okuma hem de oluşturma özelliklerine sahip olacak. Native iOS (Swift) ve Android (Kotlin) geliştirme yapılacak. QR kod okuma kısmında kamera kullanarak okuma yapılabilmeli. Desteklenen türler: URL, metin, WiFi bilgileri, vCard, e-posta, SMS, telefon numarası. QR kod oluşturma özelliği eklenmeli - kullanıcıların kendi QR kodlarını oluşturması sağlanmalı. Özelleştirme seçenekleri olmalı - renk, logo ekleme, boyut ayarlama gibi. Geçmiş özelliği eklenmeli - okunan ve oluşturulan QR kodların kaydı tutulmalı. Paylaşım özelliği olmalı. Kamera izinleri ve kullanımı optimizasyonu yapılmalı. Hızlı ve doğru okuma sağlanmalı. Modern arayüz tasarlanmalı. Toplu QR kod oluşturma özelliği eklenebilir.",
    "budget": 20000,
    "deadline": "2025-02-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Hava Durumu Uygulaması",
    "description": "Detaylı ve güvenilir hava durumu bilgisi sunan modern mobil uygulama geliştirmek istiyoruz. OpenWeatherMap veya WeatherAPI entegrasyonu yapılacak. Konum yönetimi kısmında GPS ile otomatik konum tespiti yapılabilmeli. Anlık hava durumu bilgileri gösterilmeli - sıcaklık, nem, rüzgar hızı, görünürlük. 7 günlük tahmin özelliği olmalı. Saatlik tahmin gösterilmeli. Widget desteği eklenmeli - ana ekrandan hızlı erişim için. Bildirimler özelliği olmalı - hava durumu uyarıları (yağmur, kar, fırtına) gönderilmeli. Çoklu konum desteği eklenmeli - birden fazla şehir takibi yapılabilmeli. Harita görünümü eklenmeli - geniş alan hava durumu görselleştirmesi. Modern ve görsel açıdan zengin tasarım olmalı. Animasyonlarla hava durumu görselleştirmesi yapılmalı.",
    "budget": 25000,
    "deadline": "2025-02-20T00:00:00.000Z",
    "status": "open"
  }
]
