[
  {
    "title": "Kurumsal Tasarım Sistemi ve Component Library",
    "description": "<p>Yazılım ekibimizin sürekli aynı butonları veya form elemanlarını baştan tasarlamasından kaynaklanan tutarsızlıkları gidermek için, ölçeklenebilir bir Tasarım Sistemi (Design System) kurmak istiyoruz. Figma üzerinde çalışılacak bu yapı, 'Atomik Tasarım' prensiplerine dayanmalıdır.</p><p><strong>Teslimat kapsamı:</strong></p><ul><li><strong>Token Yapısı:</strong> Renkler (Primary, Secondary, Neutral), Tipografi (H1-H6, Body), Spacing ve Gölgelendirme (Elevation) değerleri birer 'Style Token' olarak tanımlanmalıdır.</li><li><strong>Component Seti:</strong> Butonlar, Inputlar, Dropdownlar, Modal pencereler ve Kartlar gibi temel UI bileşenleri, tüm durumlarıyla (Default, Hover, Active, Disabled, Error) tasarlanmalıdır.</li><li><strong>Auto-Layout:</strong> Tüm bileşenler, içerik değiştiğinde veya ekran boyutu farklılaştığında bozulmayacak şekilde, Figma'nın 'Auto-Layout' özelliği kullanılarak responsive hazırlanmalıdır.</li><li><strong>Dokümantasyon:</strong> Her bileşenin nerede ve nasıl kullanılacağını anlatan, yazılımcılara rehberlik edecek bir kullanım kılavuzu (Guidelines) yazılmalıdır.</li><li><strong>İkon Seti:</strong> Projeye özel, tutarlı çizgi kalınlığına sahip, SVG formatında 50 parçalık bir ikon ailesi çizilmelidir.</li></ul><p>Tasarımın, geliştiricilerin React bileşenlerine dönüştürmesini kolaylaştıracak şekilde katmanlanması ve isimlendirilmesi şarttır.</p>",
    "budget": 7500,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "E-Ticaret Kullanıcı Deneyimi Optimizasyonu",
    "description": "<p>Mobilya sattığımız e-ticaret sitemizde sepeti terk etme oranları çok yüksek (%70). Kullanıcıların satın alma yolculuğundaki sürtünme noktalarını (Friction Points) tespit edip, ödeme sürecini (Checkout) pürüzsüz hale getirecek bir UX/UI iyileştirmesi istiyoruz.</p><p><strong>Beklenen çalışmalar:</strong></p><ul><li><strong>UX Audit:</strong> Mevcut sitenin heuristik analizi yapılarak, kullanıcıyı zorlayan veya kafa karıştıran tasarım hatalarının raporlanması gerekmektedir.</li><li><strong>Filtreleme Deneyimi:</strong> Kullanıcının binlerce ürün arasından aradığını kolayca bulmasını sağlayacak, mobilde de rahat kullanılan gelişmiş bir filtreleme ve sıralama arayüzü tasarlanmalıdır.</li><li><strong>Checkout Redesign:</strong> Üyeliksiz alışveriş (Guest Checkout) imkanı sunan, form alanlarının minimize edildiği ve ilerleme çubuğuyla kullanıcıyı motive eden 3 adımlı bir ödeme akışı çizilmelidir.</li><li><strong>Ürün Detay:</strong> Ürün varyasyonlarının (Renk/Kumaş) seçimini kolaylaştıran ve sosyal kanıtları (Yorumlar/Puanlar) öne çıkaran ikna edici bir sayfa yapısı kurgulanmalıdır.</li><li><strong>Mikro-Etkileşimler:</strong> 'Sepete Ekle' butonuna basıldığında veya favoriye alındığında kullanıcıya geri bildirim veren şık animasyonlar (Micro-interactions) eklenmelidir.</li></ul><p>Tasarım kararlarının, sadece estetik kaygılarla değil, e-ticaret dönüşüm optimizasyonu (CRO) best-practice'lerine dayalı olarak verilmesi önemlidir.</p>",
    "budget": 8500,
    "deadline": "2025-04-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Mobil Uygulama Kullanıcı Arayüzü Tasarımı",
    "description": "<p>Yeni geliştireceğimiz 'Meditasyon ve Uyku' uygulaması için, kullanıcıyı sakinleştiren, minimalist ve 'Zen' felsefesine uygun bir mobil arayüz tasarımı arıyoruz. Hem iOS (Human Interface Guidelines) hem de Android (Material 3) standartlarına uyum bekliyoruz.</p><p><strong>Tasarım detayları:</strong></p><ul><li><strong>Onboarding:</strong> Uygulamayı ilk kez açan kullanıcıya değer önerisini anlatan ve kişisel tercihlerini (Günde kaç dakika? Hedefin ne?) soran 3-4 ekranlık bir karşılama akışı tasarlanmalıdır.</li><li><strong>Ana Sayfa:</strong> İçeriklerin yatay kaydırılabilir kartlar ve dikey listeler halinde sunulduğu, görsel hiyerarşinin (Görsel > Başlık > Süre) doğru kurulduğu bir keşif ekranı çizilmelidir.</li><li><strong>Player Ekranı:</strong> Ses dosyasının çaldığı, arka planda hafif hareket eden (Ambient) bir görselin veya animasyonun olduğu, odaklanmayı bozmayan sade bir oynatıcı ekranı olmalıdır.</li><li><strong>Karanlık Mod:</strong> Uygulama genelde gece kullanılacağı için, göz yormayan, OLED ekranlarda pil tasarrufu sağlayan 'Dark Mode' renk paleti birincil tercih olmalıdır.</li><li><strong>Prototip:</strong> Ekranlar arası geçişlerin, buton etkileşimlerinin ve menü navigasyonunun test edilebileceği tıklanabilir (Clickable) bir prototip hazırlanmalıdır.</li></ul><p>Yazılımcıya teslim (Handoff) aşamasında Zeplin veya Figma Dev Mode uyumlu, tüm assetlerin export edildiği bir dosya düzeni istiyoruz.</p>",
    "budget": 6800,
    "deadline": "2025-04-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Dashboard ve Veri Görselleştirme Tasarımı",
    "description": "<p>Lojistik firmamızın filo yöneticileri için; araçların konumunu, yakıt durumunu ve sürücü performansını tek ekranda görebilecekleri, veri yoğunluklu (Data-Heavy) bir SaaS yönetim paneli tasarlatmak istiyoruz.</p><p><strong>Arayüz gereksinimleri:</strong></p><ul><li><strong>Bilgi Mimarisi:</strong> Yüzlerce veri noktasının olduğu ekranda, en kritik bilgilerin (Acil Uyarılar, Gecikmeler) öne çıktığı, kullanıcının bilişsel yükünü (Cognitive Load) azaltan bir yerleşim planı yapılmalıdır.</li><li><strong>Grafik Tasarımı:</strong> Verilerin anlaşılmasını kolaylaştıran, renk körleri için de erişilebilir (Colorblind-safe) renk paletlerine sahip çizgi, bar ve pasta grafikler tasarlanmalıdır.</li><li><strong>Harita Görünümü:</strong> Araçların harita üzerindeki hareketini, durumunu (Hareket halinde/Durdu) ve rotasını gösteren, üzerine gelince detay açılan (Tooltip) interaktif bir harita arayüzü çizilmelidir.</li><li><strong>Tablo Yönetimi:</strong> Kolonları özelleştirilebilen, satır içi düzenleme (Inline Edit) yapılabilen ve gelişmiş filtreleme seçenekleri sunan modern bir 'Data Grid' tasarımı gerekmektedir.</li><li><strong>Responsive Yapı:</strong> Yöneticiler sahada tablet kullanabildiği için, tasarımın masaüstü kadar tablet çözünürlüklerinde de (iPad Pro vb.) kusursuz görünmesi sağlanmalıdır.</li></ul><p>Temiz, kurumsal ve profesyonel bir görünüm (Enterprise UI) hedeflenmektedir.</p>",
    "budget": 7200,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Landing Page ve Conversion Rate Optimizasyonu",
    "description": "<p>Dijital pazarlama ajansımızın yeni hizmet paketi için, Google Ads trafiğini karşılayacak ve ziyaretçiyi forma yönlendirecek yüksek dönüşümlü (High-Converting) bir iniş sayfası tasarımına ihtiyacımız var.</p><p><strong>Sayfa bölümleri:</strong></p><ul><li><strong>Hero Section:</strong> Kullanıcının dikkatini ilk 3 saniyede çekecek güçlü bir başlık (H1), güven veren bir görsel ve kontrast rengiyle 'Hemen Teklif Al' butonu (CTA) tasarlanmalıdır.</li><li><strong>Sosyal Kanıt:</strong> Referans logoları, müşteri yorumları ve başarı istatistiklerinin (Örn: +500 Mutlu Müşteri) stratejik olarak yerleştirildiği güven artırıcı bölümler olmalıdır.</li><li><strong>Hizmet Kartları:</strong> Sunduğumuz çözümleri (SEO, SEM, Sosyal Medya) ikonlar ve kısa açıklamalarla anlatan, mobil uyumlu ızgara (Grid) yapısında bir alan çizilmelidir.</li><li><strong>Form Tasarımı:</strong> Kullanıcıyı korkutmayan, sadece gerekli bilgileri (Ad, Tel, Site) isteyen, görsel olarak ayrıştırılmış ve doldurması kolay bir form yapısı kurgulanmalıdır.</li><li><strong>A/B Test Varyasyonları:</strong> Hero alanındaki başlık ve görselin farklı olduğu 2 alternatif versiyon (Variant A/B) hazırlanarak teste uygun teslim edilmelidir.</li></ul><p>Tasarımda kullanılacak görsellerin stok sitelerinden seçilmesi ve lisanslarının tarafımıza ait olması gerekmektedir.</p>",
    "budget": 3500,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Kullanıcı Araştırması ve Persona Geliştirme",
    "description": "<p>Yeni başlayacağımız 'Evcil Hayvan Sahiplendirme' projesi öncesinde, hedef kitlemizi tanımak ve ürünümüzü doğru temeller üzerine inşa etmek için kapsamlı bir kullanıcı araştırması (UX Research) yaptırmak istiyoruz.</p><p><strong>Araştırma kapsamı:</strong></p><ul><li><strong>Kullanıcı Görüşmeleri:</strong> Potansiyel kullanıcılarla (Barınak gönüllüleri, evcil hayvan arayanlar) en az 10 adet derinlemesine mülakat (User Interview) yapılmalı ve içgörüler raporlanmalıdır.</li><li><strong>Persona Oluşturma:</strong> Toplanan veriler ışığında, hedef kitlemizi temsil eden 3 farklı kullanıcı personası (Örn: 'Öğrenci Ayşe', 'Emekli Mehmet Amca') detaylı profillerle oluşturulmalıdır.</li><li><strong>Empati Haritası:</strong> Kullanıcıların ne düşündüğünü, ne hissettiğini, ne duyduğunu ve ne yaptığını analiz eden 'Empathy Map' çalışmaları yapılmalıdır.</li><li><strong>Yolculuk Haritası (CJM):</strong> Bir kullanıcının sahiplendirme sürecindeki mevcut deneyimini, yaşadığı zorlukları (Pain Points) ve fırsat noktalarını gösteren görsel bir harita çizilmelidir.</li><li><strong>Rakip Analizi:</strong> Piyasadaki benzer uygulamaların (Petlebi, Sahibinden vb.) UX açısından güçlü ve zayıf yönlerini inceleyen bir benchmark raporu sunulmalıdır.</li></ul><p>Bu çalışma, görsel tasarım içermemekte olup tamamen stratejik analiz ve dokümantasyon odaklıdır.</p>",
    "budget": 5500,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Erişilebilirlik Odaklı Tasarım ve WCAG Uyumluluğu",
    "description": "<p>Mevcut haber sitemizin, görme engelli ve az gören kullanıcılar tarafından da rahatça kullanılabilmesi için bir 'Erişilebilirlik Dönüşümü' (Accessibility Audit & Redesign) projesi başlatıyoruz. Hedefimiz WCAG 2.1 AA standartlarını yakalamaktır.</p><p><strong>Yapılacak iyileştirmeler:</strong></p><ul><li><strong>Renk Kontrastı:</strong> Sitedeki tüm metin ve arka plan renkleri analiz edilmeli, okuma zorluğu yaratan düşük kontrastlı alanlar standartlara (en az 4.5:1) uygun renklerle revize edilmelidir.</li><li><strong>Odak Yönetimi:</strong> Klavye ile gezinen kullanıcılar için, hangi linkin veya butonun üzerinde olduğunu gösteren net ve belirgin 'Focus State' tasarımları yapılmalıdır.</li><li><strong>Tipografi:</strong> Yazı tiplerinin okunabilirliği artırılmalı, satır yükseklikleri ve harf aralıkları disleksik kullanıcılar da düşünülerek optimize edilmelidir.</li><li><strong>Form Etiketleri:</strong> Ekran okuyucuların (Screen Reader) formları doğru okuyabilmesi için gerekli görsel ipuçları ve hata mesajı tasarımları netleştirilmelidir.</li><li><strong>İkon ve Görsel Kullanımı:</strong> Sadece dekoratif olan ikonlar ile işlevi olan ikonlar görsel olarak ayrıştırılmalı, renk körleri için bilginin sadece renkle verilmemesi sağlanmalıdır.</li></ul><p>Tasarımcıdan, yazılımcıya iletilmek üzere 'Accessibility Annotation' içeren özel bir teslim dosyası beklenmektedir.</p>",
    "budget": 4200,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Marka Kimliği ve Görsel Dil Geliştirme",
    "description": "<p>Yapay zeka tabanlı yeni startup'ımız için, teknolojik, güven veren ve fütüristik bir marka kimliği (Brand Identity) oluşturulmasını istiyoruz. Sadece logo değil, markanın tüm dijital dünyada nasıl görüneceğini belirleyen bir görsel dil arayışındayız.</p><p><strong>Teslim edilecekler:</strong></p><ul><li><strong>Logo Tasarımı:</strong> Hem uygulamanın ikonunda (App Icon) hem de web sitesinde kullanılabilecek, ölçeklenebilir, modern ve akılda kalıcı bir logo ve logotype çalışması yapılmalıdır.</li><li><strong>Renk Paleti:</strong> Markanın ana renkleri ve tamamlayıcı renkleri, dijital ekranlar için (RGB/Hex) optimize edilmiş şekilde belirlenmeli ve kullanım oranları gösterilmelidir.</li><li><strong>Tipografi Sistemi:</strong> Başlıklar ve metinler için birbiriyle uyumlu, Türkçe karakter desteği olan ve web font olarak bulunabilen (Google Fonts vb.) yazı tipleri seçilmelidir.</li><li><strong>Görsel Stil:</strong> Markanın kullanacağı fotoğrafların tonu, illüstrasyonların tarzı veya ikonların çizgisel yapısını tanımlayan bir 'Moodboard' ve stil rehberi oluşturulmalıdır.</li><li><strong>Marka Kitapçığı:</strong> Logonun güvenli alanı, yanlış kullanımları ve kurumsal evrak tasarımlarını (Kartvizit, Antetli) içeren mini bir Brand Book PDF'i hazırlanmalıdır.</li></ul><p>Tasarımcının vektörel çizim yeteneğinin güçlü olması ve modern teknoloji trendlerini takip etmesi önemlidir.</p>",
    "budget": 5000,
    "deadline": "2025-04-08T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Prototipleme ve İnteraktif Tasarım",
    "description": "<p>Yatırımcı sunumunda kullanmak üzere, henüz kodlanmamış mobil uygulama fikrimizin sanki çalışıyormuş gibi hissettiren yüksek sadakatli (High-Fidelity) bir prototipine ihtiyacımız var.</p><p><strong>Prototip özellikleri:</strong></p><ul><li><strong>Akış Bağlantıları:</strong> Figma veya Protopie üzerinde, 20+ ekranın birbirine mantıklı bir şekilde bağlandığı, 'Geri' tuşlarının ve menülerin çalıştığı bir akış kurulmalıdır.</li><li><strong>Gelişmiş Animasyonlar:</strong> Sayfa geçişlerinde 'Smart Animate' kullanılarak, öğelerin yumuşakça yer değiştirdiği, kartların genişleyerek açıldığı profesyonel geçişler yapılmalıdır.</li><li><strong>Mikro Etkileşimler:</strong> Butona basınca çökme efekti, yükleniyor ikonunun dönmesi, başarılı işlemde çıkan konfeti gibi detaylar eklenerek gerçekçilik artırılmalıdır.</li><li><strong>Girdi Simülasyonu:</strong> Klavye açılma efekti, form alanına tıklandığında placeholder'ın yukarı kayması gibi input davranışları simüle edilmelidir.</li><li><strong>Sunum Modu:</strong> Prototip, bir telefon çerçevesi (Mockup) içinde çalışmalı ve yatırımcının kendi telefonunda linke tıklayarak deneyimleyebileceği şekilde paylaşılmalıdır.</li></ul><p>Tasarımın hazır olduğu varsayılmaktadır; görev sadece mevcut tasarımları canlandırmak ve etkileşimli hale getirmektir.</p>",
    "budget": 4800,
    "deadline": "2025-04-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sosyal Medya ve Dijital Pazarlama Tasarımları",
    "description": "<p>Kahve zincirimiz için Instagram, LinkedIn ve Twitter hesaplarımızda paylaşılmak üzere, marka kimliğimizle uyumlu, düzenlenebilir şablon setleri (Templates) tasarlatmak istiyoruz.</p><p><strong>Tasarım paketi:</strong></p><ul><li><strong>Instagram Post & Story:</strong> Ürün tanıtımı, özel gün kutlaması, alıntı paylaşımı ve duyuru gibi farklı içerik türleri için 10 adet Feed, 10 adet Story şablonu (Canva veya Figma).</li><li><strong>Reklam Görselleri:</strong> Facebook ve Google Display reklamlarında kullanılmak üzere, farklı boyutlarda (1080x1080, 1920x1080, 300x250) dönüşüm odaklı banner setleri.</li><li><strong>Kapak Görselleri:</strong> LinkedIn, Twitter ve YouTube kanallarımız için markanın sloganını ve güncel kampanyasını içeren uyumlu kapak (Cover) tasarımları.</li><li><strong>İkonografi:</strong> Instagram 'Öne Çıkanlar' (Highlights) kapakları için menü, konum, hakkımızda gibi kategorileri temsil eden özel ikon seti.</li><li><strong>Video Kapakları:</strong> Reels ve YouTube videoları için, videonun içeriğini anlatan ve tıklanma oranını (CTR) artıracak dikkat çekici küçük resim (Thumbnail) şablonları.</li></ul><p>Şablonların, tasarımcı olmayan ekibimiz tarafından Canva üzerinde kolayca fotoğraf ve metin değiştirilerek kullanılabilir olması şarttır.</p>",
    "budget": 2500,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  }
]