[
  {
    "title": "Kurumsal Tasarım Sistemi ve Component Library",
    "description": "Tutarlı kullanıcı deneyimi için kapsamlı bir tasarım sistemi ve component kütüphanesi oluşturuyoruz. Tasarım token'ları, renk paleti, tipografi ve spacing değerlerinin standartlaştırılmasını sağlıyor. Component library, buton, form elemanları, kartlar ve navigasyon bileşenlerinin tasarımını içeriyor. Style guide, tasarım prensipleri ve kullanım kurallarının dokümante edilmesini destekliyor. Responsive guidelines, farklı ekran boyutları için tasarım yaklaşımlarını tanımlıyor. Accessibility standards, WCAG uyumluluğu ve erişilebilirlik gereksinimlerini içeriyor. Icon system, tutarlı ikon seti ve kullanım kılavuzu sunuyor. Animation principles, geçiş animasyonları ve mikro etkileşimler için standartlar sağlıyor. Design tools integration, Figma, Sketch veya Adobe XD için component library entegrasyonu içeriyor. Documentation, tasarım kararlarının ve best practice'lerin paylaşılmasına izin veriyor. Version control, tasarım sisteminin versiyonlanması ve değişiklik yönetimi sunuyor.",
    "budget": 75000,
    "deadline": "2025-04-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "E-Ticaret Kullanıcı Deneyimi Optimizasyonu",
    "description": "Satış dönüşümlerini artırmak için e-ticaret platformunun kullanıcı deneyimi tasarımı ve optimizasyonu yapıyoruz. Kullanıcı araştırması, hedef kitle analizi ve kullanıcı ihtiyaçlarının belirlenmesini içeriyor. Information architecture, ürün kategorileri ve navigasyon yapısının optimize edilmesini sağlıyor. Product page design, ürün detay sayfalarının görsel hiyerarşisi ve bilgi organizasyonunu destekliyor. Checkout flow, ödeme sürecinin basitleştirilmesi ve adım sayısının minimize edilmesini içeriyor. Trust elements, güven göstergeleri ve sosyal kanıtların stratejik yerleştirilmesine izin veriyor. Mobile optimization, mobil alışveriş deneyiminin önceliklendirilmesi ve dokunmatik etkileşimler sunuyor. A/B testing, farklı tasarım varyantlarının test edilmesi ve veriye dayalı kararlar içeriyor. Performance optimization, görsel yükleme sürelerinin optimize edilmesi ve hızlı sayfa geçişleri destekliyor. Personalization, kullanıcı tercihlerine göre kişiselleştirilmiş deneyim önerileri sunuyor. Analytics integration, kullanıcı davranış metriklerinin izlenmesi ve tasarım iyileştirmeleri içeriyor.",
    "budget": 85000,
    "deadline": "2025-04-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Mobil Uygulama Kullanıcı Arayüzü Tasarımı",
    "description": "iOS ve Android platformları için modern ve kullanıcı dostu mobil uygulama arayüzü tasarlıyoruz. Platform guidelines, iOS Human Interface Guidelines ve Material Design prensiplerine uyum sağlıyor. Onboarding flow, yeni kullanıcılar için tanıtım ekranları ve kullanım rehberi içeriyor. Navigation patterns, bottom navigation, tab bar veya drawer menü gibi uygun navigasyon yapıları sunuyor. Gesture design, swipe, pinch ve long-press gibi dokunmatik etkileşimlerin tasarımını destekliyor. Micro-interactions, buton basma, geçiş animasyonları ve geri bildirim efektleri içeriyor. Dark mode support, karanlık tema tasarımı ve otomatik geçiş özellikleri sağlıyor. Accessibility, VoiceOver ve TalkBack desteği ile erişilebilirlik özellikleri içeriyor. Responsive layouts, farklı ekran boyutları ve cihaz yönelimlerine uyum sağlıyor. Prototyping, interaktif prototipler ve kullanıcı testleri için hazırlık içeriyor. Design handoff, geliştiricilere tasarım spesifikasyonları ve asset'lerin sağlanmasına izin veriyor.",
    "budget": 72000,
    "deadline": "2025-04-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Dashboard ve Veri Görselleştirme Tasarımı",
    "description": "Karmaşık verilerin anlaşılır şekilde sunulması için dashboard ve veri görselleştirme tasarımı oluşturuyoruz. Information hierarchy, önemli metriklerin vurgulanması ve görsel hiyerarşi oluşturulmasını sağlıyor. Chart design, grafik ve tablo tasarımlarının okunabilirliğini ve anlaşılırlığını destekliyor. Color coding, veri kategorilerinin renk kodlaması ile ayırt edilmesini içeriyor. Interactive elements, filtreleme, drill-down ve detay görüntüleme özelliklerinin tasarımına izin veriyor. Responsive dashboard, farklı ekran boyutlarında optimal görüntüleme sunuyor. Customization, kullanıcıların dashboard düzenini özelleştirmesine olanak veriyor. Real-time updates, canlı veri güncellemelerinin görsel gösterimi içeriyor. Export functionality, rapor ve grafiklerin dışa aktarılması için tasarım önerileri sunuyor. Accessibility, ekran okuyucular için uygun etiketleme ve kontrast oranları sağlıyor. User testing, dashboard kullanılabilirliğinin test edilmesi ve iyileştirmeler içeriyor.",
    "budget": 68000,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Landing Page ve Conversion Rate Optimizasyonu",
    "description": "Yüksek dönüşüm oranları hedefleyen etkili landing page tasarımı ve optimizasyonu yapıyoruz. Hero section, güçlü başlık, alt başlık ve CTA butonunun stratejik yerleştirilmesini sağlıyor. Value proposition, ürün veya hizmetin faydalarının net ve ikna edici sunumunu destekliyor. Social proof, müşteri yorumları, logo'lar ve başarı metriklerinin görselleştirilmesini içeriyor. Form design, minimum alan sayısı ile maksimum dönüşüm sağlayan form tasarımına izin veriyor. Visual storytelling, görsel hikaye anlatımı ve marka hikayesinin etkili sunumu sağlıyor. Trust indicators, güvenlik rozetleri, sertifikalar ve garanti bilgilerinin yerleştirilmesini destekliyor. Mobile-first approach, mobil cihazlarda optimal deneyim için önceliklendirme içeriyor. A/B testing variants, farklı tasarım varyantlarının test edilmesi için hazırlık sağlıyor. Performance optimization, hızlı yükleme süreleri için görsel optimizasyon önerileri sunuyor. Analytics setup, dönüşüm metriklerinin izlenmesi için tracking noktalarının belirlenmesini içeriyor.",
    "budget": 45000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Kullanıcı Araştırması ve Persona Geliştirme",
    "description": "Kullanıcı ihtiyaçlarının anlaşılması için kapsamlı kullanıcı araştırması ve persona geliştirme çalışması yapıyoruz. User interviews, hedef kullanıcılarla derinlemesine görüşmeler ve ihtiyaç analizi içeriyor. Survey design, kullanıcı tercihleri ve davranışlarının ölçülmesi için anket tasarımı sunuyor. Persona development, detaylı kullanıcı persona'larının oluşturulması ve dokümante edilmesini destekliyor. User journey mapping, kullanıcı deneyimi yolculuğunun haritalandırılması ve ağrı noktalarının tespit edilmesini içeriyor. Competitive analysis, rakip ürünlerin kullanıcı deneyimi analizi ve karşılaştırmasına izin veriyor. Usability testing, mevcut ürünün kullanılabilirlik testleri ve iyileştirme önerileri sunuyor. Information architecture, içerik organizasyonu ve navigasyon yapısının optimize edilmesini sağlıyor. Wireframing, düşük ve yüksek fidelite wireframe'lerin oluşturulmasını destekliyor. Prototyping, interaktif prototiplerin geliştirilmesi ve kullanıcı testleri içeriyor. Research documentation, araştırma bulgularının ve tasarım kararlarının dokümante edilmesini sağlıyor.",
    "budget": 65000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Erişilebilirlik Odaklı Tasarım ve WCAG Uyumluluğu",
    "description": "Tüm kullanıcılar için erişilebilir web ve mobil uygulama tasarımı geliştiriyoruz. Color contrast, WCAG AA veya AAA standartlarına uygun kontrast oranları sunuyor. Typography, okunabilir font boyutları ve satır yükseklikleri ile tipografi tasarımı içeriyor. Keyboard navigation, klavye ile tüm işlevlere erişim sağlayan navigasyon tasarımı destekliyor. Screen reader support, ekran okuyucular için uygun ARIA etiketleri ve semantik HTML yapısı içeriyor. Focus indicators, klavye odağının görsel olarak belirgin şekilde gösterilmesine izin veriyor. Alternative text, görseller için açıklayıcı alt metinler ve erişilebilirlik özellikleri sunuyor. Form accessibility, form alanlarının etiketlenmesi ve hata mesajlarının erişilebilir sunumu sağlıyor. Motion sensitivity, animasyon ve geçiş efektlerinin kapatılabilir olmasını destekliyor. Testing, erişilebilirlik test araçları ve gerçek kullanıcı testleri içeriyor. Documentation, erişilebilirlik gereksinimlerinin ve uygulamalarının dokümante edilmesini sağlıyor.",
    "budget": 58000,
    "deadline": "2025-04-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Marka Kimliği ve Görsel Dil Geliştirme",
    "description": "Güçlü marka kimliği ve tutarlı görsel dil oluşturulması için tasarım çalışması yapıyoruz. Logo design, marka değerlerini yansıtan logo tasarımı ve varyasyonları içeriyor. Color palette, marka kişiliğine uygun renk paleti ve kullanım kuralları sunuyor. Typography system, marka kimliğini destekleyen tipografi seçimi ve hiyerarşi içeriyor. Brand guidelines, marka kullanım kuralları ve doğru/yanlış örnekleri sunuyor. Visual style, marka kişiliğini yansıtan görsel stil ve fotoğraf seçimi rehberi destekliyor. Iconography, tutarlı ikon stili ve kullanım örnekleri içeriyor. Brand applications, farklı medya ve platformlarda marka uygulamalarına izin veriyor. Stationery design, kartvizit, antetli kağıt ve diğer kurumsal kimlik öğeleri sağlıyor. Digital assets, sosyal medya görselleri ve dijital platformlar için asset'ler sunuyor. Brand book, kapsamlı marka kılavuzu ve tasarım sisteminin dokümante edilmesini içeriyor.",
    "budget": 55000,
    "deadline": "2025-04-08T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Prototipleme ve İnteraktif Tasarım",
    "description": "Kullanıcı testleri için yüksek fidelite interaktif prototiplerin oluşturulması yapıyoruz. Prototyping tools, Figma, Adobe XD veya Framer gibi araçlarla interaktif prototipler içeriyor. User flows, kullanıcı akışlarının prototip üzerinde test edilmesini sağlıyor. Micro-interactions, buton etkileşimleri, geçiş animasyonları ve geri bildirim efektleri destekliyor. Responsive prototypes, farklı ekran boyutları için prototip varyantları içeriyor. User testing, prototip üzerinde kullanıcı testlerinin yapılmasına izin veriyor. Iteration, test sonuçlarına göre tasarım iyileştirmeleri ve prototip güncellemeleri sunuyor. Animation design, geçiş animasyonlarının tasarımı ve timing ayarları içeriyor. State management, farklı durumların (loading, error, success) prototip üzerinde gösterilmesini sağlıyor. Handoff preparation, geliştiricilere aktarım için detaylı spesifikasyonlar ve asset'ler sunuyor. Documentation, prototip kullanım kılavuzu ve tasarım kararlarının açıklanmasını destekliyor.",
    "budget": 62000,
    "deadline": "2025-04-12T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Sosyal Medya ve Dijital Pazarlama Tasarımları",
    "description": "Marka görünürlüğünü artırmak için sosyal medya ve dijital pazarlama görsel tasarımları oluşturuyoruz. Social media templates, Instagram, Facebook, LinkedIn için tutarlı post şablonları içeriyor. Banner design, web ve mobil platformlar için banner ve reklam tasarımları sunuyor. Infographic design, karmaşık bilgilerin görselleştirilmesi için infografik tasarımları destekliyor. Video graphics, sosyal medya videoları için grafik overlay'ler ve animasyonlar içeriyor. Email templates, pazarlama e-postaları için responsive e-posta şablonlarına izin veriyor. Brand consistency, tüm dijital platformlarda tutarlı marka görsel dili sağlıyor. Content calendar, görsel içerik takvimi ve tasarım planlaması içeriyor. A/B testing variants, farklı tasarım varyantlarının test edilmesi için hazırlık sunuyor. Optimization, platform spesifik gereksinimler ve performans optimizasyonu içeriyor. Asset library, yeniden kullanılabilir görsel asset'ler ve template'ler sunuyor.",
    "budget": 48000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  }
]
