[
  {
    "title": "Dinamik İçerik Yönetim Sistemi (CMS)",
    "description": "Mevcut web sitemizin yönetim paneli çok hantal ve pazarlama ekibimiz en ufak bir metin değişikliği için bile IT departmanını beklemek zorunda kalıyor. Bize özel, WordPress kadar kolay ama güvenlik açığı olmayan bir CMS istiyoruz. Editörlerimiz sürükle-bırak mantığıyla 'landing page' oluşturabilmeli. Özellikle SEO tarafında elimiz kolumuz bağlı; URL yapılarını, meta açıklamalarını ve sitemap'i panelden kimseye ihtiyaç duymadan yönetebilmemiz şart.",
    "budget": 65000,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Çok Dilli Kurumsal Portal",
    "description": "Global pazara açılıyoruz ve şu anki sitemiz bu yükü kaldırmıyor. 5 farklı dilde (EN, DE, FR, TR, AR) yayın yapacak, ziyaretçinin girdiği ülkeye göre otomatik dil ve o bölgenin ofis iletişim bilgilerini getirecek akıllı bir yapı arıyoruz. Sadece çeviri yetmez; Almanya'dan girene Euro, Türkiye'den girene TL fiyat listesi göstermeliyiz. Ayrıca her ülkenin yasal uyarı metinleri farklı, bunları ayrı ayrı yönetebileceğimiz bir altyapı gerekiyor.",
    "budget": 85000,
    "deadline": "2025-04-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "E-Öğrenme (LMS) Platformu",
    "description": "Udemy benzeri ama sadece kendi markamıza özel kapalı devre bir eğitim platformu kurmak istiyoruz. En büyük endişemiz videoların indirilip çalınması; bu yüzden güvenli bir streaming altyapısı (HLS vs.) olmazsa olmaz. Öğrenci eğitimi bitirdiğinde sistem otomatik olarak ismine özel PDF sertifika üretip mail atmalı. Ayrıca kredi kartı ile tekil kurs satışı yapacağız, ödeme sistemi entegrasyonu pürüzsüz çalışmalı.",
    "budget": 120000,
    "deadline": "2025-05-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Restoran Rezervasyon ve Menü Sistemi",
    "description": "Akşam servislerinde telefon trafiğini yönetemiyoruz, personel sürekli telefonda. Web sitemiz üzerinden çalışacak, müşterinin masa ve saat seçebileceği bir rezervasyon modülü lazım. Müşteri rezervasyonu yapınca bize tablet üzerinden bildirim düşmeli. Ayrıca kağıt menü maliyetlerinden kurtulmak istiyoruz; QR kodla okutulan, mobilde hızlı açılan ve ürünleri 'Tükendi' olarak işaretleyebileceğimiz dijital bir menü de bu işe dahil edilmeli.",
    "budget": 45000,
    "deadline": "2025-03-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Kreatif Portföy ve Galeri Sitesi",
    "description": "Ajansımız için 'Vay be' dedirtecek bir vitrin sitesi istiyoruz. Standart şablonlardan sıkıldık. İşlerimizi sergilerken 'Masonry' veya asimetrik ızgara yapıları kullanmak, sayfalar arası geçişlerde yumuşak animasyonlar (page transitions) görmek istiyoruz. Ancak site çok görsel ağırlıklı olacağı için açılış hızı yavaşlamamalı, lazy-load optimizasyonu çok iyi yapılmalı. Vimeo'dan çektiğimiz showreel videoları takılmadan oynamalı.",
    "budget": 28000,
    "deadline": "2025-02-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Emlak İlan ve Arama Platformu",
    "description": "Bölgesel emlak ofisimiz için Sahibinden/Zingat mantığında ama daha butik bir ilan sitesi yaptıracağız. En kritik özellik harita araması; kullanıcı haritada bir bölgeyi parmağıyla çizip 'Bu alandaki kiralıkları getir' diyebilmeli. Danışmanlarımız sahadayken cepten fotoğraf çekip siteye ilan girebilsin istiyoruz, admin paneli mobilde kusursuz çalışmalı. İlan karşılaştırma ve 'Fiyat düşünce haber ver' özellikleri de müşteri tutmak için şart.",
    "budget": 75000,
    "deadline": "2025-04-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Etkinlik Biletleme ve Kapı Kontrol Sistemi",
    "description": "Bilet satış aracılarına komisyon ödemekten yorulduk, kendi biletleme altyamızı kuracağız. Sistem üzerinden konser/etkinlik oluşturup farklı kategorilerde (VIP, Sahne Önü vb.) bilet satabilmeliyiz. Satış sonrası müşteriye karekodlu (QR) bir bilet gitmeli. Etkinlik günü kapıdaki güvenlik görevlileri, ellerindeki uygulama ile bu kodu okutup kişiyi içeri alabilmeli (Check-in).",
    "budget": 55000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Yüksek Trafikli Haber Portalı",
    "description": "Anlık trafik artışlarını (spike) kaldırabilecek, sunucuyu yormayan, cache yapısı güçlü bir haber yazılımına ihtiyacımız var. Editörlerin 'Son Dakika' bandını saniyeler içinde güncelleyebilmesi lazım. Gelir modelimiz reklam üzerine, bu yüzden Google AdSense ve özel banner alanları içeriği boğmadan stratejik yerlere yerleştirilmeli. Google News uyumluluğu ve AMP desteği projenin en önemli teknik gereksinimi.",
    "budget": 42000,
    "deadline": "2025-03-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Online Doktor Randevu Sistemi",
    "description": "Kliniğimizin sekreteryası randevuları organize etmekte zorlanıyor. Web sitemize entegre edeceğimiz bir modülle hastalar doktorların boş saatlerini görüp randevu alabilsin. Sistem randevudan 1 gün önce hastaya otomatik SMS hatırlatması yapsın istiyoruz. Arka tarafta basit bir hasta kartı da olsun; doktor hastanın geçmiş tahlillerini ve reçetelerini tek ekranda görebilsin. KVKK uyumluluğu bizim için kırmızı çizgi, veriler şifreli tutulmalı.",
    "budget": 68000,
    "deadline": "2025-04-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Kurumsal Web Sitesi Yenileme",
    "description": "20 yıllık sanayi firmasıyız ama web sitemiz hala 2010'dan kalma duruyor. Kurumsal kimliğimizi yansıtacak, ciddi, güven veren ama modern bir tasarım istiyoruz. Ürün kataloglarımızı PDF olarak indirtebileceğimiz, referanslarımızı logolarla sergileyebileceğimiz temiz bir yapı olsun. İletişim formundan gelen mesajlar doğrudan ilgili departman müdürünün mailine düşmeli, spamlara karşı da Google ReCaptcha koruması şart.",
    "budget": 35000,
    "deadline": "2025-03-05T00:00:00.000Z",
    "status": "open"
  }
]