[
  {
    "title": "Kurumsal Web Sitesi Geliştirme",
    "description": "Teknoloji şirketinin dijital varlığını güçlendirmek amacıyla çağdaş bir kurumsal web platformu tasarlanacak. Platform, şirketin hizmet portföyünü, başarı hikayelerini ve ekibini etkili bir şekilde tanıtacak.\n\n• React.js veya Next.js framework seçenekleri değerlendirilecek\n• Responsive tasarım yaklaşımıyla tüm ekran boyutlarında optimal görünüm sağlanacak\n• Arama motoru optimizasyonu stratejisi: teknik SEO çalışmaları ve içerik optimizasyonu\n• Blog entegrasyonu ve kolay içerik yönetim sistemi\n• İletişim kanalları: form, canlı destek ve harita entegrasyonu\n• Yönetim paneli üzerinden tüm içeriklerin güncellenebilmesi\n• Minimalist ve profesyonel tasarım dili, kurumsal kimliğe uygun renk ve tipografi seçimi\n• Performans optimizasyonu: Core Web Vitals kriterlerine uyum",
    "budget": 35000,
    "deadline": "2025-02-28T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "E-ticaret Platformu (WooCommerce)",
    "description": "Giyim sektöründe faaliyet gösteren işletmenin dijital satış kanalını oluşturmak için WooCommerce tabanlı bir e-ticaret çözümü kurulacak. Sistem, yoğun sipariş hacmini sorunsuz karşılayabilecek altyapıya sahip olmalı.\n\nWordPress ve WooCommerce kombinasyonu tercih ediliyor. Ürün kataloğunda gelişmiş filtreleme mekanizmaları, arama fonksiyonları ve kategorizasyon yapısı bulunacak. Her ürün için birden fazla görsel, beden/renk gibi varyant seçenekleri ve otomatik stok yönetimi entegre edilecek.\n\nKullanıcı deneyimi odaklı sepet ve ödeme akışı tasarlanacak. iyzico entegrasyonu sayesinde taksitli ödeme seçenekleri sunulacak. Kargo firmaları (Aras Kargo, Yurtiçi Kargo) ile entegrasyon yapılarak otomatik takip numarası gönderimi sağlanacak.\n\nSipariş yönetim modülü, stok kontrol sistemi, kupon yönetimi ve detaylı raporlama araçları geliştirilecek. Mobil optimizasyon kritik öneme sahip çünkü satışların büyük kısmı mobil cihazlardan gerçekleşiyor. SSL sertifikası ve PCI-DSS uyumluluğu sağlanacak.",
    "budget": 45000,
    "deadline": "2025-03-15T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Restoran Web Sitesi ve Online Sipariş Sistemi",
    "description": "İstanbul'daki restoran zinciri için dijital dönüşüm projesi: web sitesi ve online sipariş altyapısı. Masa rezervasyonu ve online sipariş özelliklerini bir araya getiren entegre bir sistem.\n\nMenü sunumu için yüksek çözünürlüklü fotoğraflar, detaylı açıklamalar, fiyatlandırma ve alerjen bilgileri içeren zengin bir yapı oluşturulacak. Kategorize edilmiş menü yapısı ve gelişmiş arama özelliği eklenecek.\n\nSipariş süreci: Kullanıcı dostu sepet yönetimi ve net sipariş özeti gösterimi. iyzico veya PayTR üzerinden güvenli ödeme altyapısı. SMS ve e-posta bildirimleriyle müşteri sipariş durumunu takip edebilecek.\n\nYönetim tarafında menü güncellemeleri, sipariş takibi, rezervasyon yönetimi ve analitik raporlama yapılabilecek. Mobil uyumluluk zorunlu - müşteri trafiğinin büyük kısmı mobil kaynaklı. Google Maps entegrasyonuyla restoran konumu görselleştirilecek.",
    "budget": 28000,
    "deadline": "2025-02-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Portfolio Web Sitesi (React)",
    "description": "Grafik tasarımcı ve dijital sanatçının yaratıcı çalışmalarını sergileyecek, potansiyel müşterileri etkileyecek kişisel portfolio platformu. React.js ile modern bir single-page application olarak geliştirilecek.\n\nGörsel deneyim: Akıcı scroll animasyonları, parallax efektleri ve interaktif elementlerle zenginleştirilmiş bir arayüz. Proje galerisi grid düzeniyle organize edilecek, lightbox ile detaylı görüntüleme imkanı sunulacak.\n\nHer proje için özel detay sayfası: açıklama metni, kullanılan teknolojiler ve görsel koleksiyonu. Blog bölümünde sanatçının düşünce süreçleri ve yaratım hikayeleri paylaşılabilecek.\n\nİletişim formu ve sosyal medya bağlantıları entegre edilecek. Kullanıcı tercihine göre dark mode desteği eklenecek. Tasarım, sanatçının kişisel tarzını yansıtacak şekilde yaratıcı ve çağdaş olacak. Performans için lazy loading ve görsel optimizasyonu yapılacak.",
    "budget": 18000,
    "deadline": "2025-02-10T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "LMS (Learning Management System)",
    "description": "Binlerce öğrenciye hizmet verebilecek kapasitede bir online eğitim yönetim sistemi. Laravel backend ve React frontend teknolojileriyle ölçeklenebilir bir mimari üzerine kurulacak.\n\nKullanıcı yönetimi: Kayıt ve giriş sistemi, profil yönetimi, şifre sıfırlama özellikleri. Öğrenci, eğitmen ve admin rolleri için ayrı yetkilendirme yapısı.\n\nEğitim içeriği: Video streaming altyapısı, ilerleme takibi, not alma ve hızlandırma özellikli video oynatıcı. Çoktan seçmeli, doğru/yanlış, boşluk doldurma gibi farklı soru tiplerini destekleyen quiz modülü.\n\nSertifikasyon: Tamamlanan kurslar için otomatik sertifika oluşturma ve PDF indirme. Ödeme entegrasyonuyla kurs satın alma işlemleri.\n\nYönetim paneli: Kurs yönetimi, öğrenci takibi, detaylı raporlama ve analitik araçları. Oyunlaştırma özellikleri (rozetler, puan sistemi, liderlik tablosu). Bildirim sistemi ve e-posta pazarlama entegrasyonu.",
    "budget": 85000,
    "deadline": "2025-04-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Emlak İlan Sitesi",
    "description": "Emlak sektöründe faaliyet gösteren platform için kapsamlı bir ilan yönetim çözümü. Emlakçılar ve bireysel kullanıcıların ihtiyaçlarını karşılayacak esnek bir sistem.\n\nBackend seçenekleri: PHP (Laravel) veya Node.js (Express). İlan ekleme ve düzenleme formunda konum, fiyat, oda sayısı, metrekare, bina yaşı, kat bilgisi gibi tüm detaylar girilebilecek.\n\nArama ve filtreleme: Gelişmiş arama algoritması ve çoklu filtreleme seçenekleri. Google Maps entegrasyonuyla konum bazlı arama. Kullanıcıların ilanları favorilere ekleyebilmesi.\n\nİletişim: Emlakçı ve müşteri arasında mesajlaşma sistemi. İlan detay sayfasında fotoğraf galerisi, sanal tur, video ve 360 derece görüntü desteği.\n\nYönetim: Admin paneli üzerinden ilan onaylama, kullanıcı yönetimi ve raporlama. SEO optimizasyonuyla Google'da görünürlük. Mobil uyumlu tasarım zorunlu.",
    "budget": 55000,
    "deadline": "2025-03-25T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Haber Portalı",
    "description": "Dijital medya şirketi için günlük yüzlerce haber yayınlayacak, binlerce ziyaretçiye hizmet verecek bir haber platformu. WordPress veya özel PHP (Laravel) çözümü tercih edilebilir.\n\nİçerik yönetimi: Haberlerin kategorilere ayrılması ve yazar paneli üzerinden editörlerin içerik ekleyip düzenleyebilmesi. Zengin metin editörüyle görsel, video ve galeri ekleme imkanı.\n\nEtkileşim: Okuyucuların haberler hakkında yorum yapabileceği ve moderasyon yapılabileceği yorum sistemi. Başlık, içerik, yazar ve tarih bazlı gelişmiş arama özelliği.\n\nDağıtım: RSS feed desteğiyle haberlerin dış platformlara aktarılması. Sosyal medya paylaşım butonları ve Open Graph etiketleriyle sosyal medyada optimize görünüm.\n\nYönetim: İçerik yönetimi, kullanıcı yönetimi ve istatistik görüntüleme için admin paneli. Sayfa yükleme hızı optimizasyonu.",
    "budget": 32000,
    "deadline": "2025-03-05T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Doktor Randevu Sistemi",
    "description": "Hastane grubunun randevu süreçlerini dijitalleştirmek için online randevu yönetim sistemi. Hastaların kolayca randevu alabilmesi ve yönetim ekibinin randevuları takip edebilmesi hedefleniyor.\n\nRandevu alma süreci: Doktor seçimi, tarih ve saat seçimi, takvim görünümünde müsait saatlerin gösterilmesi. Hasta bilgileri formuyla kişisel ve iletişim bilgilerinin toplanması.\n\nBildirimler: SMS ve e-posta üzerinden randevu onayı, hatırlatma ve iptal bildirimleri. Randevu görüntüleme, düzenleme ve iptal etme özellikleri.\n\nYönetim: Doktor yönetimi, çalışma saatleri ayarlama, randevu takibi ve hasta geçmişi görüntüleme için admin paneli. İstatistiksel raporlama modülü.\n\nMobil optimizasyon kritik - hastaların büyük çoğunluğu mobil cihazlardan randevu alıyor. KVKK uyumlu hasta bilgisi koruma sistemi.",
    "budget": 42000,
    "deadline": "2025-03-20T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Etkinlik Yönetim Platformu",
    "description": "Etkinlik organizasyon şirketi için etkinlik oluşturma, bilet satışı ve katılımcı yönetimi yapabilen entegre platform. React frontend ve Node.js backend teknolojileriyle geliştirilecek.\n\nEtkinlik oluşturma: Başlık, açıklama, tarih, konum, kapasite, bilet fiyatları gibi tüm bilgilerin girilebileceği detaylı form. iyzico entegrasyonuyla bilet satışı. VIP, normal, öğrenci gibi farklı bilet tipleri. QR kod bilet sistemiyle giriş yönetimi.\n\nKeşif: Kullanıcıların ilgi alanlarına göre etkinlik bulabileceği arama ve filtreleme özelliği. Organizatör paneli: etkinlik yönetimi, katılımcı listesi, check-in yönetimi.\n\nİletişim: E-posta bildirimleriyle etkinlik hatırlatmaları. Satış istatistikleri için raporlama modülü. Mobil uyumlu tasarım zorunlu.",
    "budget": 48000,
    "deadline": "2025-03-30T00:00:00.000Z",
    "status": "open"
  },
  {
    "title": "Basit Kurumsal Web Sitesi (5 Sayfa)",
    "description": "Küçük işletme için şirket bilgilerini ve hizmetlerini tanıtan profesyonel web sitesi. WordPress veya statik site (Next.js) olarak geliştirilebilir.\n\nSayfa yapısı: Ana sayfa, hakkımızda, hizmetler, iletişim ve blog. Her sayfa için içerik yönetim sistemiyle kolay güncelleme.\n\nSEO: Meta etiketleri, yapılandırılmış veri, sitemap oluşturma. İletişim formuyla müşteri erişimi.\n\nMobil uyumluluk zorunlu - Google'ın mobil-first yaklaşımı nedeniyle tüm sayfalar mobil cihazlarda optimal görünüm. Sayfa yükleme hızı optimizasyonu.\n\nTemiz, profesyonel tasarım, şirket kimliğine uygun. Sosyal medya entegrasyonları ve harita entegrasyonu eklenebilir.",
    "budget": 12000,
    "deadline": "2025-02-05T00:00:00.000Z",
    "status": "open"
  }
]
