[
  {
    "title": "Full Stack Developer (MERN) - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak full stack geliştiricisi arıyoruz. Online eğitim platformları, öğrenci yönetim sistemleri ve içerik yönetim araçları geliştirme konularında deneyimli adaylar arayışındayız. Modern web teknolojileri ile interaktif öğrenme deneyimleri oluşturma, video streaming entegrasyonları ve gerçek zamanlı iletişim özellikleri geliştirme konularında yetkinlik beklenmektedir. Kullanıcı arayüzü tasarımı, backend API geliştirme ve veritabanı yönetimi konularında uzmanlaşma önemlidir. Ölçeklenebilir mimariler, performans optimizasyonu ve güvenlik standartları konularında deneyim gereklidir. Ekip çalışması, agile metodolojiler ve sürekli öğrenme yaklaşımı değerlendirilecektir.\n\nBu pozisyonda en az 3 yıl çalışma tecrübesi olan, eğitim sektöründe proje deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 3 yıl full stack geliştirme deneyimi",
        "MongoDB, Express.js, React, Node.js (MERN) stack",
        "RESTful API geliştirme",
        "Responsive web tasarım bilgisi",
        "Git versiyon kontrolü",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Video streaming entegrasyonları",
        "WebSocket ve real-time uygulama geliştirme",
        "Docker ve containerization",
        "Unit test yazma deneyimi",
        "Eğitim teknolojileri domain bilgisi"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "60.000 - 100.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 1
  },
  {
    "title": "LMS Administrator - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak LMS yöneticisi arıyoruz. Öğrenme yönetim sistemleri kurulumu, yapılandırması ve yönetimi konularında deneyimli adaylar arayışındayız. Moodle, Canvas veya benzeri LMS platformlarında sistem yönetimi, kullanıcı yönetimi ve içerik organizasyonu konularında yetkinlik beklenmektedir. Kurs yapılandırması, öğrenci kayıt süreçleri ve raporlama sistemleri konularında uzmanlaşma önemlidir. Teknik destek, kullanıcı eğitimi ve dokümantasyon konularında deneyim gereklidir. Sistem güvenliği, yedekleme stratejileri ve performans optimizasyonu konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 2 yıl çalışma tecrübesi olan, eğitim sektöründe LMS yönetimi deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 2 yıl LMS yönetimi deneyimi",
        "Moodle, Canvas veya benzeri LMS platform bilgisi",
        "Kullanıcı yönetimi ve sistem yapılandırması",
        "Kurs yönetimi ve içerik organizasyonu",
        "Raporlama ve analytics",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "LMS plugin development",
        "Database yönetimi",
        "API entegrasyonları",
        "Eğitim teknolojileri sertifikaları",
        "Pedagogi bilgisi"
      ]
    },
    "location": "Ankara / Hibrit",
    "salary": "55.000 - 95.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 2
  },
  {
    "title": "E-Learning Content Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak içerik geliştiricisi arıyoruz. Online kurs içerikleri, interaktif öğrenme materyalleri ve multimedya eğitim içerikleri oluşturma konularında deneyimli adaylar arayışındayız. Eğitim tasarımı, içerik yazma ve görsel tasarım konularında yetkinlik beklenmektedir. Video production, animasyon ve interaktif öğeler oluşturma konularında uzmanlaşma önemlidir. SCORM ve xAPI standartları, LMS entegrasyonları ve içerik yönetimi konularında deneyim gereklidir. Öğrenme hedefleri belirleme, değerlendirme soruları hazırlama ve içerik kalitesi kontrolü konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 2 yıl çalışma tecrübesi olan, eğitim sektöründe içerik geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 2 yıl e-learning içerik geliştirme deneyimi",
        "Eğitim tasarımı ve içerik yazma",
        "Articulate Storyline, Adobe Captivate veya benzeri araçlar",
        "Video editing ve multimedia production",
        "SCORM ve xAPI standartları",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Graphic design yetenekleri",
        "Animation ve interaktif öğeler",
        "LMS entegrasyon deneyimi",
        "Pedagogi ve öğrenme teorileri",
        "Accessibility standartları"
      ]
    },
    "location": "İzmir / Hibrit",
    "salary": "55.000 - 95.000₺",
    "contractDuration": "6 ay",
    "daysAgo": 3
  },
  {
    "title": "Frontend Developer (React) - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak frontend geliştiricisi arıyoruz. Öğrenci portalleri, öğretmen dashboard'ları ve interaktif öğrenme arayüzleri geliştirme konularında deneyimli adaylar arayışındayız. Modern JavaScript framework'leri ile kullanıcı deneyimi odaklı arayüzler tasarlama, responsive design ve accessibility konularında yetkinlik beklenmektedir. Component-based architecture, state management ve API entegrasyonları konularında uzmanlaşma önemlidir. Performance optimization, code splitting ve lazy loading konularında deneyim gereklidir. Testing, code quality ve documentation konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 3 yıl çalışma tecrübesi olan, eğitim sektöründe frontend geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 3 yıl React geliştirme deneyimi",
        "TypeScript bilgisi",
        "Redux veya Context API state management",
        "Responsive web tasarım bilgisi",
        "RESTful API entegrasyonu",
        "HTML5, CSS3 ve JavaScript",
        "Git versiyon kontrolü"
      ],
      "niceToHave": [
        "Next.js framework deneyimi",
        "Material-UI veya Ant Design",
        "WebSocket ve real-time uygulama geliştirme",
        "Jest veya React Testing Library",
        "Accessibility (WCAG) standartları"
      ]
    },
    "location": "Ankara / Hibrit",
    "salary": "60.000 - 100.000₺",
    "contractDuration": "2 yıl",
    "daysAgo": 4
  },
  {
    "title": "Backend Developer (Node.js) - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak backend geliştiricisi arıyoruz. Öğrenci yönetim sistemleri, öğretmen portalleri ve içerik yönetim API'leri geliştirme konularında deneyimli adaylar arayışındayız. RESTful API geliştirme, veritabanı yönetimi ve authentication sistemleri konularında yetkinlik beklenmektedir. Microservices architecture, caching strategies ve background job processing konularında uzmanlaşma önemlidir. File upload, video processing ve notification systems konularında deneyim gereklidir. Security best practices, data validation ve error handling konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 3 yıl çalışma tecrübesi olan, eğitim sektöründe backend geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 3 yıl Node.js geliştirme deneyimi",
        "Express.js framework bilgisi",
        "MongoDB veya PostgreSQL veritabanı kullanımı",
        "RESTful API geliştirme",
        "Authentication ve authorization",
        "Git versiyon kontrolü",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "TypeScript bilgisi",
        "GraphQL kullanımı",
        "Docker ve Kubernetes",
        "Jest veya Mocha test framework",
        "Microservices mimarisi bilgisi"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "60.000 - 100.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 5
  },
  {
    "title": "Mobile Developer (React Native) - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak mobil geliştiricisi arıyoruz. Eğitim uygulamaları, öğrenci takip sistemleri ve offline öğrenme çözümleri geliştirme konularında deneyimli adaylar arayışındayız. Cross-platform mobil uygulamalar geliştirme, native performance optimization ve kullanıcı deneyimi iyileştirme konularında yetkinlik beklenmektedir. State management, navigation ve API integration konularında uzmanlaşma önemlidir. Offline data storage, sync mechanisms ve push notifications konularında deneyim gereklidir. App store deployment, version management ve update strategies konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 2 yıl çalışma tecrübesi olan, eğitim sektöründe mobil uygulama geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 2 yıl React Native geliştirme deneyimi",
        "TypeScript bilgisi",
        "Redux veya MobX state management",
        "RESTful API entegrasyonu",
        "iOS ve Android deployment süreçleri",
        "App Store ve Google Play Store yayınlama deneyimi",
        "Git versiyon kontrolü"
      ],
      "niceToHave": [
        "Offline storage ve sync",
        "Push notification implementasyonu",
        "Performance optimization",
        "Automated testing (Jest, Detox)",
        "Eğitim teknolojileri domain bilgisi"
      ]
    },
    "location": "İzmir / Hibrit",
    "salary": "55.000 - 95.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 6
  },
  {
    "title": "EdTech Product Manager - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak ürün yöneticisi arıyoruz. Eğitim teknolojisi ürünleri için strateji geliştirme, roadmap planlama ve ürün geliştirme süreçlerini yönetme konularında deneyimli adaylar arayışındayız. Kullanıcı ihtiyaçlarını analiz etme, öğrenme deneyimini optimize etme ve ürün metriklerini takip etme konularında yetkinlik beklenmektedir. Stakeholder management, cross-functional collaboration ve prioritization konularında uzmanlaşma önemlidir. Market research, competitive analysis ve user research konularında deneyim gereklidir. Product requirements, user stories ve acceptance criteria oluşturma konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 4 yıl çalışma tecrübesi olan, eğitim sektöründe ürün yönetimi deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl ürün yönetimi deneyimi",
        "Product strategy ve roadmap planning",
        "User research ve market analysis",
        "Agile ve Scrum metodolojileri",
        "Stakeholder management",
        "Analytics ve metrics tracking",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Eğitim teknolojileri domain bilgisi",
        "Pedagogi bilgisi",
        "Data analysis yetenekleri",
        "A/B testing deneyimi",
        "Product management sertifikaları"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "90.000 - 130.000₺",
    "contractDuration": "2 yıl",
    "daysAgo": 7
  },
  {
    "title": "Video Streaming Engineer - YTK Career",
    "description": "Anlaşmalı olduğumuz eğitim projesinde çalışacak video streaming mühendisi arıyoruz. Online eğitim platformları için video streaming altyapısı, canlı yayın sistemleri ve video on-demand servisleri geliştirme konularında deneyimli adaylar arayışındayız. Video encoding, transcoding ve streaming protocols konularında yetkinlik beklenmektedir. CDN integration, adaptive bitrate streaming ve video quality optimization konularında uzmanlaşma önemlidir. Live streaming, recording ve playback systems konularında deneyim gereklidir. Video analytics, DRM ve content protection konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 3 yıl çalışma tecrübesi olan, eğitim sektöründe video streaming deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 3 yıl video streaming deneyimi",
        "Video encoding ve transcoding bilgisi",
        "HLS, DASH veya benzeri streaming protocols",
        "CDN integration deneyimi",
        "FFmpeg veya benzeri video processing tools",
        "Linux sistem bilgisi",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Live streaming deneyimi",
        "DRM ve content protection",
        "Video analytics",
        "Cloud video platforms (AWS MediaConvert, Azure Media Services)",
        "Containerization (Docker)"
      ]
    },
    "location": "Ankara / Hibrit",
    "salary": "70.000 - 110.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 8
  }
]
