[
  {
    "title": "Senior Backend Developer (.NET Core) - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak backend geliştiricisi arıyoruz. Finansal işlem sistemleri, ödeme gateway entegrasyonları ve risk yönetim modülleri geliştirme konularında uzmanlaşmış profesyoneller arayışındayız. Enterprise seviyesinde backend uygulamaları geliştirme, yüksek hacimli transaction işleme ve sistem performans optimizasyonu konularında yetkinlik beklenmektedir. Microservices mimarisi, distributed systems ve message queue systems konularında uzmanlaşma önemlidir. Güvenlik protokollerine tam uyum, veri şifreleme ve yetkilendirme mekanizmaları konularında derin bilgi sahibi olunması gerekmektedir. Code quality, testing ve documentation standartlarına uyum sağlanması beklenmektedir. Bu pozisyonda en az 6 yıl çalışma tecrübesi olan, finans sektöründe kritik sistemler geliştirmiş profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 6 yıl .NET Core ve C# geliştirme deneyimi",
        "Entity Framework Core ile veritabanı yönetimi",
        "RESTful API tasarımı ve geliştirme deneyimi",
        "Microservices mimarisi bilgisi",
        "SQL Server veritabanı kullanımı",
        "Güvenlik ve şifreleme standartları bilgisi",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Docker ve Kubernetes deneyimi",
        "RabbitMQ, Redis gibi mesajlaşma sistemleri",
        "Unit test yazma deneyimi (xUnit, NUnit)",
        "CI/CD pipeline kurulumu",
        "PCI-DSS compliance bilgisi"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "110.000 - 150.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 1
  },
  {
    "title": "Java Spring Boot Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak Java geliştiricisi arıyoruz. Finansal uygulamalar, kredi yönetim sistemleri ve müşteri portalleri geliştirme konularında deneyimli adaylar arayışındayız. Spring Framework ekosistemi ile enterprise çözümler tasarlama, veritabanı optimizasyonu ve sistem entegrasyonları konularında yetkinlik beklenmektedir. Karmaşık iş kurallarını kodlayabilme, performanslı sorgular yazma ve ölçeklenebilir mimariler oluşturma yeteneği önemlidir. Finans domain bilgisi ile teknik yetenekleri birleştirerek, iş ihtiyaçlarını etkin şekilde karşılayabilecek çözümler üretilmesi gerekmektedir. Code quality, test coverage ve documentation standartlarına uyum sağlanması beklenmektedir. Bu pozisyonda en az 4 yıl çalışma tecrübesi olan, finans sektöründe Java geliştirme deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl Java geliştirme deneyimi",
        "Spring Boot ve Spring Framework bilgisi",
        "Spring Data JPA ve Hibernate",
        "RESTful API geliştirme",
        "Oracle veya PostgreSQL veritabanı kullanımı",
        "Maven veya Gradle build tool",
        "SQL ve veritabanı yönetimi"
      ],
      "niceToHave": [
        "Spring Cloud ve microservices",
        "Docker ve Kubernetes",
        "RabbitMQ veya Kafka message broker",
        "JUnit ve Mockito test framework",
        "Finans domain bilgisi"
      ]
    },
    "location": "Ankara / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "2 yıl",
    "daysAgo": 2
  },
  {
    "title": "React Frontend Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak frontend geliştiricisi arıyoruz. Finansal dashboard'lar, müşteri portalleri ve trading platformları geliştirme konularında deneyimli adaylar arayışındayız. Modern JavaScript framework'leri ile kullanıcı deneyimi odaklı arayüzler tasarlama, performans optimizasyonu ve erişilebilirlik standartlarına uyum sağlama yetkinliği beklenmektedir. Responsive tasarım prensipleri ile mobil ve masaüstü platformlarda tutarlı deneyim sunulması gerekmektedir. Karmaşık veri görselleştirmeleri, gerçek zamanlı güncellemeler ve interaktif form yönetimi konularında uzmanlaşma önemlidir. Erişilebilirlik standartlarına (WCAG) tam uyum, klavye navigasyonu ve ekran okuyucu desteği sağlanması beklenmektedir. Bu pozisyonda en az 3 yıl çalışma tecrübesi olan, finans sektöründe frontend geliştirme deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 3 yıl React geliştirme deneyimi",
        "TypeScript bilgisi",
        "Redux veya Context API state management",
        "Responsive web tasarım bilgisi",
        "RESTful API entegrasyonu",
        "HTML5, CSS3 ve JavaScript",
        "Git versiyon kontrolü"
      ],
      "niceToHave": [
        "Next.js framework deneyimi",
        "Material-UI veya Ant Design",
        "WebSocket ve real-time uygulama geliştirme",
        "Jest veya React Testing Library",
        "Accessibility (WCAG) standartları"
      ]
    },
    "location": "İzmir / Hibrit",
    "salary": "65.000 - 105.000₺",
    "contractDuration": "2 yıl",
    "daysAgo": 3
  },
  {
    "title": "DevOps Engineer - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak DevOps mühendisi arıyoruz. Finansal sistemler için bulut altyapısı yönetimi, sürekli entegrasyon ve dağıtım süreçleri kurma, güvenlik odaklı otomasyon çözümleri geliştirme konularında uzmanlaşmış profesyoneller arayışındayız. Yüksek erişilebilirlik ve felaket kurtarma stratejileri tasarlama, sistem izleme ve performans yönetimi deneyimi olan adaylar değerlendirilecektir. Infrastructure as Code yaklaşımı ile altyapı yönetimi, otomatik ölçeklendirme ve kaynak optimizasyonu konularında yetkinlik beklenmektedir. Güvenlik politikalarının uygulanması, compliance gereksinimlerinin karşılanması ve audit trail'lerin oluşturulması kritik öneme sahiptir. Bu pozisyonda en az 5 yıl çalışma tecrübesi olan, finans sektöründe infrastructure yönetimi deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 5 yıl DevOps deneyimi",
        "Docker ve Kubernetes bilgisi",
        "AWS veya Azure cloud platform deneyimi",
        "CI/CD pipeline kurulumu (Jenkins, GitLab CI, GitHub Actions)",
        "Linux sistem yönetimi",
        "Infrastructure as Code (Terraform veya CloudFormation)",
        "Güvenlik ve compliance bilgisi"
      ],
      "niceToHave": [
        "Prometheus ve Grafana ile monitoring",
        "Ansible veya Chef ile configuration management",
        "Elasticsearch ve Logstash deneyimi",
        "Python veya Bash scripting",
        "PCI-DSS ve SOX compliance bilgisi"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "115.000 - 155.000₺",
    "contractDuration": "3 yıl",
    "daysAgo": 4
  },
  {
    "title": "QA Automation Engineer - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak test otomasyon mühendisi arıyoruz. Finansal uygulamalar için kapsamlı test stratejileri geliştirme, otomasyon framework'leri kurma ve sürekli test süreçleri yönetme konularında deneyimli adaylar arayışındayız. Kritik finansal işlemlerin doğruluğunu ve güvenliğini sağlama, performans testleri yürütme ve test raporlama sistemleri oluşturma yetkinliği beklenmektedir. Test case tasarımı, test data yönetimi ve regression test süreçleri konularında derin bilgi sahibi olunması gerekmektedir. API testleri, entegrasyon testleri ve end-to-end test senaryoları geliştirme yetenekleri önemlidir. Bu pozisyonda en az 3 yıl çalışma tecrübesi olan, finans sektöründe test deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 3 yıl QA otomasyon deneyimi",
        "Selenium WebDriver veya Cypress",
        "Java, Python veya JavaScript programlama",
        "TestNG, JUnit veya Jest test framework",
        "API testing (Postman, REST Assured)",
        "Agile metodolojiler deneyimi",
        "Test planlama ve raporlama"
      ],
      "niceToHave": [
        "Playwright veya Puppeteer",
        "Performance testing (JMeter, Gatling)",
        "BDD framework (Cucumber, SpecFlow)",
        "CI/CD entegrasyonu",
        "Finans domain bilgisi"
      ]
    },
    "location": "Ankara / Uzaktan",
    "salary": "70.000 - 110.000₺",
    "contractDuration": "3-6 ay",
    "daysAgo": 5
  },
  {
    "title": "Python Backend Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak Python geliştiricisi arıyoruz. Finansal veri analizi ve işleme sistemleri, risk hesaplama modelleri ve makine öğrenmesi entegrasyonları geliştirme konularında deneyimli adaylar arayışındayız. Büyük veri setleri üzerinde işlem yapma, algoritma optimizasyonu ve veri pipeline'ları oluşturma yetkinliği beklenmektedir. Veri manipülasyonu, istatistiksel analiz ve raporlama sistemleri geliştirme konularında uzmanlaşma önemlidir. API geliştirme, veritabanı entegrasyonları ve background job processing konularında deneyim gereklidir. Code quality, test yazma ve documentation standartlarına uyum sağlanması beklenmektedir. Bu pozisyonda en az 4 yıl çalışma tecrübesi olan, finans sektöründe Python geliştirme deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl Python geliştirme deneyimi",
        "Django veya Flask framework bilgisi",
        "PostgreSQL veya MySQL veritabanı kullanımı",
        "RESTful API geliştirme",
        "Redis cache kullanımı",
        "Git versiyon kontrolü",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Machine Learning ve Data Science bilgisi",
        "Celery task queue",
        "Docker ve Kubernetes",
        "Pytest test framework",
        "Pandas ve NumPy kütüphaneleri"
      ]
    },
    "location": "İzmir / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "2 yıl",
    "daysAgo": 6
  },
  {
    "title": "Database Administrator - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak veritabanı yöneticisi arıyoruz. Finansal sistemler için veritabanı mimarisi tasarlama, performans optimizasyonu ve güvenlik yönetimi konularında uzmanlaşmış profesyoneller arayışındayız. Yüksek erişilebilirlik çözümleri, yedekleme ve felaket kurtarma stratejileri konularında deneyimli adaylar değerlendirilecektir. Query optimization, index management ve execution plan analysis konularında derin bilgi sahibi olunması gerekmektedir. Database security, access control ve audit logging konularında yetkinlik beklenmektedir. Capacity planning, resource monitoring ve performance tuning konularında deneyim önemlidir. Bu pozisyonda en az 6 yıl çalışma tecrübesi olan, finans sektöründe DBA deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 6 yıl DBA deneyimi",
        "SQL Server, Oracle veya PostgreSQL uzmanlığı",
        "Veritabanı tasarımı ve optimizasyonu",
        "Backup ve recovery stratejileri",
        "Performance tuning ve query optimization",
        "Güvenlik ve access control",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Always On Availability Groups",
        "Database replication",
        "Disaster recovery planlama",
        "Cloud database yönetimi (Azure SQL, AWS RDS)",
        "Automation ve scripting (PowerShell, Python)"
      ]
    },
    "location": "Ankara / Hibrit",
    "salary": "115.000 - 155.000₺",
    "contractDuration": "3-6 ay",
    "daysAgo": 7
  },
  {
    "title": "Security Engineer - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak güvenlik mühendisi arıyoruz. Finansal sistemler için güvenlik mimarisi tasarlama, penetrasyon testleri ve güvenlik denetimleri konularında uzmanlaşmış profesyoneller arayışındayız. Siber güvenlik standartlarına uyum, güvenlik açığı yönetimi ve olay müdahale süreçleri konularında derin bilgi sahibi adaylar değerlendirilecektir. Security assessment, risk analizi ve compliance kontrolü konularında yetkinlik beklenmektedir. Encryption, authentication ve authorization mekanizmaları konularında uzmanlaşma önemlidir. Security monitoring, threat detection ve incident response konularında deneyim gereklidir. Bu pozisyonda en az 6 yıl çalışma tecrübesi olan, finans sektöründe güvenlik deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 6 yıl cybersecurity deneyimi",
        "OWASP Top 10 bilgisi",
        "PCI-DSS compliance deneyimi",
        "Penetration testing ve vulnerability assessment",
        "Encryption ve cryptography bilgisi",
        "Security architecture tasarımı",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "CEH, CISSP veya benzeri sertifikalar",
        "SIEM sistemleri (Splunk, QRadar)",
        "Identity and Access Management (IAM)",
        "Network security ve firewall yönetimi",
        "Incident response ve forensics"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "120.000 - 160.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 8
  },
  {
    "title": "Business Analyst - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak iş analisti arıyoruz. Finansal sistemler için gereksinim analizi yapma, süreç iyileştirme önerileri geliştirme ve kullanıcı hikayeleri yazma konularında deneyimli adaylar arayışındayız. İş ihtiyaçlarını teknik gereksinimlere dönüştürme, dokümantasyon oluşturma ve proje yönetimi süreçlerine katkı sağlama yetkinliği beklenmektedir. Stakeholder interviews, requirement gathering ve gap analysis konularında deneyim önemlidir. Process mapping, workflow design ve business rules documentation konularında yetkinlik beklenmektedir. User acceptance testing koordinasyonu, change management ve training material hazırlama konularında bilgi sahibi olunması gerekmektedir. Bu pozisyonda en az 4 yıl çalışma tecrübesi olan, finans sektöründe iş analizi deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl iş analizi deneyimi",
        "Gereksinim analizi ve dokümantasyon",
        "Agile ve Scrum metodolojileri",
        "Jira ve Confluence kullanımı",
        "UML ve process diagram oluşturma",
        "Stakeholder yönetimi",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "SQL temel bilgisi",
        "API dokümantasyonu",
        "User story yazma",
        "Acceptance criteria tanımlama",
        "Business process modeling"
      ]
    },
    "location": "Ankara / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "3 yıl",
    "daysAgo": 9
  },
  {
    "title": "Full Stack Developer (.NET + React) - YTK Career",
    "description": "Anlaşmalı olduğumuz finans projesinde çalışacak full stack geliştiricisi arıyoruz. Uçtan uca finansal web uygulamaları geliştirme, kullanıcı arayüzü ve backend entegrasyonları, admin paneli ve müşteri portalleri oluşturma konularında deneyimli adaylar arayışındayız. Hem frontend hem backend teknolojilerinde derin bilgi sahibi, tam stack çözümler tasarlayabilen profesyoneller değerlendirilecektir. API tasarımı, veri akışı yönetimi ve kullanıcı deneyimi optimizasyonu konularında yetkinlik beklenmektedir. State management, component architecture ve reusable code patterns konularında uzmanlaşma önemlidir. Veritabanı tasarımı, ORM kullanımı ve query optimizasyonu konularında deneyim gereklidir. Bu pozisyonda en az 5 yıl çalışma tecrübesi olan, finans sektöründe full stack geliştirme deneyimi bulunan profesyoneller arıyoruz. Bu iş pozisyonu için imzalanan sözleşmede, sözleşme süresince aylık olarak %1 hizmet bedeli maaşınızdan tahsil edilecektir.",
    "requirements": {
      "mustHave": [
        "En az 5 yıl full stack geliştirme deneyimi",
        ".NET Core ve C# bilgisi",
        "React ve TypeScript bilgisi",
        "Entity Framework Core",
        "Redux veya Context API",
        "RESTful API geliştirme ve entegrasyonu",
        "SQL Server veya PostgreSQL"
      ],
      "niceToHave": [
        "Next.js framework deneyimi",
        "Azure cloud platform",
        "Docker ve containerization",
        "Unit test yazma deneyimi",
        "Microservices mimarisi"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "110.000 - 150.000₺",
    "contractDuration": "3 yıl",
    "daysAgo": 10
  }
]

