[
  {
    "title": "Senior Full Stack Developer (MERN Stack) - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak full stack geliştiricisi arıyoruz. SaaS platformlar, cloud-based uygulamalar ve enterprise çözümler geliştirme konularında deneyimli adaylar arayışındayız. Modern web teknolojileri ile ölçeklenebilir uygulamalar tasarlama, microservices mimarisi ve distributed systems konularında yetkinlik beklenmektedir. API design, database optimization ve caching strategies konularında uzmanlaşma önemlidir. Code quality, testing ve documentation standartlarına uyum sağlanması beklenmektedir. Ekip liderliği, teknik mentörlük ve best practices paylaşımı konularında deneyim değerlendirilecektir.\n\nBu pozisyonda en az 5 yıl çalışma tecrübesi olan, teknoloji sektöründe proje deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 5 yıl full stack geliştirme deneyimi",
        "MongoDB, Express.js, React, Node.js (MERN) stack",
        "TypeScript bilgisi",
        "RESTful API ve GraphQL geliştirme",
        "Microservices mimarisi bilgisi",
        "Cloud platform deneyimi (AWS, Azure, GCP)",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Docker ve Kubernetes",
        "CI/CD pipeline kurulumu",
        "Unit test yazma deneyimi",
        "Serverless architecture",
        "Real-time applications"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "110.000 - 150.000₺",
    "contractDuration": "3-6 ay",
    "daysAgo": 1
  },
  {
    "title": "Cloud Solutions Architect - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak bulut çözüm mimarı arıyoruz. Kurumsal cloud mimarisi tasarımı, scalable sistemler ve multi-cloud çözümler geliştirme konularında uzmanlaşmış profesyoneller arayışındayız. AWS, Azure ve GCP platformlarında architecture design, cost optimization ve security best practices konularında yetkinlik beklenmektedir. Microservices architecture, serverless computing ve container orchestration konularında uzmanlaşma önemlidir. Disaster recovery, high availability ve scalability planning konularında deneyim gereklidir. Compliance, security ve governance konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 6 yıl çalışma tecrübesi olan, teknoloji sektöründe cloud architecture deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 6 yıl cloud architecture deneyimi",
        "AWS, Azure veya GCP sertifikaları",
        "Microservices ve serverless architecture",
        "Security ve compliance bilgisi",
        "Network ve infrastructure design",
        "Cost optimization stratejileri",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Multi-cloud platform deneyimi",
        "Kubernetes ve container orchestration",
        "Terraform veya CloudFormation IaC",
        "CI/CD ve DevOps best practices",
        "Leadership ve teknik mentörlük deneyimi"
      ]
    },
    "location": "Ankara / Uzaktan",
    "salary": "120.000 - 160.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 2
  },
  {
    "title": "DevOps Engineer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak DevOps mühendisi arıyoruz. CI/CD pipeline kurulumu, infrastructure automation ve monitoring sistemleri geliştirme konularında deneyimli adaylar arayışındayız. Containerization, orchestration ve infrastructure as code konularında yetkinlik beklenmektedir. Deployment strategies, rollback procedures ve disaster recovery konularında uzmanlaşma önemlidir. Monitoring, logging ve alerting sistemleri kurma konularında deneyim gereklidir. Security best practices, compliance ve audit konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 4 yıl çalışma tecrübesi olan, teknoloji sektöründe DevOps deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl DevOps deneyimi",
        "Docker ve Kubernetes bilgisi",
        "AWS veya Azure cloud platform deneyimi",
        "CI/CD pipeline kurulumu (Jenkins, GitLab CI, GitHub Actions)",
        "Linux sistem yönetimi",
        "Infrastructure as Code (Terraform veya CloudFormation)",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Prometheus ve Grafana ile monitoring",
        "Ansible veya Chef ile configuration management",
        "Elasticsearch ve Logstash deneyimi",
        "Python veya Bash scripting",
        "Network ve güvenlik bilgisi"
      ]
    },
    "location": "İzmir / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "2 yıl",
    "daysAgo": 3
  },
  {
    "title": "React Native Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak mobil geliştiricisi arıyoruz. Cross-platform mobil uygulamalar, native module entegrasyonları ve performance optimization konularında deneyimli adaylar arayışındayız. React Native framework, TypeScript ve state management konularında yetkinlik beklenmektedir. Platform-specific optimizations, native modules ve third-party SDK entegrasyonları konularında uzmanlaşma önemlidir. App store deployment, version management ve update strategies konularında deneyim gereklidir. Performance profiling, memory management ve battery optimization konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 4 yıl çalışma tecrübesi olan, teknoloji sektöründe mobil uygulama geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl React Native geliştirme deneyimi",
        "TypeScript bilgisi",
        "Redux veya MobX state management",
        "RESTful API entegrasyonu",
        "iOS ve Android deployment süreçleri",
        "App Store ve Google Play Store yayınlama deneyimi",
        "Git versiyon kontrolü"
      ],
      "niceToHave": [
        "Native module geliştirme (Objective-C, Swift, Java, Kotlin)",
        "Firebase entegrasyonu",
        "Push notification implementasyonu",
        "Performance optimization",
        "Automated testing (Jest, Detox)"
      ]
    },
    "location": "Bursa / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "3 yıl",
    "daysAgo": 4
  },
  {
    "title": "Python Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak Python geliştiricisi arıyoruz. Backend API geliştirme, data processing ve automation scriptleri geliştirme konularında deneyimli adaylar arayışındayız. Python programlama, Django ve FastAPI framework'leri konularında yetkinlik beklenmektedir. Database integration, caching strategies ve background job processing konularında uzmanlaşma önemlidir. Code organization, testing ve documentation konularında deneyim gereklidir. Performance optimization, memory management ve concurrent programming konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 4 yıl çalışma tecrübesi olan, teknoloji sektöründe Python geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl Python geliştirme deneyimi",
        "Django veya FastAPI framework bilgisi",
        "PostgreSQL veya MySQL veritabanı kullanımı",
        "RESTful API geliştirme",
        "Git versiyon kontrolü",
        "Linux sistem bilgisi",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Celery task queue",
        "Redis cache kullanımı",
        "Docker ve containerization",
        "Pytest test framework",
        "Machine Learning temel bilgisi"
      ]
    },
    "location": "Antalya / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "3-6 ay",
    "daysAgo": 5
  },
  {
    "title": "Vue.js Frontend Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak frontend geliştiricisi arıyoruz. Modern web uygulamaları, admin panelleri ve dashboard geliştirme konularında deneyimli adaylar arayışındayız. Vue 3 framework, Composition API ve state management konularında yetkinlik beklenmektedir. Component architecture, routing ve form handling konularında uzmanlaşma önemlidir. Performance optimization, code splitting ve lazy loading konularında deneyim gereklidir. Testing, code quality ve documentation konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 4 yıl çalışma tecrübesi olan, teknoloji sektöründe frontend geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl Vue.js geliştirme deneyimi",
        "Vue 3 ve Composition API bilgisi",
        "Vuex veya Pinia state management",
        "Vue Router ile routing",
        "HTML5, CSS3 ve JavaScript/TypeScript",
        "Responsive design ve mobile-first yaklaşım",
        "Git versiyon kontrolü"
      ],
      "niceToHave": [
        "Nuxt.js framework deneyimi",
        "Vite build tool kullanımı",
        "Webpack veya Vite konfigürasyonu",
        "Jest veya Vitest test framework",
        "Design system ve component library deneyimi"
      ]
    },
    "location": "İstanbul / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 6
  },
  {
    "title": "Angular Frontend Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak frontend geliştiricisi arıyoruz. Enterprise web uygulamaları, complex form yönetimi ve data visualization konularında deneyimli adaylar arayışındayız. Angular framework, TypeScript ve RxJS konularında yetkinlik beklenmektedir. Component architecture, dependency injection ve reactive programming konularında uzmanlaşma önemlidir. State management, routing ve lazy loading konularında deneyim gereklidir. Testing, code quality ve performance optimization konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 4 yıl çalışma tecrübesi olan, teknoloji sektöründe Angular geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 4 yıl Angular geliştirme deneyimi",
        "TypeScript bilgisi",
        "Angular CLI ve RxJS",
        "NgRx veya NgXS state management",
        "HTML5, CSS3 ve JavaScript",
        "RESTful API entegrasyonu",
        "Git versiyon kontrolü"
      ],
      "niceToHave": [
        "Angular Material",
        "Unit testing (Jasmine, Karma)",
        "E2E testing (Protractor, Cypress)",
        "Server-side rendering (Angular Universal)",
        "PWA development"
      ]
    },
    "location": "Ankara / Hibrit",
    "salary": "85.000 - 125.000₺",
    "contractDuration": "2 yıl",
    "daysAgo": 7
  },
  {
    "title": "Java Spring Boot Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak Java geliştiricisi arıyoruz. Enterprise backend sistemleri, microservices ve API gateway geliştirme konularında deneyimli adaylar arayışındayız. Spring Boot framework, Java ve database technologies konularında yetkinlik beklenmektedir. Microservices architecture, service discovery ve inter-service communication konularında uzmanlaşma önemlidir. Code organization, design patterns ve best practices konularında deneyim gereklidir. Testing, code quality ve documentation konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 5 yıl çalışma tecrübesi olan, teknoloji sektöründe Java geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 5 yıl Java geliştirme deneyimi",
        "Spring Boot ve Spring Framework bilgisi",
        "PostgreSQL veya MySQL veritabanı kullanımı",
        "RESTful API geliştirme",
        "Hibernate ve JPA",
        "Maven veya Gradle build tool",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Spring Cloud ve microservices",
        "Docker ve Kubernetes",
        "RabbitMQ veya Kafka message broker",
        "JUnit ve Mockito test framework",
        "Elasticsearch veya Solr deneyimi"
      ]
    },
    "location": "İzmir / Hibrit",
    "salary": "110.000 - 150.000₺",
    "contractDuration": "3 yıl",
    "daysAgo": 8
  },
  {
    "title": "QA Automation Engineer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak test otomasyon mühendisi arıyoruz. Test otomasyonu framework'leri, end-to-end testler ve performance testing konularında deneyimli adaylar arayışındayız. Selenium, Cypress ve Playwright gibi test araçları konularında yetkinlik beklenmektedir. Test case tasarımı, test data yönetimi ve regression testing konularında uzmanlaşma önemlidir. API testing, integration testing ve load testing konularında deneyim gereklidir. CI/CD entegrasyonu, test reporting ve metrics tracking konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 3 yıl çalışma tecrübesi olan, teknoloji sektöründe test deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 3 yıl QA otomasyon deneyimi",
        "Selenium WebDriver veya Cypress",
        "Java, Python veya JavaScript programlama",
        "TestNG, JUnit veya Jest test framework",
        "API testing (Postman, REST Assured)",
        "Agile metodolojiler deneyimi",
        "Test planlama ve raporlama"
      ],
      "niceToHave": [
        "Playwright veya Puppeteer",
        "Performance testing (JMeter, Gatling)",
        "BDD framework (Cucumber, SpecFlow)",
        "CI/CD entegrasyonu",
        "Test reporting ve analytics araçları"
      ]
    },
    "location": "Bursa / Hibrit",
    "salary": "70.000 - 110.000₺",
    "contractDuration": "3-6 ay",
    "daysAgo": 9
  },
  {
    "title": ".NET Core Backend Developer - YTK Career",
    "description": "Anlaşmalı olduğumuz teknoloji projesinde çalışacak backend geliştiricisi arıyoruz. Enterprise backend sistemleri, API geliştirme ve microservices geliştirme konularında deneyimli adaylar arayışındayız. .NET Core framework, C# programlama ve SQL Server konularında yetkinlik beklenmektedir. Entity Framework Core, LINQ ve stored procedures konularında uzmanlaşma önemlidir. Authentication, authorization ve security best practices konularında deneyim gereklidir. Code organization, design patterns ve SOLID principles konularında bilgi sahibi olunması beklenmektedir.\n\nBu pozisyonda en az 5 yıl çalışma tecrübesi olan, teknoloji sektöründe .NET geliştirme deneyimi bulunan profesyoneller arıyoruz.",
    "requirements": {
      "mustHave": [
        "En az 5 yıl .NET Core ve C# geliştirme deneyimi",
        "Entity Framework Core ile veritabanı yönetimi",
        "RESTful API tasarımı ve geliştirme deneyimi",
        "SQL Server veritabanı kullanımı",
        "Microservices mimarisi bilgisi",
        "Git versiyon kontrolü",
        "İyi düzeyde İngilizce"
      ],
      "niceToHave": [
        "Docker ve Kubernetes deneyimi",
        "Azure cloud platform",
        "gRPC ve Protocol Buffers",
        "Unit test yazma deneyimi (xUnit, NUnit)",
        "CI/CD pipeline kurulumu"
      ]
    },
    "location": "Antalya / Hibrit",
    "salary": "110.000 - 150.000₺",
    "contractDuration": "1 yıl",
    "daysAgo": 10
  }
]
